{"label":0,"sentence":"Ice-T stars as Mason a homeless African-American who finds himself hunted by wealthy hunters (Rutger Hauer,Gary Busey,Charles S. Dutton, F.Murray Abraham,William McNamara and John C. McGinley) however Mason proves to be much harder prey then the usual targets in this ridiculous and slow paced actioner which takes too long setting up actionscenes and then totally botching them."}
{"label":0,"sentence":"If you want to laugh like crazy, rent Cage. Cage is about two war heroes, Billy and Scott who are best friends. When Billy is shot in Vietnam, he is unable to fend for himself, so Scott takes him in.<br \/><br \/>I have never seen a movie with more gay references to the two main characters. Billy and Scott love to \"wrestle\" and Scott tells Billy that he is \"still sore from last night,\" among other things.<br \/><br \/>Wonderful catch phrases like \"Shut the sh!t up\" and \"Ping Pang Pong, cut the sh!t\" will keep you laughing for hours. The native American guys that are supposed to be playing Mexican gang members are also top notch. As they say, it's \"party time right now. Ba-ba-ba-ba ba-ba.\" I could go on forever, but just watch this movie and laugh your a$$ off. It was so funny I went out and bought the DVD for $5.99"}
{"label":0,"sentence":"I sat through this movie expecting a thought-provoking, fact-based film. But instead was given some of the least thought out arguments against the Christian faith imaginable. For instance, in an effort to prove that Christianity is inherently violent, the narrator constantly quotes the bible without giving context, and thus altering the meaning of the text. Jesus is quoted as commanding the execution of those who disobey him, when in fact, the quote is from a parable Jesus told, involving a king who is then quoted. Thus the narrator makes it appear as if Jesus says one thing when he is actually telling a story where one of his characters says it. This is dishonesty in a very obvious form. Is this really what Atheism has to offer the world? This film also attempts to use the success of the Passion of the Christ over Jesus Christ: Superstar and The Last Temptation of the Christ as evidence that Christians are bloodthirsty. He makes no mention of the fact that the Passion was the most historically accurate Bible-film to date. He makes no mention of the fact that it was actually the best liked by critics of the bunch. He then edits in a series of violent images from the Passion as if to hammer home his point. Ironically, he makes no mention of The Texas Chainsaw Massacre which came out a few months later and plays violence for entertainment, versus dramatic effect.<br \/><br \/>One thing that really bothered me was his mockery of people who actually knew more about the subject matter than he did. All the Christians he interviewed were average schmoes in the parking lot of Billy Graham's New York Crusade. Atheists he interviewed for the film were notable authors and scholars. He asked the Christians how the Christian movement started, and of course, they said it started with the Holy Spirit coming to the disciples at Pentecost. Which is correct (Acts 2). He then gives the commentary, \"isn't it funny how so few Christians seem to know the origins of their own faith?\" and proceeds to explain that the apostle Paul started Christianity after being stopped on the road to Damascus. The poor chap seems convinced that Acts 9 happens before Acts 2. More deception? Or is this simply ignorance? He also throws around nonsense that Paul didn't believe Jesus was a real person. Are you kidding me? 1 Corinthians 15 describes Jesus death and resurrection being witnessed by people (whom Paul names in the passage) for the Corinthians to question if they are in doubt!<br \/><br \/>There are many many other examples of how full of crap this 'documentary' is. But because I don't have time or patience to go into them all, I'll skip straight to the end. It's obvious throughout the whole movie that the narrator has an emotional vendetta against his upbringing in the church. And the climax interview is HIS CHILDHOOD PRINCIPLE! In a last-ditch attempt to disprove the Christian faith, the narrator tries to make a fool out of someone who gave him a detention as a child. Is this what passes as an intellectual documentary for the Atheist community? Surely there are intelligent Atheist filmmakers out there who can make a documentary that isn't a load of made-up crap passed off as 'facts'."}
{"label":0,"sentence":"2 stars for Kay Francis -- she's wonderful! And she didn't deserve this horrible tripe that Warner Bros. threw her way! <br \/><br \/>The two-pronged premise that this movie is based on is ridiculous and unbelievable in the extreme. Kay is a small-town wife and mother who yearns for something bigger: she wants to be an actress. When a big-shot actor comes to town and invites Kay to his hotel to talk about possibilities, Kay tells her husband she's going to the movies. The hubby's biddy of a mother puts a bug in hubby's ear that Kay's not being truthful, and he sets out looking for her. He finds her w\/ the actor in the hotel (they are only talking!) and he slugs the guy, who falls over a railing, lands face-first in a pond (lake?), and dies. Now here's the two unbelievable premises upon which the rest of the movie is based: <br \/><br \/>1) the judge tells the jury that if it's determined that the man died *before* his head went into the water, that they must find the hubby guilty of first degree murder. (Whaaaaa?????? I think slugging a guy in a fit of rage would count for manslaughter or murder 2 at the most, not FIRST DEGREE murder. Give me a break! But the plot required him being found guilty of murder 1 so that he could be sent to prison for life. Whatever.) <br \/><br \/>2) the hubby's lawyer, after the conviction and sentencing, tells Kay that it's all HER fault. His reasoning is that if she hadn't gone over to the actor's room, then her husband wouldn't have had to go after her and slug the guy and kill him. He tells her that she's the guilty one, not her husband, and she nods and agrees. What. The. Hell?!?!?! The rest of the movie is all about Kay trying to achieve fame and money in order to get her husband released from prison and right the wrong she committed by causing him to kill the actor dude in the first place.<br \/><br \/>I can't even go on with this review. The movie was just all too painful. Four years earlier, in the pre-code days, you'd never have caught Kay playing such a wimp! In true Kay Francis fashion, though, she did do her best to make us believe that this woman was a believable character. I give her much credit for trying to breathe some life and credibility to this thankless role. This character was a far cry from pre-code Kay roles and real-life spitfire Kay Francis.<br \/><br \/>Steer way clear of this one! There are much better Kay Francis vehicles out there! (From personal experience, I can highly recommend Mary Stevens, MD and Jewel Robbery; also good are Dr. Monica and One Way Passage. I'm sure there's other great Kay flicks as well, but I'm only mentioning the ones I've seen and can recommend.)"}
{"label":0,"sentence":"If this could be rated a 0, it would be. From the atrocious wooden acting to the dull, plodding pace, the puerile exploitation angle and the sophomoric pseudolesbian titillation added purely for the sake of the sad viewers, this is a disaster of a film.<br \/><br \/>The plot is predictable, as from the beginning one is absolutely certain of what will happen to all of the characters and how the plot will commence. From a boring, unexceptional beginning to a pathetic and bleak ending, every single presence in this film is wasted, and every meagre scrap of talent dug up for this turkey is squandered.<br \/><br \/>If you want to watch something as relentlessly bleak with plenty of the same childish titillation, watch one of the Ilsa films. At least they're unapologetic and up-front about what they're trying to do. How something this horrendously bad ever managed to be rated above a 5 is a miracle of how people with no taste or discerning standards can sometimes come together for the most dubious of purposes.<br \/><br \/>It's not scary, it's not interesting, and above all it's not arousing in any sense of the word. It is, in my opinion, a crime; it is a crime that such a horribly offensive and incompetent piece of trash was ever conceived of and given the resources to come into existence, and even more a tragedy that it is still defended by some woefully misguided viewers.<br \/><br \/>Not even Elvira's cheerful personality and joking ways could soften the blow that this horrifying travesty of film is. Avoid it at all costs."}
{"label":0,"sentence":"This is yet another depressing and boring film about AIDS and tragedy. It begins very uneventful and predictable and continues throughout the movie. I kept waiting for it to pick-up, but unfortunately it never did. The acting is fair, but the script needs A LOT of work. And if you're looking for the nudity, don't waste your time with these not so hot actors. Due to the poor sound quality and lack of captions, I missed 1\/8 of the movie. If you have never seen over five gay films, or have recently come to terms with being gay, you may find this film interesting, otherwise it's your run-of-the-mill low budget movie. It ranks as one of the worst gay films I have ever seen."}
{"label":0,"sentence":"OK so i am like most people, give me free tickets and i will go and see most things, now that multiplex cinemas are so good (i remember the old \"flea pit\" single screen cinemas and i am the healthy side of 40). In England this film was released as \"Liar\", it's a dog. It is a total waste of good celluloid. 4\/10 for the photograpy and set only."}
{"label":0,"sentence":"My comment is for the Russian version of Space Race named Bitva za Kosmos (Battle for Space) shown on Russia's First Channel on April 10-13, 2006. Bad translation could have ruined some details but I doubt it's the case. The number of factual errors is such that it's impossible to list them, especially in the first episode (the development of first missiles). Even the U.S. half of the film contains multiple errors and omissions. The audience is not told of any V-2\/A-4 launches from the U.S. Three different Jupiter C rockets are launched with the same serial number 'UE' onboard. Apollo 1 is to be launched to the Moon, etc. In the Russian half, each and every person is ludicrous. Korolev is scared of NKVD, Glushko is saboteur and traitor, Mishin is alcoholic etc. Men as functions; no motivation, no life at all. Uniform and decorations are awful. Gagarin sings a frivolous song awaiting launch (I think this was added specially for Russian version)."}
{"label":0,"sentence":"How many centuries will pass until the Japanese\/Asian horror films abandon the long-haired ghost-woman shtick? Admittedly, they've managed to rip off \"Ringu\" a million times, and often it worked well - which just goes to show that originality isn't that much of a requirement in the horror genre (or that I'm very uncritical and easy to please?). However, this time around I found myself a little restless, somewhat bored. It's not a bad film, but it's at least half-an-hour longer than it should be, with its absurd 110 minutes length. Compared to many other Japanese horror films, OMC lacks atmosphere and excitement. Plus, the ending is confusing: it makes no sense at all. As for the ring-tone: Miike could have come up with a melody that is more effective than that forgettable little thing. Even though it was played a dozen times I can't even remember it - that's how scary it was. Speaking of Miike, for him this is something of a commercial venture, so if anyone thinks they might be getting perversion of the \"Bijita Q\" or \"Audition\" kind, they're wasting their time."}
{"label":0,"sentence":"I loved Dewaere in Series Noir. His talent is trivialized in \"The Waltzers\" aka \"Going Places\". Okay, it's a couple of guys flaunting convention in the most absurd and irredeemable ways; many folks find such behavior amusing. This was a boring, pointless exercise designed to shock. I find the smirk on Blier's face, the face behind the camera, annoying. Series Noir was a valid expression of personal liberty and licentious behavior. From the first moment when we see Patric Dewaere prancing in the abandoned lot we get an idea of the bewilderingly beautiful anti-hero we'll be spending time with for the next couple of hours. When we see him chasing the hapless middle aged female with his buddy Depardieu in \"Going Places\" we have fair warning that two hours spent with these chaps will be soul-draining. I have trouble eking even a \"3\" for this annoying distraction."}
{"label":0,"sentence":"Omen IV (1991) was a bad made-for-T.V. movie. Since the 80's were over, I guess the executives were experimenting in meth (the drug of choice during the 90's) because there is no other reason to explain this travesty. Why did they even bother making this? A t.v. movie? What were they mulling over when this one came up on the idea board? Did they even think for a second that this movie would catch on as. Perhaps they thought it could make it as a series? We'll never know. But I know one thing. This movie was the major reason why I never bought the Omen trilogy. They should have knocked off a couple of bucks instead of putting out this \"extra\" disc.<br \/><br \/>Omen IV is basically a average American family remake of the first film. Instead of a snot nosed punk kid, we get the spooky girl who's a total brat to everyone around her. If the family had stronger parenting skills, then none of the demonic events that have transpired in the past films would have never occurred. These parents need to put their foot down and do some real discipline! <br \/><br \/>Not recommended, best to avoid at all cost!"}
{"label":0,"sentence":"In Hollywood in the 1930's and 1940's, I think that every studio can make a western, except Warner bros. The few times they try, it always ridiculous (except, perhaps, for They Died with their Boots on - which is a cavalery western.) I have read that Humphrey Bogart, seing James Cagney with this big cowboy hat on his head, said that he looks like a mushroom. True! Cagney and Bogart are too urban, too XXe century to be credible in a western movie. The story here had no suprise, and it did't help. Every 10 minutes, I figure I can see Bogart and Cagney drops their little guns and put hands in a machine gun to get away from the set in a 1930's black car."}
{"label":0,"sentence":"Seriously, I don't even know where to begin. It's like somebody gave a bazillion dollar budget to an autistic third-grader and said 'make me a movie about the secret service'. The editing is ridiculous, the cinematography was random at best, every single syllable of dialogue was completely retarded and the directing ... well, was there even a director there? Everything was just so pointless and lame and pointless...and random....and lame.<br \/><br \/>Here's a SPOILER for you; this movie is the dumbest thing you'll ever see. <br \/><br \/>However, if you liked this piece, you'll also enjoy; Deterrance, Dark Blue, and a partial frontal lobotomy."}
{"label":0,"sentence":"This movie was packed pull of endless surprises! Just when you thought it couldn't get worse, they added more joints and more pink fuzzy-lined vans with raunchy sex scenes. As you can guess, I was a victim of the original version. We were tricked into watching it thinking it was Supervan, the host box which promised lasars, jail breaks, and much more. Who would have thought a Dollar Store Christmas present could have been so much fun!"}
{"label":0,"sentence":"I'm not a big fan of rom\/coms at the best of times. A few have been quite good (check of Dream for an Insomniac), but this one is just more of the same but less.<br \/><br \/>With a running time of 100min, I expect more than 1 laugh every 30mins. The only real belly laugh are when male strangers and friends instinctivly help out Lee's character.<br \/><br \/>All I can say is AVOID. I gaurentee there is at least 10 other movies on the shelf that deserve you $$<br \/><br \/>3 of out 10 (And only cos I'm a big Lee fan)"}
{"label":0,"sentence":"Average (and surprisingly tame) Fulci giallo which means it's still quite bad by normal standards, but redeemed by its solid build-up and some nice touches such as a neat time twist on the issues of visions and clairvoyance.<br \/><br \/>The genre's well-known weaknesses are in full gear: banal dialogue, wooden acting, illogical plot points. And the finale goes on much too long, while the denouement proves to be a rather lame or shall I say: limp affair.<br \/><br \/>Fulci's ironic handling of giallo norms is amusing, though. Yellow clues wherever you look.<br \/><br \/>3 out of 10 limping killers"}
{"label":0,"sentence":"Jason Lee does his best to bring fun to a silly situation, but the movie just fails to make a connect. <br \/><br \/>Perhaps because Julia Stiles character seems awkward as the conniving and sexy soon to be cousin-in-law. <br \/><br \/>Maybe it is because she and Selma Blair's characters should have been cast the opposite way. (Selma Blair seems more conniving than Julia would be).<br \/><br \/>Either way this movie is yet another Hollywood trivialization of a possibly real world situation (that being getting caught with your pants out at your bachelor party not stooping your cousin), which while having promise fails to deliver.<br \/><br \/>There are some laughs to be sure and the cast (even if miscast) do their best with sub grade material which doesn't transcend its raunchy topic. So instead of getting a successful raunch fest (ie Animal House or American Pie) we are left with a middle ground of part humor and part stupidity (ala Meatballs 2 or something)."}
{"label":0,"sentence":"What is it with Americans and their hang-up with religious gobbledy-gook? To think this was a best-selling novel is incredible, but to pull it off as a movie you really need good acting and a script that delivers. In this case, all the good actors have gone to heaven and we're left with Kirk Cameron as a CNN-type journalist(!) trying to discover why a lot of people have simply disappeared. Oh yeah, there's a subplot about an evil world conspiracy and famine, or something. The good news is that this is done so cheaply, and with such inane dialogue, that it has sheer entertainment value in all of its unintended laughs. Not recommended for anyone with a 3-digit IQ."}
{"label":0,"sentence":"Horrible acting, Bad story line, cheesy makeup, and this is just the tip of the iceberg. I have never seen a worse movie in my life, 5 minutes in I decided to fast forward to see if anything redeeming would happen... It didn't. (Aside from a nice breast shot) The movie apparently was filmed in some furniture warehouse, and the same warehouse was used for at least 90% of the sets. You even see this same red chair in several different \"locations\" If you are going to make a film at least rent an office building and an apartment, not some warehouse which will echo all your actor's dialog.. (Note to producers) Renting a small office space and an apartment for a month is much cheaper than an entire warehouse, and both are quite a bit more versatile and believable) If you spend your money to rent this people I hope you got it with a return guarantee... You will be demanding your money back... I only spent $2.99 to rent this tonight and I feel ripped off."}
{"label":0,"sentence":"I have never seen such terrible performances in all my life.<br \/><br \/>Everyone in the entire film was absolute rubbish.<br \/><br \/>Not one decent actor\/actress in the whole film, it was a joke.<br \/><br \/>Reminded me of drama at school..."}
{"label":0,"sentence":"The story line was very straight forward and easy to follow and contained a lot of no-brainer comedy to a point where it just got boring. Some of the audience seemed to find it funny but I like more intelligent humor.<br \/><br \/>There were several known Swedish actors in the movie and their performance were decent considering the script. Lena Endre was good looking as always.<br \/><br \/>I don't remember the original movie so I can't say if it's better or worse.<br \/><br \/>If you enjoy movies like Sällskapsresan this movie might be worth taking a look at."}
{"label":0,"sentence":"This film was more effective in persuading me of a Zionist conspiracy than a Muslim one. And I'm Jewish.<br \/><br \/>Anbody go to journalism school? Read an editorial? Freshman year rhetoric? These alarmist assertions, presented in a palatable way, might prove persuasive. But by offering no acknowledgment of possible opposing arguments, nor viable (or any at all) solutions, few sources and each of dubious origin, makes the argument an ineffectual diatribe.<br \/><br \/>And thank goodness for that -- I wouldn't want anyone to leave the theatre BELIEVING any of this racist claptrap.<br \/><br \/>A good lesson for me -- and hopefully a cautionary tale for you -- to actually read about a film before seeing it."}
{"label":0,"sentence":"This movie starts out with an execution of a practitioner of witchcraft and his mistress. His head is chopped off and buried separately of his body...sounds like \"The Thing that wouldn't die\" doesn't it? Well it does play out a little like that, but once the body is reunited with the head, all the interesting and gruesome deaths are done and the movie moves very slowly. I mean the movie is only 88 minutes long and I kept thinking \"When is it going to end\"? The characters in the movie are idiots for the most part and they pretty much deserve to die for being really stupid. The villain is also very bad as he is slow moving and really you wonder how he manages to do anything considering he is afraid of jewelery. The only thing to keep you watching after the head is reattached is the fact that there are so many boobs being flashed that you really begin to lose track. Still I want to see a horror movie, not a soft core porn flick and as a horror movie it is way to slow moving with way to many slow stretches to be even somewhat enjoyable. And don't read the back of the box as it made it out like there were flesh eating zombies attacking the town, there isn't...only a small scene where three or four zombies attack a house and are so easily repelled they are not a factor in the movie at all and their scene is rather pointless. So for the most part I say you should avoid this movie unless you come across it for really cheap."}
{"label":0,"sentence":"The story behind this movie is very interesting, and in general the plot is not so bad... but the details: writing, directing, continuity, pacing, action sequences, stunts, and use of CG all cheapen and spoil the film.<br \/><br \/>First off, action sequences. They are all quite unexciting. Most consist of someone standing up and getting shot, making no attempt to run, fight, dodge, or whatever, even though they have all the time in the world. The sequences just seem bland for something made in 2004.<br \/><br \/>The CG features very nicely rendered and animated effects, but they come off looking cheap because of how they are used.<br \/><br \/>Pacing: everything happens too quickly. For example, \"Elle\" is trained to fight in a couple of hours, and from the start can do back-flips, etc. Why is she so acrobatic? None of this is explained in the movie. As Lilith, she wouldn't have needed to be able to do back flips - maybe she couldn't, since she had wings.<br \/><br \/>Also, we have sequences like a woman getting run over by a car, and getting up and just wandering off into a deserted room with a sink and mirror, and then stabbing herself in the throat, all for no apparent reason, and without any of the spectators really caring that she just got hit by a car (and then felt the secondary effects of another, exploding car)... \"Are you okay?\" asks the driver \"yes, I'm fine\" she says, bloodied and disheveled.<br \/><br \/>I watched it all, though, because the introduction promised me that it would be interesting... but in the end, the poor execution made me wish for anything else: Blade, Vampire Hunter D, even that movie with vampires where Jackie Chan was comic relief, because they managed to suspend my disbelief, but this just made me want to shake the director awake, and give the writer a good talking to."}
{"label":0,"sentence":"A collection of Deleted scenes and alternative takes, edited together and with added voice-over to make it appear to take place after the events of the first. Pretty cool idea, but deleted scenes are left on the cutting room floor for a reason and this is further proof. As it's just not as funny as \"Anchorman\", and really let's face it THAT film wasn't exactly comedy gold either, so you get a 'movie' worse than one that was moderately funny. In my eyes that STILL puts it one or two notches above \"Kicking and Screaming\", or \"Bewitched\". Chross your fingers that \"The Wedding Crashers\" is a return to old school form (no pun intended) <br \/><br \/>My Grade: D"}
{"label":0,"sentence":"After watching this on the MST3K episode, I have to wonder how many movies this film borrows from. It seems to combine elements of Logans Run, Farenheight 451, Final Sacrifice and at least several others. At one point I was really expecting Cris Makepease to call Lee Majors ROWSDOWER. <br \/><br \/>I wonder if the director has any clue how many holes there are in the plot. like the fact that, even though gas is unavailable, there is plenty of it in abandoned gas stations, and the stations are located close enough together to keep an F1 race car going all the way across the country."}
{"label":0,"sentence":"I picked this one up because the music was done by Hans Zimmer, a customer of Metasonix modular synths (made by someone dear to me). The jacket art says \"the 2003 version\".<br \/><br \/>I give it one point for a strong female, one point for cheezy dialog and one last point for meg foster's light blue eyes, of which there are plenty of shots of.<br \/><br \/>It was fun seeing David MacCullum casually swimming (the pool has a plexiglass viewing window!), while his lady love was being chased by a psycho in Greece. <br \/><br \/>The sets were marginally impressive-that is, rich people's houses in L.A. and Mendanassos (sp?), where the castle was. I found myself wondering how they were able to keep up the cleaning with all the dust blowing around. The wind wasn't fierce enough to be believable to me. I kept thinking that the animal pelts on the furniture must be nasty...etc. and realized that the film must be pretty boring if i am wondering these things when the supposed plot was unfolding. I stumbled over things like why did she light a fire, blow out the match, then throw the match into the fire?! Dumb stuff like that. It was clunky at best. Oh well. Robert Morely got to have a bit of fun with his kooky geezer character and a nice vacation out of it."}
{"label":0,"sentence":"I've seen some bad things in my time. A half dead cow trying to get out of waist high mud; a head on collision between two cars; a thousand plates smashing on a kitchen floor; human beings living like animals.<br \/><br \/>But never in my life have I seen anything as bad as The Cat in the Hat.<br \/><br \/>This film is worse than 911, worse than Hitler, worse than Vllad the Impaler, worse than people who put kittens in microwaves.<br \/><br \/>It is the most disturbing film of all time, easy.<br \/><br \/>I used to think it was a joke, some elaborate joke and that Mike Myers was maybe a high cocaine sniffing drug addled betting junkie who lost a bet or something.<br \/><br \/>I shudder"}
{"label":0,"sentence":"Let's start by the simple lines. From the viewer's side, there a couple of good \"director details\", some points of view at the movie scenes that are nice. The special effects are good enough, a good acting\/good scenery also. But the story is way too simple. It shows how a elite Army bomb squad unit lives, acts and sometimes dies. It shows the drama of living in war. In my movie experience as a serious action movie \"addicted\" guy, I missed that click that gets my eyes and mind stuck on the screen. One of the things that need to be present in a movie in order to I consider it a good one is the ability of immerse the viewer in the movie reality and time. It didn't happened to me. I stayed \"conscious\", for the entire movie.<br \/><br \/>Honestly speaking, I think that this movie gained its place in fame based on the \"subconscious\" appeal of American patriotism, a healthy and genuine feeling, but not the adequate use as a movie fame generator. More than a movie about war, it grows its popularity based on that.<br \/><br \/>A simple thought: if this was a world war II or I movie, only changing time, with everything remained the same, would it be this awarded? Sure not. Why? Because there are great ones that elevate the bar way to high.<br \/><br \/>Compared against its rivals in the Oscars, I don't think that all of the prizes it won are correctly awarded."}
{"label":0,"sentence":"I honestly want the last 30 minuets of my life back.<br \/><br \/>The only person that is fit to watch this movie is Helen Keller I kept saying to myself this has to get better this has to get better.<br \/><br \/>Then the zombies finally showed up and they had some raccoon paint on there eyes.<br \/><br \/>They talked like regular people.<br \/><br \/>One drove a car.<br \/><br \/>Some voodoo woman asked what one of the \"Zombies\" wanted and the \" zombie\" said ( I want to Dance)<br \/><br \/>( THAT WAS IT) Out came the movie I couldn't take it any longer Can I sue for a ½ hour of my life?????"}
{"label":0,"sentence":"I just saw Adam Had Four Sons for the first time and the thing that struck me was that I believe that the model used was Theodore Roosevelt and his four sons. They were approximately the same ages as the four boys in this film. Warner Baxter in his portrayal of Adam Stoddard talked about the same values and family tradition that you would have heard from our 26th president without some of the more boisterous aspects of TR's character. <br \/><br \/>Like TR all of the Stoddard sons serve in World War I, in this case though the youngest only loses an eye instead of being killed. <br \/><br \/>But what if a female minx gets into this all male household and disrupts things? That's Susan Hayward's job here. In one of her earliest prominent roles, Hayward is a flirtatious amoral girl who marries one son, has an affair with another, and starts making a play for the third. It's an early forerunner of the kind of a part that later brought her an Oscar in I Want to Live.<br \/><br \/>I suppose that with as powerful a model of decorum as Theodore Roosevelt was and Warner Baxter portrays, everyone is afraid to tell Father what's going on. The sons and also their governess Ingrid Bergman. Here's where the plot gets a little silly. Bergman is introduced to us as a governess hired by Baxter and wife Fay Wray for their kids. Wray dies and Baxter suffers some financial reversals in business. Bergman has to be let go. She goes back to France and years later comes back to the family when the kids are grown up. <br \/><br \/>I'm sorry, but I can't believe the kids need a governess now. Hayward is quite right when she confronts her that it wasn't the kids who brought her back. In the normal course of things, Bergman would have gotten on with her life. <br \/><br \/>One of the previous reviewers said that a quarter to a third of the film I have was edited out. Possibly that could be the reason for the many plot holes we have.<br \/><br \/>It's too bad that Ingrid and Susan could not have done another film together in the Fifties when Hayward was at her heights and Bergman had just made a comeback.<br \/><br \/>Susan Hayward is the main reason to see Adam Had Four Sons. And I'm willing to believe that a good deal of Ingrid was left on the cutting room floor."}
{"label":0,"sentence":"In Cold Blood was one of several 60s films that created a new vision of violence in the Hollywood film industry. Capote coined the phrase \"nonfiction novel\" to describe the book on which this film is based, and the spirit of that form was carried over into the film script, which he co-wrote. Despite the fact that we were well into the era of color film, Richard Brooks elected to present this film in black and white to underscore both the starkness of the landscape and the bleakness of the story. This is the first problem with the TV remake --color changes the tone of the story. In addition, the confinement of shooting a film for TV makes reduces the options of how the shots are framed and focused. As a result, we lose the dramatic clash which makes the second part of the original film (police interviews, trial, imprisonment, and execution) so claustrophobic. On the small screen, it's just another version of Law and Order spin-offs. <br \/><br \/>Hollywood's search for scripts continuously takes it back to movies that were successful in another age. Usually, that's a mistake, and this is no exception.<br \/><br \/>All of the actors are competent. The script is OK. The directing doesn't get in the way. It's just that the movie doesn't work as well as the original precision instrument. It doesn't hook the viewer into the ambivalence toward Smith and Hickock that the original film provokes. At the end of the TV version, we are left with the feeling: \"Ho hum, who cares?\"<br \/><br \/>See the original first, on as large a screen as you can, then watch the TV version simply to understand why the first one was such an important film in 1967.<br \/><br \/>Wouldn't hurt to also go on line and read a bit about Capote and the original book. It will help you to understand the extraordinary effort he put into the material, and also some of the controversy surrounding both the book and the movie.<br \/><br \/>I actually only gave this a 4 because I save the bottom 3 rankings for true bombs--the kind that enrage you about having been sucked into spending an"}
{"label":0,"sentence":"the only thing great about the movie is its title. In this case, \"Snake On a Plane\" is example of not judging the book by its cover, the title says nothing about the movie. When I went to the theater, I wasn't expecting Citizen Kane, I was expecting Independence Day, a movie that's pure popcorn fun, but instead, I got that horrible Roy Liotta movie called \" Turbulence\" Yes, this is how bad SOAP is. The only thing make SOAP better is its title. And it's not even the apporiate title for the movie, the wasn't even a glimpse of \"snake\" or \"plane\" 40 minutes into the movie! What a false advertising! If it wasn't for its title, SOAP would be just another unforgettable cheap B-grade summer movie. And the R rating? It has to be the most undeserved R rated movie of all time! The makers of the movie only add a few f word to make this a R, All of the violence are kept pg-13 level. You know what's really R rated? The R rated superstar Edge! See him at Summerslam instead of waste your money on a snake!"}
{"label":0,"sentence":"James Gandolfini is a good actor so what ever did he take a role in this piece of unfunny rubbish. Affleck is just a lightweight who just can't cut it, the rest of the cast are truly unforgettable. I saw this in the USA in an empty theatre, I soon knew why the place was empty after about 10 minutes. I walked out before the end it was so bad, so imagine my surprise when back in England I saw the movie had a glowing report from that yoyo \"Paul Ross\" in one of the down market Sundays. I always rely on Ross to save me money on cinema tickets, if he says the movie is good, I get straight on this very website to check it out. This movie should have gone straight to £1.99 DVD in a supermarket near you."}
{"label":0,"sentence":"After watching some of HBO's great stuff - Band of Brothers, Rome, etc. - I must say I had pretty high expectations before watching the first episode of \"True Blood\". Jeez. Often the script seemed to be written by an 8-year-old, some parts are just horribly filmed, (The scene in which she \"saves\" Bill, I mean come on. She throws a chain at the guy and ow! it goes around his neck and it magically chokes him! That was pretty embarrassing if you want my opinion. Or a few moments before that scene, when she finds out that the couple is gone with Bill, ridiculous. She hears them plan their stuff, and like 5 seconds later, magic! The 3 of them are gone, and without any struggle or noise or anything!<br \/><br \/>I mean the idea of the show seemed interesting, mysterious, intriguing, vampires co-existing with human in our modern society... but honestly I don't think they really wanted to make more of this than a petty soap show, that the average teen girl watches all the time but that nobody else cares about... Unfortunately, the script is written poorly, mediocre at best. It's shallow and extremely predictable. Often I thought that this was some kind of a joke or something. <br \/><br \/>The actors deliver really unconvincing performances, if you want my opinion. They seem to take the show very lightly, as if it were some kind of a regular, low budget family TV show (well maybe thats what it is, if you take away the family part). The only actor that seemed somewhat good to me was Stephen Moyer in the role of Bill, considering the poorly written, extremely short replies he had to say \"What are you...\" \"Can I give you a call sometime...\", I think he did good in bringing out the somewhat mysteriously scary part of a vampire that anyone with a vampire role must have, actually. Anna Paquin was okay as well, but not more. But the guy, playing her brother though, jeez, he's horrible. The scene in which he gets arrested is just simply a shame to modern television. The acting is bad, the construction site looks fake to the bone, and the two other guys \"Why is he getting arrested? Uh.. I dunno...\" That was pretty embarrassing. <br \/><br \/>Another thing that I think was completely missed was the way they presented Sookie's psychic powers. They make us hear what people think AND speak both at the same time and thats just wrong. Often it just seems unnecessarily chaotic, as if people's thought were some sort of an annoying radio channel, and that when she comes close to em she hits the right frequency level and has to hear everything that they think. <br \/><br \/>And finally, the sex scenes are just plainly unnecessary and that vampire sex tape thing was just totally disgusting. <br \/><br \/>Don't get me wrong - I wrote all these comments not because I thought the show was BAD, but because I was very disappointed. I expected quality stuff. I didn't think it was going to be like that. It's definitely not a GOOD show though. Mediocre at best."}
{"label":0,"sentence":"I could not, for the life of me, follow, figure out or understand the story. As the plot advances it too stays incomprehensible. I'm going to guess and say that there was a preproduction story\/plot problem that never got sorted out. The producers could never separate the many details that the novel, or any novel, has the time and space to create from the other idea, which was to make a movie about a serial killer and the killer's pursuit by the police. They ended up with too many things happening in a proscribed feature film time limit. Too bad really because they had a solid cast, a director who knows how to move things around and excellent cinematography. In fact, a well made movie that one could enjoy and relax with for a couple of hours."}
{"label":0,"sentence":"Easily the worst movie I have ever seen in my life. Direction : none. Story: pathetic. Screenplay : that will be a good idea. There is a lot of gratuitous graphics, all of pathetic quality. Preserve your sanity, dont ever see this movie !"}
{"label":0,"sentence":"This is just typical Bruce Willis, action movie schtick. Watch it with some popcorn and your buddies. Rent it, to save money.<br \/><br \/>None of it is realistic. The battles aren't realistic. The soldiers aren't realistic. The victims aren't realistic. And why was Tom Skerritt's character talking to Willis from the DECK OF THE CARRIER? What's up with that? He can't do that from inside the ship?<br \/><br \/>Of course, Bruce W. gets a machete wound. There's a bunch of average explosions.<br \/><br \/>If this movie accurately represents the Navy SEALS, then don't get stuck in Africa expecting them to come rescue you!<br \/><br \/>The noble attack on the village bothered me the most. \"Front row seats to an ethnic cleansing\"...as Bruce looks at the slaughter going on in town. So what does he do? He crawls into town on his belly. Yep. How many died while they were putzing around? Oh well...a body count was needed, I guess.<br \/><br \/>And if that one African guy was so important, why didn't he get on the chopper with the elderly and children? Can he say \"Duh?\" <br \/><br \/>Finally, the movie was very dark. Not just in plot, but so much happens at night it was difficult to make out what was going on.<br \/><br \/>Rent it."}
{"label":0,"sentence":"I'm going to spend as much time on this review as the writers did on the script. This is easily THE WORST sequel EVER made.<br \/><br \/>They KILLED Navin Johnson. Not only was Mark Blankfield's performance GOD-AWFUL, so was everyone elses!! The physical comedy was forced, flat and predictable. The script seemed to have been written by mongoloid monkeys using the pen names Ziggy Steinberg and Rocco Urbisci. How the producers managed to squeeze out such vile cinematic excrement is beyond me. They even managed to make veteran actor Ray Walston look like a talent-less buffoon. Director Michael Schultz should be ashamed of himself.<br \/><br \/>I want the 96 minutes of my life I spent watching this befouled memory of a brilliant comedy back so I can try and convict everyone involved for this cinematic atrocity."}
{"label":0,"sentence":"This thought long lost flick sometimes comes available on the web. So I bought me a copy. Well, of course the acting is terrible and the story line is childish but it does have his moments. I think people who searched this one also knows the backstory of it. It was made by a grindhouse cinema owner for an extreme low budget. But for me he surely didn't spoiled the money on props but on the make up. The make up is for that kind of flick well done. The zombies are watchable and the gore is intact. The only problem with that kind of movies is the quality of the pelicule. It's terrible, luckely no hiss on the sound but sometimes it's way too dark. So you have to watch clearly to see the gore. In a funny way they tried to sell this one as really not for the squeamish. A voice-over tells in the beginning of the movie to watch out for a sign and a man appearing with green flashes, that tells you there is gore on the way. Of course that doesn't work, made me think of Cannibal Girls, had that annoying bell when the red stuff started to flow. They had the original idea, Cannibal Girls was made a year earlier. Don't go for the storyline, go for the zombies and notice a continuity mistake. When the girl and guy are making love first she takes of her bra, then they make love and suddenly her underwear is back on...try to do that, or am I getting a bit offline,...eat it you ugly corpses"}
{"label":0,"sentence":"Rumor has it that when the NASA Technical Advisors to this film were asked to keep the picture believable, they laughed for several hours. After all, unless you are a politician or work\/crew the shuttle, you are not going to get in the shuttle. Furthermore, Space (Cadet) Camp is in Alabama, not Florida.<br \/><br \/>The truth is everyone on Earth will win multi-billion dollar lottery prizes before the events depicted in this film ever become possible. This film was meant for kids, and had to have been written by one, because they are not aware of the myriad restrictions and requirements regarding access to KSC\/CCAFS.<br \/><br \/>This is the most useless film of all time, and it was a well deserved flop."}
{"label":0,"sentence":"I just got back from the film and I'm completely appalled. This movie is an absolute mockery to all of mankind. The theatre I was in maybe had 4 other people. This movie was recommended to me and I couldn't believe that this person liked it. I can't believe that any sane human would like it. There was no plot NO PLOT AT ALL. It was a joke. How can you make a movie about nothing. This movie only goes to show why Hollywood is in such a shambles. I can only just look at the spiral of the \"Horror Movie\" industry and giggle. What a travesty to all filmaking, this is true of all the new \"teen horror flicks\" Grudge,Boogeyman,Ring,Saw series. It is all such trash. Don't support this kind of hogwash!"}
{"label":0,"sentence":"Really, truly, abysmally, garishly, awful. But actor Clayton Moore (the movie Lone Ranger) acquits himself competently as an actor. He's the only one.<br \/><br \/>A rare treat, for five minutes, if you want to plumb the depths of grotesquely transparent special effects, southern California as \"the moon\" (again and again and again), and acting so woodenly inept that it may be a spoof . . . except that it's clear that it isn't--no humor here, except unintentionally.<br \/><br \/>The dialogue may be worse than any of these other aspects, and the costumes . . . well, enough said. Plot? What plot? Bad guy (well, head bad guy) and his henchmen, including his earthly agent called Krog (listen carefully or you'll suspect it's a spoof on the name of McDonald's founder Ray Kroc)and his unbelievably inept gunsels (who, however, have handguns that never need reloading; as does Commando Cody, so there are numerous firefight standoffs).<br \/><br \/>Enjoy."}
{"label":0,"sentence":"Thank you Hollywood. Yet another movie classic utterly ruined by a cheap, shallow, effect-heavy and redundant remake. The original \"Planet of the Apes\" was an intelligent and thought-provoking movie with a very clear message. It was a movie that focused almost entirely on dialogue, which sounds very dull but was in fact very interesting. <br \/><br \/>This movie, on the other hand, seems to have done away with pretty much ALL the dialogues. Instead of a great movie we get an incredibly stupid two hour chase movie. Dialogue has been reduced to a mere minimum, character interaction and development are non-existent and most of the time it's extremely hard to figure out what's going on. Instead, we get a bunch of pointless action scenes, some marginally funny one-liners and some very hollow quasi-intelligent conversations. <br \/><br \/>The only thing worth mentioning about this movie is that it looks absolutely fantastic. The make-up of the apes is magnificent, and the sets and backgrounds are beautiful too. However, this does not distract from the fact that \"Planet of the Apes (2001)\" is a very shallow and simplistic movie, filled with paper-thin characters, stupid dialogue and a nearly non-existent plot. Please Hollywood, stop ruining great movies by turning them into senseless blockbusters.<br \/><br \/>Oh yeah, the ending did not make ANY SENSE WHATSOEVER.<br \/><br \/>* out of **** stars, mainly for the visuals<br \/><br \/>"}
{"label":0,"sentence":"First off, I really loved Henry Fool, which puts me in a very small pool of movie goers. Parker Posey is one of best actresses on-screen today. But this film was a full-out travesty. Watching Hartley and the actors talk about the film in the extras - so full of pride, and making pointless analogies to Star Wars - was stomach-turning. This was hype on the producers part (HDNET) realized to the max. A true example of the Emperor and his new clothes. Mostly I feel that Hal has spoiled HENRY FOOL forever. I don't think I can ever see it again in it's pure, innocent light.<br \/><br \/>Remember Hal, you can FOOL some of the people some of the time... etc. The director would be nowhere today if all he did was churn out meaningless garbage. Sadly, it's a pure example of the lesson taught in the film ADAPTATION. The story must be exciting and active, or its box-office hopes are dim indeed. Never mind a decent story. For the actors, it was like trying to act in a straitjacket.<br \/><br \/>The score, I believe Hartley's, is tasteless. With drum hits walking all over dialog. There was one Apple Soundtrack loop I recognized that gave me a smile.<br \/><br \/>When I saw the trailer, I thought, oh, they're just trying to grab a new audience. But it's really this ridiculous ride. I'd be happy to spoil this movie for you, but it's been done. It's rotten. The FOOL franchise is dead. Long live Henry Fool."}
{"label":0,"sentence":"...Or, more precisely, so bad that you are going to have the time of your life laughing your ass off when you watch it! James Sbardellati's \"Deathstalker\" of 1983 is certainly one of the most awful productions the Sword & Sorcery sub-genre has brought along, but it is highly amusing. The acting is terrible, the plot is pure crap, and the effects and photography couldn't be more amateurish. But it is the bad acting, the cheesy effects, and the many errors, that makes this movie so hilarious.<br \/><br \/>- SPOILERS AHEAD -<br \/><br \/>Deathstalker (Rick Hill) is an extremely strong and skilled warrior. One day, a good witch tasks him to unite the three powers of chaos and creation, a sword, an amulet and a chalice, in order to free the country from its brutal ruler, the evil king and sorcerer Munkar. Obtaining the sword is quite easy, but the amulet and the chalice are in Munkar's possession. Fortunately, the evil king has arranged a tournament in which the county's most skilled warriors fight each other until death. The winner is then to take the king's place. Of course, the king doesn't want anybody to take his place, an therefore he has planned to kill the winner (instead of just not arranging the tournament in the first place). Deathstalker is not only to obtain the the three powers of creation, but also to save the old, good king's gorgeous daughter (Barbi Benton) from the claws of evil Munkar. Luckily, he doesn't get bored on his way to the tournament, since he is allowed hump the gorgeous female warrior Kaira (Lana Clarkson) in the meantime...<br \/><br \/>The film has many great, incredibly stupid and funny scenes. Some of my favorite scenes include: <br \/><br \/>- Deathstalker beheads a bad guy with his sword. The head that falls down, however, is not that guy's head. The falling head has a red goatee, while the guy beheaded by Deathstalker had dark hair and no beard.<br \/><br \/>- When the character of female warrior Kaira (Lana Clarkson) is introduced, she is first seen in a black robe, hiding her face and body. Deathstalker's traveling companion Oghris (Richard Brooker) fights her, and during the sword fight her robe (under which she is, of course topless) opens, exposing her breasts. Her breasts are the first thing we see of Lana Clarkson, even before her face.<br \/><br \/>- The last warrior Deathstalker has to fight in the tournament, is a giant guy with the body of a man and the head of a pig.<br \/><br \/>- Evil Munkar has an ugly little creature locked in a chest. He feeds that little creature human eyeballs and fingers.<br \/><br \/>... There are many other unintentionally funny, hilarious, and great scenes. The acting is terrible but Barbi Benton and the late Lana Clarkson are eye-candy, and although I described this movie as 'unintentionally funny', I sometimes had the impression that some of the actors were absolutely aware of how crappy the movie is. There is a fair amount of gore, and lots of female nudity to keep the viewer entertained. \"Deathstalker\" is an incredibly awful movie, but I still highly recommend it. People with a sense of humor will have the time of their lives!"}
{"label":0,"sentence":"Same old same old about Che. It completely ignored the really interesting facts of Che's true character. Sodeberg redid the same boring narrative of Che. The silly seductive tale of an Argentinean rich-boy who was so shocked by poverty he became a Robin Hood fighting alongside the poor, until eventually he was murdered by the CIA. Yeah, yeah, heard it all before, BORING AND UNTRUE!. The reality of Che Guevara is very different and far more explosive! The facts show that he was a totalitarian with a messiah streak, who openly wanted to impose Maoist tyranny on the world. He was so fanatical that at the hottest moment in the Cold War, he even begged the Soviet Union to nuke New York, Washington or Los Angeles and bring about the end of the world. CHe urged Khrushchev to launch a nuclear strike against US cities. For the rest of his life, he declared that if his finger had been on the button, he would have pushed it. When Khrushchev backed down and literally saved the world, Che was furious at the \"betrayal\". If Che's recommendations had been followed, you would not be reading this review now. How a homicidal maniac became a pop icon would have made a much more interesting film. Incredible that no filmmaker has been daring enough to show the real side of Che and his posthumous media transformation. THAT WOULD MAKE AN Oscar WINNING FILM! I thought making independent film meant taking REAL RISKS and being GROUNDBRAKING! They only stick to \"safe counterculture themes\", to wit, \"Che cool\", \"Wall Street bad\", \"Republican= Nazi\", \"Bush ex Hitler\", \"NRA is worse than KGB\", \"Christians are fanatics and stupid\", etc...ad nauseum. Oooh, how daring, how mind blowing. Tres anti-mainstream and edgy. I wish they would have some real cojones and tackle the Independent Film Oligarchy! That would be truly daring!"}
{"label":0,"sentence":"It took 9 years to complete this film. I would think that within those 9 years someone would have said,hey, this film is terrible. I've seen better acting in porn movies. The story is tired and played. Abused child turns into serial killer. How about something new for a change. How about abused child turns into a florist? At least that would have been a new twist. Why is it that everyone with a camera and a movie idea (especially unoriginal movie ideas) thinks that they can be a director? I do admire the fact that they stuck with this film for 9 years to get it completed. That shows tenacity and spirit. With this kind of drive hopefully next time they can focus it on a better script. If you want to see a failed experiment in indie film making from a writer\/director from Michigan see Hatred of A Minute. If you want a good movie from a Michigan writer\/director stick with Evil Dead."}
{"label":0,"sentence":"For years Madonna has tried to prove not only herself, but the public eye, that she can act. Unfortunately, trying too hard while failing to shed her own persona doesn't mix well.<br \/><br \/>She seems to fare better when she's NOT the star of any movie: if you watch her in supporting performances in DESPERATELY SEEKING SUSAN (1985) or A LEAGUE OF THEIR OWN (1992), she actually comes off looking good. Since the story revolves on other actors, the weight of the expectation is taken off her shoulders by default.<br \/><br \/>The trouble starts when she is asked to be the star of a movie, regardless the genre. Being the focus of a plot that needs to be told in a visual way, whether it be good, mediocre or plain awful, she has to emote in ways that are akin to an actual movie performance as opposed to a video performance. This is the crucial difference between Madonna and, let's say, Bette Davis, or Meryl Streep. The latter two, even if the movie were to fail (because the visual storytelling lacked some effectiveness in having us relate to it, or because the script fell short, or because the actress per se was just not at her moment), there would be an extra something in their performances that would elevate the movie from being a complete bomb. Both Davis and Streep have had their share: Bette, having a longer career than Streep, in such fare as BUNNY O'HARE (1971) and WICKED STEPMOTHER (1989); Streep in SHE-DEVIL (1989). But at least there's been that naturalism in the way both attacked their roles that made us forget the banality of the movie and watch the performance.<br \/><br \/>Madonna, on the other hand, not being an especially gifted actress capable of really letting us in on her ability to convey a persona other than herself, fares much worse, and even in the hands of someone as Woody Allen in SHADOWS AND FOG (1992), an inferior classic, she in her pat screen time seems stilted and a little stiff, maybe even nervous, as if she were aware of the cameras and crew and just couldn't let go.<br \/><br \/>So here she tries yet once again to prove she can act in what is essentially a two-character movie. Guy Ritchie, more known for action movies filled in masculine energy, seems as adrift telling a story closer to someone of the likes of Michaelangelo Antonioni or Ingmar Bergman, who could tell a tale of two people with incredible ease. And at 89 minutes, the events which take place happen in such an unconvincing way that when the final half hour comes along and the story takes a dramatic turn, it doesn't feel sincere. From being an absolute witch with no redeeming values to suddenly being in love, this has to be the most unconvincing 180 degree turn since Fay Dunaway's Laura suddenly discovered her passion for Tommy Lee Jones in THE EYES OF LAURA MARS (1978). Equally unconvincing is Adriano Giannini's nasty turn around the middle of the movie -- it lacks any humor and feels genuinely psychopathic -- and when he gives in to Madonna's love, it's too quick to be believed. Filming this in slow music and a visual montage of lovemaking and beautiful scenery doesn't enhance or add upon this \"transformation\" from what would have been a story of survival between to unlikeable characters to a love story where both discover each other.<br \/><br \/>Trying to have an unsatisfying ending works against the movie as well -- it only makes it drag, bog it down, and when Madonna has to be filmed going from hope to devastation in a tight close-up, it feels she's trying too hard. Many an actress have done better in conveying so much doing so little. Hers is a performance more suited to acting styles of the late 20s, early 30s where posturing compensated as acting a part or an emotion.<br \/><br \/>Could the movie have been better? Of course. There are a myriad of ways to have filmed it in a way that would leave the viewer feeling that these people could at least hope to see each other again -- it's been done before, in OVERBOARD (1987), for example. It could have had an existential undertone in which two very different people have to rely on each other but not necessarily change (to ensure a moral tone). Much dialog and unnecessary erotic scenes could have been spared for a more \"silent\" film look -- as in PERSONA (1966). It could have even been something of a thriller, providing that the Giannini character have a mean streak as Billy Zane had in DEAD CALM (1989). Even if it would have been done as a sex farce it would have worked better for Madonna as the over the top, uber-control freak getting her comeuppance. But with its mean streaked humor, without at least a glimpse of her character having a softer side that hides behind a mask of bitchdom, and without really defining Giannini's own character, this becomes another misfire trying to look like a battle of the sexes."}
{"label":0,"sentence":"This movie seems to send the wrong message. There can be morality without using Christ. Poeple of other religions, I believe, can get into heaven. I am a Catholic who goes to church every week, but I do not agree with such Christian arrogance. This is the worst time travel movie I have ever seen and I've seen Timeline."}
{"label":0,"sentence":"When I was at the movie store the other day, I passed up Blonde and Blonder, but something about it just seemed like it could possibly be a cute movie. Who knows? I mean, I'm sure most people bashed Romy and Michelle before they saw it, Blonde and Blonder might have just been another secret treasure that was passed up. But when I started watching it: Executive Producer Pamela Anderson, wow, I knew I was in for something scary. Not only that, but both of what were considered the pinnacle of hotness: Pam Anderson and Denise Richards, not to offend them, but they were not aging well at all and they're playing roles that I think were more meant for women who are supposed to be in their 20's, not their 40's. The story was just plain bad and obnoxious.<br \/><br \/>Dee and Dawn are your beyond stupid stereotypical blonde's, they really don't have a clue when it comes to what is going on in the world, it's just really sad. But when the girls are somehow mistaken for murder assassins, the cops are on their tale and are actually calling the girls geniuses due to their \"ignorance is bliss\" attitudes. They are set up to make a \"hit\" on a guy, and they think they're just going to \"show him a good time\", but the real assassin is ticked and wants the case and to kill the girls.<br \/><br \/>Denise and Pam just look very awkward on the screen and almost like they read the script the day before. I know that this was supposed to be the stupid comedy, but it was more than stupid, it went onto obnoxious and was just unnecessary. Would I ever recommend this? Not in a million years, the girls are just at this point trying to maintain their status as \"sex kittens\", it's more a sign of desperation and Blonde and Blonder is a huge blonde BOMBshell.<br \/><br \/>1\/10"}
{"label":0,"sentence":"It's very sad that Lucian Pintilie does not stop making movies. They get worse every time. Niki and Flo (2003) is a depressing stab at the camera. It's unfortunate that from the many movies that are made yearly in Romania , the worst of them get to be sent abroad ( e.g. Chicago International Film Festival). This movie without a plot , acting or script is a waste of time and money. Score: 0.02 out of 10."}
{"label":0,"sentence":"Geez, another Lifetime movie, but once again isn't exactly the worst movie in the world, but far from the best. I think the main problem is that it's pretty obvious who is responsible for what, and it's generally fairly predictable. Worse yet, some of the flashbacks ended up being confusing, and the viewer is left wondering \"Okay, how much am I supposed to care?\" One thing I did like is that the movie goes to show you that it's never THAT simple as \"the good guys are good and the bad guys are bad\", and sometimes it IS evil vs evil rather than good vs evil. Hadley didn't do what she did out of a sense of justice, she did it because she considered herself entitled to a job for being family, AND to eliminate the competition. As for Alicia, it simply proves that a victim isn't always a good person. Some of them really do \"have it coming\", even if \"it\" was a painful, horrible death. \"The Burning Bed\" is a great example of this, but the difference is that the vile man in \"The Burning Bed\" got exactly what he deserved. But, did Alicia \"have it coming\"? Some will say that she did, but others don't agree, and the law generally doesn't either.<br \/><br \/>As for acting, it's a mixed bag. Some do a good job, like Mia, but others just came across as indifferent to their roles. They were mostly wooden or simply not convincing. The music was pretty cool though and some of the scenes are nice and steamy, especially if you like girl\/girl action. The movie isn't badly shot at all, but given its glaring weaknesses, the strengths are in background, unfortunately.<br \/><br \/>I've heard rumors of a sequel, but given the years, I doubt it'll happen. But, I wouldn't be surprised if a sequel suddenly appeared. If Alicia is as EVIL, conniving and horrible as people say, then I don't think she'll be thinking, \"YAY! I woke up from a coma! Oh, Hadley was responsible? Oh! That's okay! I totally forgive her and want the charges dropped!\" No way Hadley would be in jail for long anyway, if she even does any time since no murder actually happened. <br \/><br \/>Anyway, worth checking out at least once!"}
{"label":0,"sentence":"It seems like this is the only film that John Saxon ever directed, and that he had the good sense to stop after that and stay in front of the camera. This movie is a dog, from start to finish, and it's dull and wooden with nothing much going for it. A Viet Nam war hero takes a job working for a mob boss, gets a bit too friendly with the wife and then the wife is killed by the mob boss himself & the war hero framed and sent to prison, death row, specifically. Now, this particular prison has been experimenting on inmates and is testing some formula that will turn men into the ultimate killing machine (a zombie). Of course, everything goes wrong and then there's all these infected people trapped in the prison, some of whom are turning into zombies and the rest who suddenly just don't want to be there anymore. This just goes on and on and on with nothing particularly much to show or say for itself, and I stopped it before the end, which seemed like it was coming a few times but no, it was apparently only getting set to take off on a different and equally dull path. If one watched to the end they may well become a zombie themselves, so don't risk it. 2 out of 10."}
{"label":0,"sentence":"I cannot believe that they managed to spend US$17million on this film. Spectacularly bad acting, egregious scripting and effects that you could do on your average PC, unbelievable plot contrivances...a reporter who can get an inexperienced stewardess a major job at the UN? What? Not only that, but the message of this film is so unsubtle that you come out feeling as if they've tried to batter you over the head with a full size crucifix. All this movie will do will preach to the choir and make everyone else laugh at such a ridiculous waste of money. If the makers of this film really wanted to sway people to christianity and show what it means to truly believe, they would have used the money to help people truly in need. Now, \/that\/ might have swayed some people into actually listening to them."}
{"label":0,"sentence":"How do I begin? This movie is probably one of the worst movies I have ever seen .It has no redeemable qualities .I just sat through this movie and it was a struggle.It failed to get even a single smile on my face.I find it hard to believe that anyone would distribute this horrible film. I felt that this movie was a failed attempt at distasteful humor. The only thing that was worth anything about this movie was the soundtrack, I'm pretty sure thats the reason I wanted to see this movie in the first place.I will wrap this up as I am going to try and forget the time I just wasted with this piece of crap. I will leave you with this warning. DO NOT WATCH THIS FILM ,IT SUCKS."}
{"label":0,"sentence":"I think i watched this movie, but don't quote me, as i may have fallen asleep during watching it as it didn't exactly \"grip my excitement and imagination.\" At least i know i watched enough of it to know i won't be watching it again soon. Or ever.<br \/><br \/>Jeez, talk about lame... Really lame. Totally lame. It wouldn't even appeal to a six year old. It basically had NO worthwhile dramatic impact. Zilch. Nada. Just shlock turned into dreck. Comedy? That was supposed to be comedy? Ya coulda fooled me-ee-ee...!<br \/><br \/>Now, if the aliens had been insatiably carnivorous like in the movie \"Critters\", we could have had the human characters do something a little more profound than be overly smugly cutesy... like yelling and screaming and running for their lives so they wouldn't be eaten so the story could be something more exciting than watching paint dry.<br \/><br \/>Don't bother watching this. It's not worth the effort. You can find something more interesting to do. Like watching paint dry. Or falling asleep."}
{"label":0,"sentence":"The movie had a good concept, but the execution just didn't live up to it.<br \/><br \/>What is this concept? Well, story-wise, it's \"Dirty Harry\" meets \"M\". A child killer has begun terrorizing a city. The lead detectives (Dennis Hopper and Frederic Forest) have never dealt with a serial killer before. The Mayor and the Police Chief, in desperation, secretly hire the local mob to speed things up...to go places and do things that the police wouldn't be able to in order to bring an end to this mess as soon as possible.<br \/><br \/>To be fair, this film DOES genuinely have some good things to offer.<br \/><br \/>Besides the concept, I liked the look of the killer's hideout. Norman Bates has his basement. This guy has an eerie sewer. In some of the shots, the light bounces off the water and creates rippling reflections on the walls; often giving these scenes a creepy, dreamlike quality.<br \/><br \/>The acting was good too. Dennis Hopper is one of those actors who gets better with age.<br \/><br \/>Once you get past that, however, it more-or-less goes downhill.<br \/><br \/>The film is paced way too fast. The actual investigation process from both teams feels very rushed as opposed to feeling intricate and fascinating. This could have been fixed in two ways: either make the film longer or cut out some of the many subplots. Either of these would have allowed the crew to devote more time to the actual mystery.<br \/><br \/>For an example of how bad this is, one of the crucial clues that helps them zero in on just the right suspect is this: at one point in his life, the suspect went to a pet shop...That's right...I'm being totally serious here. It's like they went from point A (the first clue) to point Z (the suspect) and skipped over all the \"in-between\" steps.<br \/><br \/>Then there's the characters. The only ones I actually liked were two pick-pockets you meet about half-way through the movie. Considering that they're minor characters, I'd call that a bad sign.<br \/><br \/>Finally, there's the mob angle. This is the one that gets me the most because THIS is why I coughed up the $3 to buy the DVD in the first place. I mean, what a hook! There's been an absolute glut of serial killer flicks in the last 10-15 years. The mob angle was a gimmick that COULD have helped it rise above the rest..., but it didn't.<br \/><br \/>I figured the gangsters's methods would be brutal, but fun and thrilling at the same time; kind of like a vigilante movie or something...maybe they'd even throw in some heist movie elements too. We ARE talking about criminals, after all. Instead, we're given some of the most repulsive protagonists committed to celluloid. The detectives question witnesses. What does the mob do? They interrogate and kill them. It's not even like these witnesses are really even that bad either. I actually found the criminals less likable than the killer they're hunting.<br \/><br \/>Unless the good points I mentioned are enough to get your interest, I'd say give this one a miss. Maybe some day, they'll reuse the same story idea and do it RIGHT. I hope so. I hate to see such a good concept go to waste."}
{"label":0,"sentence":"What do you expect when there is no script to begin with, and therefore nothing that the director can work with. Hayek and Farrell, and Donaldson and Kirkin are good actors, they just don't have anything to say or anything to react to. Even the earthquake was pretty poor. And I don't know how closely the movie follows the novel, but two have the Jewish girl show up out of nowhere just so show that Arturo has a nice, warm heart, but some stereotypes don't amount to anything. And he even buries Camilla out in the desert, instead of bringing her back to L.A. for a nice Catholic burial where he could at least bring her flowers once in a while. Pathetic. And the L.A. set was ridiculously graphically created. Anything good? The window to his apartment felt real, the curtains, the sounds, the wind. And Donaldson is always great. Has been since the Body Snatchers or Night of the Living Dead, whichever it was."}
{"label":0,"sentence":"I saw the original \"Chorus Line\" on Broadway God knows how many times and felt the passion, despair and joy come from this live experience in the theater. Michael Bennett knew he would have to re-imagine \"Chorus\" for the screen but could never figure out how to do it. If the man who came up with the show is stumped - that should answer your question. There are some shows that are simply made to be seen live - with an audience. However, Richard Attenborough fresh of the musical work of \"Ghandi\" and dancing with animals in \"Doctor Doolittle\" ended up directing this film which bore little to no resemblance to the stage show. Horrible songs were added (Surprise! Surprise!), great songs were dropped or given to other characters (which didn't make sense). Michael Douglas was mis-cast. People that couldn't dance tried to act and there was the sexy \"Landers\" woman who couldn't sing, act, or dance - I guess she had just finished being Ghandi's wife. The dances by Jeffrey Hornaday look like nothing more than schlock from \"Flashdance\" rejects and nothing works. I sat there stunned at how something so riveting and emotional could be drained to nothing. If you truly love this show and it is coming back to Broadway in 2006 - see it but don't think that the long running musical event that was \"A Chorus Line\" has any thing at all to do with this film."}
{"label":0,"sentence":"I saw this film at SXSW with the director in attendance. Quite a few people walked out, and the audience could barely muster even polite applause at the end. Of the 60 or 70 films I've seen at this festival, Frownland is among the worst.<br \/><br \/>At 106 minutes, it is at least 95 minutes too long. You get to watch the main character's failed and drawn out attempts to communicate, in extended real time. The same grimaces, hand over mouth motions, kinetic and frantically repeated words and syllables over and over and over again - WE GET THE POINT.<br \/><br \/>One site actually compares this work to early Mike Leigh. What drugs would you have to be on to make that statement? Given that Frownland is a Captain Beefheart song, maybe you'd have to be able to enjoy Trout Mask Replica on heavy rotation to appreciate this film. Unbelievably, this won a jury award at the festival. You can bet it did not win an audience award."}
{"label":0,"sentence":"A scientist (John Carradine--sadly) finds out how to bring the dead back to life. However they come back with faces of marble. Eventually this all leads to disaster.<br \/><br \/>Boring, totally predictable 1940s outing. This scared me silly when I was a kid but just bores me now. I had to struggle to stay awake! With one exception, the acting is horrible. Such expressionless boring actors! Hopeless.<br \/><br \/>There are some good things about this: Carradine, despite the script, actually gives a very good performance. And there are a few mildly creepy moments involving a ghost of a Great Dane walking through walls. There's also one of the worst-looking knockouts in cinema history. Still, none of this is fun enough to sit through this. Avoid."}
{"label":0,"sentence":"For a science scare movie to work well it has to be either truly original or a very good retelling. This movie is neither. Sure there is a pseudo-original twist in that the guy kills people because of a toxin and not because of a disease, but that is a very minor twist. There is the government conspiracy angle, the crusader protagonist who has personal experience...<br \/><br \/>And one real drawback of this movie is that the contaminated man has no pathos. Although the character is scripted to be someone who should be pitied, he is not. Without the pity the movie is pointless. The other characters are so cookie cutter they are ridiculous. The subplots are convoluted and annoying. And the saddest thing is the movie is too flat to even be enjoyed as mock material. Make the movie a 45 minute short and it might be worth watching."}
{"label":0,"sentence":"Movie about a small town with equal numbers of Mormons and Baptists. New family moves in, cue the overwritten dialog, mediocre acting, green jello salad with shredded carrots, and every other 'inside Mormon joke' known to man. Anyone outside the Mormon culture will have a hard time stomaching this movie. Anyone inside the Mormon culture will be slightly amused with a chuckle here and there. You'll be much better off watching Hess's other movies (Napoleon Dynamite, etc..) than trying to sit through this one. The acting is mediocre. Jared Hess has had his hands on much more quality films like \"Saints and Soldiers\", and \"Napoleon Dynamite\". I would recommend both movies over this groaner."}
{"label":1,"sentence":"I was totally impressed by Shelley Adrienne's \"Waitress\" (2007). This movie only confirms what was clear from that movie. Adrienne was a marvelously talented writer-director, an original and unique artist. She managed to show the miseries of everyday life with absurd humor and a real warm optimistic and humanistic tendency. Ally Sheedy steals this movie with a terrific performance as a woman who has fallen over the edge. Male lead Reg Rodgers, looking like Judd Nelson, is fine. There is also a great cameo by Ben Vereen. The song at the end of the movie \"The Bastard Song\" written by Adrienne can stand as her optimistic eulogy: <br \/><br \/>\"It's a world of suffering,<br \/><br \/>In a sea of pain,<br \/><br \/>No matter how much sun you bring,<br \/><br \/>You're pummeled by the rain...<br \/><br \/>Don't let the heartless get you down,<br \/><br \/>Don't greet the heartless at your door,<br \/><br \/>Don't live among the heartless\""}
{"label":1,"sentence":"Bromwell High is nothing short of brilliant. Expertly scripted and perfectly delivered, this searing parody of a students and teachers at a South London Public School leaves you literally rolling with laughter. It's vulgar, provocative, witty and sharp. The characters are a superbly caricatured cross section of British society (or to be more accurate, of any society). Following the escapades of Keisha, Latrina and Natella, our three \"protagonists\" for want of a better term, the show doesn't shy away from parodying every imaginable subject. Political correctness flies out the window in every episode. If you enjoy shows that aren't afraid to poke fun of every taboo subject imaginable, then Bromwell High will not disappoint!"}
{"label":1,"sentence":"I actually like the original, and this film has its ups and downs. Here's just a few:<br \/><br \/>Ups: Most of the original voice cast returned.<br \/><br \/>Downs: I didn't like the voice of Timon's Ma. I know she did a voice in The Simpsons, but that show is just plain stupid. <br \/><br \/>Ups: We get to see Simba as a \"teenager.\"<br \/><br \/>Downs: They wasted it with a slug-slurping contest between Timon and Simba. <br \/><br \/>Ups: It was Rafiki who told Timon about \"Hakuna Matata.\"<br \/><br \/>Downs: How did Pumbaa find out about it?<br \/><br \/>Ups: Songs again. (some of the original songs were there, but they were just background music.)<br \/><br \/>Downs: But stupid songs. (a.k.a. Timon's solo.)<br \/><br \/>Overall, this is a pretty good movie. I'd recommend it for fans of the original. But if you don't like the original, chances are you won't like this one.<br \/><br \/>My Score: 7\/10"}
{"label":1,"sentence":"Most people know Paul Verhoeven as the director of many good (and bad) sci-fi movies in Hollywood. But long before that he was churning out generic thrillers in his native land. The story is a basic femme fatale premise, nothing new or enthralling. Verhoeven thinks he can make it better by adding in a series of dream sequences, which instead of defining our main character and his situation, are just used as a way to drive forward the predictable plot. The screenplay was solid, the dialogue helping to pad the effects of the bland story. What really made the movie at at least good was some terrific acting. Jereone Krabbe was amazing as the \"tortured artist\", and the supporters were very good as well. Also, Jan De Bont's cinematography adds at least some life to the film, helping to make Verhoeven look at least capable as a director.<br \/><br \/>6.5\/10<br \/><br \/>* * 1\/2 \/ * * * *"}
{"label":1,"sentence":"Time and time again, I've stated that if people don't want remakes or sequels made, they should stop seeing them and instead venture into the world of independent film. Having said that though, the last time I saw an independent film myself must have been easily six months ago. So here's a review for an indie that I had my attention drawn to on Youtube; the Cure.<br \/><br \/>Right away, you can tell that the film is going for an avant-garde film approach which is telegraphed in its use of extreme close ups, scopophilia and fast editing. It is proud of the way it looks - and it has a right to be. For the most part it is a very nicely composed little piece, save for one inexcusable disregard for the 180 degree rule and a comically bad gunshot effect which is a phenomenon that seems to be THE calling card for self funded projects.<br \/><br \/>Still, despite these amateurish mistakes the majority of the shots are actually a pleasure to look at. We're presented with a good use of props and locations, good visual acting and some very atmospheric, fluid editing, which is made more commendable as this is definitely something you won't see very often at all from a Youtube submission. The plot is fragmented and although the basic premise is fairly simple some may find it hard to follow exactly what is happening, but what we are seeing here is avant-garde storytelling at work; you can't really expect a straightforward three act structure and if you do you might not be ready for this kind of movie.<br \/><br \/>Where the film is unfortunately let down however is the sound. What you're going to hear throughout is a distorted voice-over which often sounds insincere and worse still is the continuous background music, which goes through minimal change and doesn't add much to anything. So much attention is paid to the visuals that the audio frankly sounds neglected, and this becomes really apparent when you realize you've just missed about four sentences of the narration and have to backtrack to pick up what slipped past your attention.<br \/><br \/>So, give it a watch, but do it with the sound turned off.<br \/><br \/>Last thought; was anyone else reminded of the cover for Doug Naylor's Red Dwarf novel \"Last Human\" early in the film? If you have the book you know what I mean."}
{"label":1,"sentence":"I first saw this movie when it originally came out. I was about 9 yrs. old and found this movie both highly entertaining and very frightening and unlike any other movie I had seen up until that time.<br \/><br \/>BASIC PLOT: An expedition is sent out from Earth to the fourth planet of Altair, a great mainsequence star in constellation Aquilae to find out what happened to a colony of settlers which landed twenty years before and had not been heard from since.<br \/><br \/>THEME: An inferior civilization (namely ours) comes into contact with the remains of a greatly advanced alien civilization, the Krell-200,000 years removed. The \"seed\" of destruction from one civilization is being passed on to another, unknowingly at first. The theme of this movie is very much Good vs. Evil.<br \/><br \/>I first saw this movie with my brother when it came out originally. I was just a boy and the tiger scenes really did scare me as did the battle scenes with the unseen Creature-force. I was also amazed at just how real things looked in the movie.<br \/><br \/>What really captures my attention as an adult though is the truth of the movie \"forbidden knowledge\" and how relevant this will be when we do (if ever) come into contact with an advanced (alien) civilization far more developed than we ourselves are presently. Advanced technology and responsibility seem go hand in hand. We must do the work for ourselves to acquire the knowledge along with the wisdom of how to use advanced technology. This is, in my opinion, the great moral of the movie.<br \/><br \/>I learned in graduate school that \"knowledge is power\" is at best, in fact, not correct! Knowledge is \"potential\" power depending upon how it is applied (... if it is applied at all.) [It's not what you know, but how you use what you know!]<br \/><br \/>The overall impact of this movie may well be realized sometime in Mankind's own future. That is knowledge in and of itself is not enough, we must, MUST have the wisdom that knowledge depends on to truly control our own destiny OR we will end up like the Krell in the movie-just winked-out.<br \/><br \/>Many thanks to those who responded to earlier versions of this article with comments and corrections, they are all very much appreciated!! I hope you are as entertained by this story as much as I have been over the past 40+ years ....<br \/><br \/>Rating: 10 out 10 stars"}
{"label":1,"sentence":"In my humble opinion, this movie did not receive the recognition it deserved. Robert Redford lives near me here in Provo, Utah, at Sundance. I enjoy most of his work, and this was my favorite. I'm sorry that more people didn't appreciate it. My grandmother was an avid reader and read the book years before it came out on the big screen. She gave it to me to read after we had seen the movie together. The movie and book hit an emotional spot within my heart, and I was weepy for several days after seeing the movie. Sometimes love isn't enough to keep our loved ones from hurting themselves. We see this in our own family relationships, yet our love and our families and their stories endure throughout generations of time. The cinematography was perfect and breathtaking -- I was awed by its beauty and how well it brought to life the words of the author of the book, Norman Maclean, \"But when I am alone in the half light of the canyon, all existence seems to fade to a being with my soul, and memories. And the sounds of the Big Black Foot River, and a four count rhythm, and the hope that a fish will rise. Eventually, all things merge into one, and a river runs through it. The river was cut by the world's great flood and runs over rocks from the basement of time. On some of the rocks are timeless raindrops. Under the rocks are the words, and some of the words are theirs. I am haunted by waters.\" These words, taken from the book and spoken at the end of the movie (by Robert Redford who is narrating as Norman Maclean), are basically scripture, in my opinion. Any possible flaws the movie may have are overshadowed by the beauty and grace of the story and the cinematography. It was beautiful!"}
{"label":1,"sentence":"As a Pagan, I must say this movie has little if any Magickal significance. It's a \"fun\" witchcraft movie and not meant to teach us anything except that love is the strongest Magick of all, and never to use it in a controlling or vengeful way. That's a lesson everyone needs to learn, not just Pagans.<br \/><br \/>That having been said, this movie is wonderfully written and sweetly executed by Kim Novak and the venerable Jimmy Stewart.<br \/><br \/>Hermione Gingold delivers a stellar performance as Bianca, Elsa Lanchester (with too many movie credits to mention except as Ms. Jane Marbles of \"Murder By Death\") was wonderful as Ms. Novak's absent-minded-yet-capable upstairs neighbor Queenie. Also starring Jack Lemmon (wonderful performance) and Jim Kovacs (brilliantly witty).<br \/><br \/>\"Witches can't cry. Why, they can't shed a single tear because their heart is full of Magick. They don't have time for silly things such as love.\" Queenie.<br \/><br \/>Gillian Holroyd (Novak) and her brother Nicky (Jack Lemmon) are Manhattan witches. Cloaked deeply within the secret underworld of those of the Craft, they live among other New Yorkers as one of them, without so much as causing a raised eyebrow. <br \/><br \/>But then, along comes Shepherd \"Shep\" Henderson (Stewart), a steadfast, no-nonsense, dedicated businessman who is engaged to be married to Gillian's old college rival. <br \/><br \/>By a quirky mishap of chance, he finds himself moving into Gillian's building and is instantly \"bewitched\" by her charm and grace. By the use of Magick, with a little help from Pyewacket (Gillian's familiar, trained by Robert E. Blair) and Queenie, Gillian begins to work on this handsome new dream man to get back at her old enemy.<br \/><br \/>But Magick should never be used to control, nor to hurt, and Gillian learns that the hard way in the most bittersweet way. Not only does she have to face what she's done, but she has to face Shep in her guilt. <br \/><br \/>From the critical perspective; however, the movie takes a serious turn: The effects are very dated to the point of being pure camp. Some of the scenery was seemingly shot in the basement of someone's small home, but at least the characters were quirky and fun.<br \/><br \/>On a personal note, Pyewacket steals the show. Great cat! Great training by Robert E. Blair. <br \/><br \/>As a Note of Trivia, this is the roots for the beloved Bewitched television sitcom. This introduces the original Samantha and Darrin. All the characters of note are present and accounted for. You have but to look, to see it for yourself.<br \/><br \/>This is one of my favorites, and I watch it often.<br \/><br \/>This movie gets a 9.1\/10 from...<br \/><br \/>the Fiend :."}
{"label":1,"sentence":"This film would usually classify as the worst movie production ever. Ever. But in my opinion it is possibly the funniest. The horrifying direction and screenplay makes this film priceless. I bought the movie whilst sifting through the bargain DVD's at my local pound shop. Me and some friends then watched it, admittedly whilst rather drunk. It soon occurred that this wasn't any normal film. Instead a priceless relic of what will probably be James Cahill's last film. At first we were confused and were screaming for the DVD player to be turned off but thankfully in our abnormal state no-one could be bothered. Instead we watched the film right through. At the end we soon realised we had found any wasters dream, something that you can acceptably laugh at for hours, whilst laughing for all the wrong reasons. We soon showed all our other friends and they too agreed, this wasn't a work of abysmal film. This was a film that you can truly wet yourself laughing at. This was a film that anyone can enjoy. This was genius."}
{"label":1,"sentence":"Big splashy film of the Broadway music. Nathan (Frank Sinatra) loves to roll the dice and organize illegal crap games. Blonde loving Adelaide (Vivian Blaine) wants to marry him IF he gives up craps. He decides on one last game when Sky Masterson (Marlon Brando!), who bets big, is in town. He bets Sky that he can't get mission worker Sarah Brown (Jean Simmons) to go with him to Havana. That may sound like a strange plot summary but so is the movie!<br \/><br \/>This is a real mixed bag--there's some wonderful stuff here. The songs are all good and the dancing is incredible. The real show stopper is at the crap game at the end. Also Brando is really quite good here--it might seem strange to think of him singing and dancing but he pulls it off. I have to admit seeing big, bulky Brando pulling off some difficult dance moves was a lot of fun! Also Sinatra is pretty good and Blaine is just wonderful as his long-suffering girlfriend. Her song and dance numbers are definite highlights here.<br \/><br \/>Now for the bad parts--Jean Simmons is a wonderful actress but she's stuck with a drab colorless role and can't do much with it. The movie is far too long at 150 minutes--the scenes between Brando and Simmons really drag and should have been shortened. Also most of the characters speak in very precise English--contractions are never used. Maybe it's trying to be amusing coming out of the mouths of gangsters but I found it jarring and it kept throwing me out of the movie.<br \/><br \/>It's worth catching for the songs and dances but the over length of it does get to you after a while. I give it a 7."}
{"label":1,"sentence":"Wealthy psychiatrist Lindsay Crouse has just published her first novel and is feeling down about her profession feeling that it's hopeless to help her patients. A young gambling junkie client asks her to help him pay off his debts if he truly wants to help him get better. Here she gets involved with Joe Mantegna. To reveal any more of the plot would spoil one hell of a fun movie and 'House of Games' may very well be the best con movie I've seen. David Mamet wrote and directed this gem that's full of snappy dialogue, great one-liners, and enough twists to keep you guessing til the end. Crouse is perfect as the uptight psychiatrist needing a change and Mantegna tops her as the devilishly sly con-man. And with the exception of a coincidence in the last quarter of the movie, the film is in utter control of it's audience; and we are loving the con.<br \/><br \/>*** out of ****"}
{"label":1,"sentence":"I've seen this film criticized with the statement, \"If you can get past the moralizing...\" That misses the point. Moralizing is in the conscience of the beholder, as it were. This is a decent film with a standard murder mystery, but with a distinct twist that surfaces midway through. The resolution leaves the viewer wondering, \"What would I have done in this position?\" And I have to believe that's exactly what the filmmaker intended. To that end, and to the end of entertaining the audience, the film succeeds. I also like the way that the violence is never on stage, but just off camera. We know what has just happened; it's just not served up in front of us, then rubbed in our faces, as it would be today with contemporary blood and gore dressing. Besides, the violence is not the point. The point is the protagonist's moral dilemma, which is cleverly, albeit disturbingly, resolved."}
{"label":1,"sentence":"A trio of buddies, sergeants all in the British Army, carouse & brawl their way across Imperial India. Intensely loyal to each other, they meet their greatest & most deadly challenge when they encounter the resurgence of a hideous cult & its demented, implacable guru. Now they must rely on the lowliest servant of the regiment, the water carrier GUNGA DIN, to save scores of the Queen's soldiers from certain massacre.<br \/><br \/>Based more on The Three Musketeers than Kipling's classic poem, this is a wonderful adventure epic - a worthy entry in Hollywood's Golden Year of 1939. Filled with suspense & humor, while keeping the romantic interludes to the barest minimum, it grips the interest of the viewer and holds it right up to the (sentimental) conclusion.<br \/><br \/>It is practically fruitless to discuss the performance nuances of the three stars, Cary Grant, Victor McLaglen & Douglas Fairbanks Jr., as they are really all thirds of a single organism - inseparable and, to all intents & purposes, indistinguishable. However, this diminishes nothing of the great fun in simply watching them have a glorious time.<br \/><br \/>(It's interesting to note, parenthetically, that McLaglen boasted of a distinguished World War One military career; Fairbanks would have a sterling record in World War Two - mostly in clandestine affairs & earning himself no fewer than 4 honorary knighthoods after the conflict; while Grant reportedly worked undercover for British Intelligence, keeping an eye on Hollywood Nazi sympathizers.)<br \/><br \/>The real acting laurels here should go to Sam Jaffe, heartbreaking in the title role. He infuses the humble man with radiant dignity & enormous courage, making the last line of Kipling's poem ring true. He is unforgettable.<br \/><br \/>Montague Love is properly stalwart as the regimental major, whilst Eduardo Ciannelli is Evil Incarnate as the Thuggee guru. The rest of the cast, Joan Fontaine, Robert Coote, Lumsden Hare, are effective but have little to do. Movie mavens will recognize Cecil Kellaway in the tiny role of Miss Fontaine's father.<br \/><br \/>The film picks its villains well. The demonic Thuggee cult, worshipers of the hideous, blood-soaked Kali, Hindu goddess of destruction, was the bane of Indian life for 6 centuries, ritualistically strangling up to 30,000 victims a year. In 1840 the British military, in cooperation with a number of princely states, succeeded in ultimately suppressing the religion. Henceforth it would remain the stuff of novels & nightmares."}
{"label":1,"sentence":"I actually didn't start watching the show until it came on FX. I was bored and had nothing to watch and saw that the show's reruns were premiering so i decided to watch it. I was so upset that I had not watched the show when it first aired on t.v. I loved the show so much!Finally a show for everyone to enjoy. I remember Full House and Family Matters and Step by Step and they were okay shows but just not funny enough. They would make dumb jokes and laugh over things that were just plain stupid, but not That 70s Show. That 70s Show was hilarious, smart and so real. I think it was the best show ever made and I'm very sorry that it ended. Although I love this show, I do think it should have ended on the seventh season when Eric and Kelso leave. The last season was just not right, Eric was the main character and the show should have ended when his character leaves. I still love this show and I hope TV starts making more shows like this one."}
{"label":1,"sentence":"I went into this expecting not to like it; I figured it would be terribly worthy and earnest, and rather plodding and dull.<br \/><br \/>It's actually far better than that, and I found myself really enjoying it. I don't know too much about Queen Victoria beyond what most know - married to Albert, who died young, and she mourned him ever after. Seeing the circumstances she grew up under was fascinating; in fact I found myself wishing I'd seen more of the story, and I imagine we may see a sequel at some point.<br \/><br \/>Visually the film is stunning. The sets and costumes are incredibly lavish without being too gaudy and over the top. The acting is top notch from everybody involved.<br \/><br \/>In a word, it was great!"}
{"label":1,"sentence":"'The Italian' is among the great or near-great films of 1915 that are available today. The year was a turning point for the feature-length film, especially in America: Lois Weber's 'Hypocrites', Cecil B. DeMille's 'The Cheat' and, of course, D.W. Griffith's 'The Birth of a Nation' set new benchmarks for the art. Additionally, that year, Russian filmmaker Yevgeni Bauer made two of his best pictures, 'After Death' and 'Daydreams'. The French serial 'Les Vampires' also has its admirers today, although I disagree with them. The emergence of the feature-length film was led by Europe, mainly Denmark, France and Italy, but dominance of this market and, to a degree, the art shifted to across the Atlantic in 1915.<br \/><br \/>The most overriding artistic achievement of 'The Italian' is its stunning and often innovative cinematography. There are some picturesque sunsets, mobile framing, including a brief overhead angled shot of the Italian racing to buy a wedding ring and another shot of him holding onto a moving car, and, in general, there is wise use of varied camera angles and expert lighting throughout. An especially amazing shot is a close-up of the Italian enraged as he slowly approaches the camera for an extreme close-up, in reference to D.W. Griffith's 'Musketeers of Pig Alley' (1912). He's so enraged his environment even begins to shake around his anger.<br \/><br \/>Unfortunately, the cinematographer appears to be unknown. The director, although originally without credit in the film, is now known to have been Reginald Barker. Five or so of his other films made for Ince are also available today, but are rather unremarkable. 'Civilization' (1916), which he worked on, was a large production, but a deeply flawed movie. By the way, I'd guess that one or more of the various cinematographers who worked on 'Civilization' also photographed 'The Italian'.<br \/><br \/>Moreover, the entire production is very advanced for then. Venice and New York are well rendered despite the film being shot in Los Angeles (for romanticized Venice) and San Francisco (for the ethnic slums of New York). There are extensive flashbacks, although perhaps one or two too many. I especially like the clever framing of the narrative as being read in a book by a character played by the same actor, George Beban, who is also the lead in the inner, main narrative. The reading of the story is further briefly framed by the opening at the beginning and closing at the end of curtain drapes, à la the theatre, which is reflected within the inner story during the revenge climax in the child's room, with the opening and closing of window curtains. Parallel editing, in-camera dissolves and irises and such are handled expertly. Additionally, Beban and Clara Williams, as his wife, play their parts well.<br \/><br \/>On the other hand, 'The Italian' does have a few drawbacks. The film's early moments of comedy clash rather disharmoniously with the latter parts of harsh and heavy melodrama, although the environmental changes from romanticized Italy to naturalistic New York works well\u0097mostly because it's supported by the lighting and photography. The harsh dissolution of the American dream in this film, enhanced by the stark photography, must have been poignant to the immigrant classes who comprised a disproportionately large population of the movie-going public back then. The Corrigan character should have been foreshadowed more; his brief introduction campaigning for another politician seems inadequate for his later centrality to the Italian's revenge. In addition, the filmmakers were either medically naïf or careless to not explain the lack of breastfeeding of the infant and the unwarranted faith in the healing powers of quietness for the other child. Aside from the deficiencies in plot, 'The Italian' is exceptionally well made."}
{"label":1,"sentence":"I last read a Nancy Drew book about 20 years ago, so much of my memory of the fictional character is probably faulty. From what I gathered, the books were introduced to me at an era when teenage sleuths were popular to children growing up at the time (for my case, the 80s and early 90s), with Hardy Boys, Famous Five, and of course, \"Carolyn Keene\"'s Nancy Drew amongst the more famous ones. I still remember those hardcover books with very dated cover illustrations, usually quite heavy (for a kid) to lug around, and the thickness of the book perhaps attributed to the fact that the words are printed in large fonts.<br \/><br \/>Well, the character has been given some updates along the way, as I recall my sister's subsequent Nancy Drew books becoming less thick, of softcover, with updated and a more chic Nancy illustrated on the cover. I can't remember if those stories were the same as the old hardcover ones, but I guess these books, being ghostwritten, have their fair share of updating itself for the times.<br \/><br \/>In this Warner Brothers release of Nancy Drew, the character no doubt gets its update to suit the times, but somehow the writers Andrew Fleming and Tiffany Paulsen maintained her 50s- ish small town sensibilities, thereby retaining some charm and flavour that erm, folks like me, would appreciate. Her fashion sense, her prim and properness, even some quirky little behaviour traits that makes her, well, Nancy Drew.<br \/><br \/>Her family background remains more or less the same, living with her single parent father Carson Drew (Tate Donovan), who is moving his daughter and himself to the big city for a better job opportunity, and to wean his daughter off sleuthing in the town of River Heights. Mom is but a distant memory, and the housemaid makes a cameo. But what made Nancy Drew work, is the casting of Emma Roberts in the lead role. Niece of her famous aunt Julia, she too possess that sprightly demeanour, that unmistakable red hair and that megawatt smile. Her Nancy Drew, while in the beginning does seem to rub you the wrong way, actually will grow on you. And in almost what I thought could be a discarded scene from Pretty Woman, it had the characters walk into a classy shop with almost opposite reactions.<br \/><br \/>While Dad Carson Drew tries hard to bring Nancy out of her sleuthing environment and to assimilate into normal teenage life, trust Nancy to find themselves living in a house whose owner, a Hollywood type has been, was found murdered under suspicious circumstances. Mystery solving is her comfort food when she finds herself an outcast of the local fraternity, and not before long we're whisked off along with her on her big screen adventure.<br \/><br \/>There's nothing too Black Dahlia about the crime and mystery, and instead it's a pretty straightforward piece for Nancy to solve, in between befriending Corky (Josh Flitter) a chubby friend from school, and pacifying jealous boyfriend Ned (Max Thieriot), while hiding the truth of her extra curriculum activities from her dad. The story's laced with cheesy fun and an oldie sentimentality which charms, and together, it becomes somewhat scooby-doo like. With minimal violence and no big bag gunfights or explosions, this is seriously a genre which is labelled clearly with \"chick flick\" alert.<br \/><br \/>I guess the movie will generate a new generation of fans, rekindle the memories of old ones, and probably, just probably, might spark a new fashion trend of sporting penny loafers."}
{"label":1,"sentence":"A very good start. I was a bit surprised to find the machinery not quite so advanced: It should have been cruder, to match we saw in the original series. The cast is interesting, although the Vulkan lady comes across as a little too human. She needs to school on Spock who, after all, is the model for this race. Too bad they couldn't have picked Jeri Ryan. I like Ms. Park, the Korean(?)lady. The doctor has possibilities. Haven't sorted out the other males, except for the black guy. He's a really likeable. Bakula needs to find his niche--In QL his strong point was his sense of humor and his willingness to try anything. He is, of course, big and strong enough for the heroics. The heavies were OK, although I didn't like their make-up."}
{"label":1,"sentence":"At the beginning of the film we watch May and Toots preparing for their trip to London for a visit to their grown children. One can see Toots is not in the best of health, but he goes along. When he dies suddenly, May's world, begins to spin out of control.<br \/><br \/>The film directed by Roger Michell, based on a screen play by Hanif Kureshi, is a study of how this mother figure comes to terms with her new status in life and her awakening into a world that she doesn't even know it existed until now.<br \/><br \/>May's life as a suburban wife was probably boring. Obviously her sexual life was next to nothing. We get to know she's had a short extra marital affair, then nothing at all. When May loses her husband she can't go back home, so instead, she stays behind minding her grandson at her daughter's home. It is in this setting that May begins lusting after young and hunky Darren, her daughter's occasional lover.<br \/><br \/>Darren awakes in May a passion she has not ever known. May responds by transforming herself in front of our eyes. May, who at the beginning of the film is dowdy, suddenly starts dressing up, becoming an interesting and attractive woman. She ends up falling heads over heels with this young man that keeps her sated with a passion she never felt before.<br \/><br \/>Having known a couple of cases similar to this story, it came as no surprise to me to watch May's reaction. Her own chance of a normal relationship with Bruce, a widower, ends up frustratingly for May, who realizes how great her sex is with Darren. The younger man, we figure, is only into this affair to satisfy himself and for a possibility of extorting money from May. Finally, the daughter, Helen discovers what Mum has been doing behind her back when she discovers the erotic paintings her mother has made.<br \/><br \/>The film is a triumph for the director. In Anne Reid, Mr. Michell has found an extraordinary actress who brings so much to the role of May. Also amazing is Daniel Craig. He knows how Darren will react to the situation. Anna Wilson Jones as Helen is also vital to the story as she is the one that has to confront the mother about what has been going on behind her back. Oliver Ford Davies plays a small part as Bruce the older man in Helen's class and is quite effective.<br \/><br \/>The film is rewarding for those that will see it with an open mind.<br \/><br \/>"}
{"label":1,"sentence":"This film may have a questionable pedigree because it was made for TV, but it is one of the best movies I've seen. The film and its actors won several awards. It is gripping, fascinating, and it will absorb you completely. The story of a chase for a killer in iron-curtain Russia by people who are willing to risk their careers to try to save lives of future victims would be a compelling story if it were fiction -- but it's ostensibly a true story. I highly recommend it."}
{"label":1,"sentence":"This show was a landmark in American comedy as it was the first sitcom to star an all Afro-American cast. Sadly though it was never broad-casted on British TV.<br \/><br \/>The Evans family are a poor Afro-American family living in a tower block. The Dad is called James, he tries to run the house, but his wife Florida always gets the better of him. The three children are the artistic JJ, the moody Thelma and the young intellectual child Michael. Always coming into the house is Florida's gossipy friend Willona.<br \/><br \/>I watched two episodes of this show on youtube (Black Jesus and Sex and the Evans Family- the only two on the site). You may be thinking why has an English viewer watched a series that has never been shown or hardly heard of in his country. The answer is this. In 1976, Britains first all black sitcom came out called \"The Fosters\" Only two series were made and it now seems forgotten. But I watched an episode and was really impressed. Then I learnt that the scripts were identical to \"Good Times\". They were exactly the same characters but with different names- Sam Foster was the Dad, his wife was Pearl Foster and the three children were Sonny (a young Lenny Henry), Shirley and Benjamin. Pearl's gossipy friend was Vilma. (To read about The Fosters, I have wrote a review about that). Whilst watching \"Good Times\" only two things annoyed me. First off was the opening theme tune (awful) and secondly was the audience laughter. I like audience laughter, but in this somebody would say a slightly funny line and the audience would go mad and start clapping. Apart from that it was a very funny show. Let's hope more episodes turn up on youtube and lets hope that someone will release \"The Fosters\" on DVD in England.<br \/><br \/>Best Episode: Sex and the Evans family- Series 1 episode 6. The Foster's episode of it was called Sex in the Black Community. The other episode I saw, Black Jesus was a title of one episode of \"The Fosters\""}
{"label":1,"sentence":"I must say that I had wanted to see this film for a long time, and I was not disappointed. The acting of Dominic Monaghan is simply fantastic. As a part insomniac myself, I can relate with how the story develops. I have never experienced anything of the sort but some awake moments overlap the sleeping and it can be scary. It was a great film, worth every penny. I hope that one day I can work with Tess myself, it would be an honor and beyond. I can recommend it for everybody. Maybe not small children as they may get scared. But if you are an insomniac like me, you'll understand the world, the mysteries and the fear. You'll love it. <br \/><br \/>F."}
{"label":1,"sentence":"Actually I'm surprised there were so many comments about this movie. I saw it as part of a Slavic film festival at a major American University. But nobody in USA has heard of it, which is a real shame! The dynamics between the people are what makes it both funny and sad. They are stuck together on a long bus trip--someplace most of us have been!! But I never had one like this!! <br \/><br \/>My favorite scene is the one where they stop for the funeral. Then the man & woman sneak off for some Lovemaking in the forest but everybody follows them to watch without them knowing! Just as she raises her skirt and he enters her all the way--the consumptive starts hacking & they realize everybody is watching!! Talk about surprised! But...you really have to feel for them even if it is hilariously funny! When you see the ending it is sort of ironic that they enjoyed themselves while they did! Serb humor at it's best!"}
{"label":1,"sentence":"Having lived in Ontario my whole life, in the same town that Marlene Moore grew up in, I've heard stories of her from my parents, grandparents and family members. So when I found out that they would be filming a movie about her, and that the beginning would be shot on my street, and her house quite close to mine I was excited.<br \/><br \/>If you read the book Rock a Bye Baby, which is about Marlene Moore you get quite the different image of her as a person, she was considered awkwardly beautiful by people who really had the chance to know her with the exception of her own family who frequently abused her as a child, with the exception of one of her brothers. Also, if you live in my area and are intelligent enough to listen to those around you who knew her from school you'd find out that she was truly wounded before she even set foot in an institution, she was always defensive and what would seem like an unwillingness to learn in a school environment was actually embarrassment over the fact that she was unable to.<br \/><br \/>Marlene did not deserve the life she was given, with the lack of help she desperately needed to receive. It was the government and the people around her that aided further in her death by not attempting to understand her needs and why she did what she did. I still find myself angered that she was put in jail for self-defense from a man who tried to rape her. As her brother once said, \"They didn't know what to do with her so they locked her away and it killed her.\" I believe in that with all my heart.<br \/><br \/>Rest in peace Marlene, you deserve it so much."}
{"label":1,"sentence":"This film is like an allegory of the gospel. It has such direct honesty and innocence you can not possibly believe it was made after the world war when Italy was ravaged and devastated, and was filled with a huge homeless, impoverished population. It is a monument to the best qualities of the human spirit, as well as to the endless creative resources of that land of inspiration. <br \/><br \/>Toto is a character like Doestoevisky's \"Idiot\", a modern Christ finding his way in a big city. He is goodness and purity fortified by love, and his acts change the people he encounters, as much as the miracle working dove. The story is told in a natural manner and simple style, yet imbued with a magic that is almost a premonition of Fellini's surrealist fantasies. It is one of the most inspiring, uplifting movies ever made."}
{"label":1,"sentence":"This movie will go down down in history as one of the greats, right along side of Citizen Kane, Casablanca, and On The Waterfront. Someone please convince Leno to do a sequel! Leno and Morita are a comedy duo, the likes of which haven't been seen since Abbot and Costello. The evil that emanates from Chris Sarandon, Tom Noonan, and Randall \"Tex\" Cobb will give you the chills. Dingman's character as the buffoonish oaf hearkens back to the days of Shakespeare's comedies. And the climax. My goodness, the climax. I won't ruin it for you, but it makes the explosion of the Death Star pale in comparison. If you can track down this hard-to-find gem, do yourself and your family a favor and buy it immediately. I'm still holding out hope for a special edition DVD one of these days."}
{"label":1,"sentence":"I missed the entire season of the show and started watching it on ABC website during the summer of 2007. I am absolutely crazy about the show. I think the entire cast is excellent. It's one of my favorite show ever. I just checked the ABC program lineup for this Fall and did not see it on the schedule. That is really sad. I hope they will bring it back ... maybe they are waiting until Bridget Moynahan has her baby? Or is it only my wishful thinking? <br \/><br \/>I read some of the comments posted about the show and see so many glowing remarks, similar to mine. I certainly hope that ABC will reconsider its decision or hopefully another station will pick it up."}
{"label":1,"sentence":"This movie seems on the surface to be a run of mill kids movie that parents can regretfully watch with their mostly entertained little kids. The movie seems and is mostly geared towards children yet it does not stop on this level. I watched this movie first as a young child and found it to be funny, entertaining,and heartwarming and did not see it again for several years. I watched it again recently at age 18 and found it to be almost as funny but just as heartwarming and entertaining. This movie is highly underrated and contains many messages of real life. This movie is an inspirational quest story that is made for kids yet epic in its own right. I recommend this movie to anyone of any age."}
{"label":1,"sentence":"I was reviewing some old VHS tapes I have and came across The TV show John Denver & The Muppets A Christmas Together.This made me go to my computer and look it up to see if I could find a DVD version of this show to buy. I was disappointed not to be able to find it yet on DVD. The show aired in 1979 and was a delightful show. I have the record and the CD but I would love to buy a DVD version of this show. The tape is old and picture quality is pretty good but fading, the sound is not as good as the CD. There is also a few other songs not put on the CD. As a Fan of John Denver and of the Muppets, a DVD of this show would really be a good seller. If you don't have the CD it is a wonderful Chritmas collection of songs taken from that show. The album is also good if you can find it and still have a record player to play it on."}
{"label":1,"sentence":"Gene Kelly came up with some really grand ideas for musicals while with MGM. Here he's at the top of his creative powers working with the Arthur Freed musical unit. Hard to believe when you watch An American In Paris that the players never left the back lot at MGM. <br \/><br \/>The magic of An American In Paris is due to the creative editing under the direction of Vincent Minnelli and the sets that MGM designed blended with some background establishing shots. The idea of the film originated with Kelly who wanted simply to do a film with a lengthy ballet sequence involving George Gershwin's tone poem An American in Paris. It sounded good to Arthur Freed who approached Ira Gershwin who said fine with him as long as they used other Gershwin material.<br \/><br \/>Gershwin got the kind of deal for Gershwin music that Irving Berlin normally got. Not one note of non-Gershwin music is heard in An American in Paris. Listen to some of the background music and you will hear things like Embraceable You and But Not For Me which are not real musical numbers.<br \/><br \/>Another guy who was a fair hand at writing lyrics, Alan Jay Lerner, wrote the story which admittedly is a thin one. All about an ex-GI played by Gene Kelly who after World War II never left France, just settled into an apartment on the Left Bank and proceeded to become a starving artist. He lives with eccentric composer Oscar Levant and does that ever sound like a redundancy. <br \/><br \/>Two women are interested in him. Another expatriate American played by Nina Foch who wants to sponsor him as a painter if he'll reciprocate in other matters. But Kelly falls for a shop girl played by Leslie Caron in her film debut. Caron also has musical comedy star Georges Guetary interested in here.<br \/><br \/>Of course the plot is just an excuse to sing and dance to the music of George Gershwin. An American in Paris happens to be the first film I ever saw as an in flight movie on the first airplane trip I ever took. I still remember flying back from Phoenix Arizona to Kennedy Airport seeing Gene Kelly doing I've Got Rhythm. My favorite number in the film however is Tra-La-La which Kelly sings and dances all over the apartment with Oscar Levant playing the piano. At one point Kelly dances on top of the baby grand piano.<br \/><br \/>In a book about Arthur Freed, I read a quote where he said in the American in Paris ballet sequence was to be done with the background of the French impressionists which he felt the public would take to rather than a realistic setting on the streets or back lot. So it happened that way. Kelly had done lengthy ballet sequences in Words and Music, The Pirate, and On the Town. But this one topped them all. Still does in my opinion and that includes some of Gene Kelly's later films.<br \/><br \/>In a surprise upset at the Oscars, An American In Paris was chosen best picture for 1951, beating out the heavily favored A Streetcar Named Desire. I guess fantasy trumped realism that year. Big budgets also have an upper hand in these things as well.<br \/><br \/>Still An American in Paris is one of the best movie musicals ever done and since the studios no longer have all that creative talent under one roof, something less likely to be repeated."}
{"label":1,"sentence":"Old movie buffs will know why I'd call this one \"The Man in the Grey Flannel Robe.\" Most Bible-based movies are basically schlock- what might call forth smiles and giggles here is how Peck, tries to raise consciousness on a variety of psychological and social issues with the spear carrying Neanderthals all about him. As a Great Romance, it falls flat as unleavened bread. But there is something gripping about this movie. Of all the big Hollywood Bible pictures it most strikingly conveys the ambivalent attitude of the Average American towards belief in the Biblical God. Billy Sunday's thesis is duking it out with H.L. Mencken's antithesis all through the script. Who gets the better of it in the Heavenly Chorus-backed synthesis depends on your point of view. Other than that, D & B boasts a good performances by Peck ( especially in the closing repentance scene) and by Jayne Meadows as his bitter first wife Michol, vivid, moody atmosphere (good idea to set most action at dawn or night), and the rousing rendition of the Twenty-Third Psalm at the end."}
{"label":1,"sentence":"An American in Paris is a showcase of Gene Kelly. Watch as Gene sings, acts and dances his way through Paris in any number of situations. Some purely majestic, others pure corn. One can imagine just what Kelly was made of as he made this film only a year before \"Singin' In The Rain\". He is definately one of the all time greats. It is interesting to look at the parallels between the two films, especially in Kelly's characters, the only main difference being that one is based in Paris, the other in L.A.<br \/><br \/>Some have said that Leslie Caron's acting was less than pure. Perhaps Cyd Charisse, who was originally intended for the role could have done better, however Caron is quite believable in the role and has chemistry with Kelly. Oscar Levant's short role in this film gave it just what it needed, someone who doesn't look like Gene Kelly. Filling the role as the everyman isn't an easy task, yet Levant did it with as much class as any other lead.<br \/><br \/>The song and dance routines are all perfection. Even the overlong ballet at the end of the film makes it a better film with it than without. Seeing that there really wasn't much screen time to make such a loving relationship believable, Minnelli used this sequence to make it seem as if you'd spent four hours with them. Ingenious!<br \/><br \/>I would have to rate this film up with Singin' since it is very similar in story and song. Singin' would barely get the nod because of Debbie Reynolds uplifting performance.<br \/><br \/>Full recommendation.<br \/><br \/>8\/10 stars."}
{"label":1,"sentence":"I went to this movie expecting an artsy scary film. What I got was scare after scare. It's a horror film at it's core. It's not dull like other horror films where a haunted house just has ghosts and gore. This film doesn't even show you the majority of the deaths it shows the fear of the characters. I think one of the best things about the concept where it's not just the house thats haunted its whoever goes into the house. They become haunted no matter where they are. Office buildings, police stations, hotel rooms... etc. After reading some of the external reviews I am really surprised that critics didn't like this film. I am going to see it again this week and am excited about it.<br \/><br \/>I gave this film 10 stars because it did what a horror film should. It scared the s**t out of me."}
{"label":1,"sentence":"There's something about every \"Hammer\" movie I see that really takes me into a new fantasy world. In the world of \"Hammer\" movies, anything can happen. \"Guardian of the Abyss\" is one of those types of movies. It adventures deep into the occult and hypnosis to bring a different type of horror fantasy. All in all, an unforgettable movie. 7.5\/10."}
{"label":1,"sentence":"\"Moonstruck\" is a lovely little film directed by superb story teller, Norman Jewison (In the Heat of the Night, Fiddler on the Roof, The Hurricane). The film is great on many levels. It shows a good slice of Italian culture, has a touching romance, and (best of all) is a hilarious comedy.<br \/><br \/>One thing I liked most about the film was the relative unconventional looks of the actors. Nicolas Cage looks positively odd for most of the film, and Cher... well, Cher always looks a little odd.<br \/><br \/>Overall, it's a fun film, and easy to recommend.<br \/><br \/>7.4 out of 10"}
{"label":1,"sentence":"Film can be a looking glass to see the world in a new light. Good Night and Good Luck, for instance, offered parallels to modern judgement-without-evidence and encroachments on freedom. It is easier to examine a moral problem when it is not too close to home: by putting it in a fictional or historic context removed from our immediate situation. With pornography, we consider ourselves 'enlightened' and our forefathers to be hidebound by quaint ideas - usually involving fire and brimstone, but the definition of what is obscene can easily fall prey to ignorance and unscientific interpretation instead of evidence. Bettie Page was a cult icon of an era which included not just McCarthyism but the banning of comics (such as Tales from the Crypt) on the basis that they would turn youths into half-mad juvenile delinquents. This film, developed from key questions raised in her life, poses dilemmas that are as relevant today as back in 1950.<br \/><br \/>Our film opens with two key scenes. In the first, we see well-dressed, respectable looking men in a seedy bookshop. One of them asks for pictures of women in kinky boots and being restrained - then turns out to be an undercover cop conducting a sting. The second scene shows Bettie Page, waiting to be called as a witness, looking quite demure, as if she had just come out of church.<br \/><br \/>The first 50mins are in black & white. Old fashioned film effects such as wipes and fades add to the sense that we are watching a film from bygone years, as do the mannerisms of the cast, skilfully recreated 1950s scenes, contemporaneous slang phrases and the terse dialogue associated with film-making of the period. Archive footage is frequently intercut - which will delight many and irritate others. In keeping with its theme, the movie is almost a collection of different types of photography-in-motion, and the older clips of fabulous beaches and landmarks juxtapose well against Bettie's classic poses hearken back to an age of 'health & nature' magazines . . . although I admit that if you are not captivated by the story you may find the effect a bit choppy.<br \/><br \/>Very soon, we go into flashback. Bettie escapes a Depression Years downtrodden life in Nashville, enlivened only with church singing and soul-saving, and goes alone to make her own way. After her initial success, her modelling work splits into two strands: the mainstream glamour work focussing on her over-the-rainbow smile, and the 'specialist interest' photos involving dressing up in high-heeled boots and light bondage gear. In an earlier audition (reminiscent of a scene with Naomi Watts' character in Mulholland Drive - who was also called Betty), she gives a performance that is full of emotion, contrasting with her normal animated, cheerful (but ultimately bland) day-to-day expression. Is part of her still unfulfilled? Bettie is frequently rejected in auditions once they realise she is the well-known pin-up girl. But we have never been asked to feel sorry for Bettie Page: her abusive childhood is quickly referenced and skipped over; when she is raped by four hometown lads, we see only the threat and then Bettie recovering and surviving, picking herself up in deserted woodland, and putting on the brave face of someone who refuses to lie down and die.<br \/><br \/>Although no nudity is involved, it's Bettie's special interest photos that eventually arouse trouble. When we go back to the court, the opinions of a clergyman on the corrupting influence of such photos are taken as evidence. A psychologist authoritatively says how the photos lead to 'suicide, murder and psychosis' in youngsters who are exposed to them (presumably not in that order). Eventually a star witness explains how his son's life came to an end as a result of such photos - 'being 'trussed up like that'. It is not made clear how being 'trussed up' causes death). The text accompanying a series of Bettie's photographs in a magazine tell how she was forced to endure 'terrible agonies' with the fetish restraints (the audience knows that she actually found them quite hilarious and that the wordings, like the photos themselves, were pure dramatisations). After a 12hr wait, Bettie is told her evidence - she is the one person who could state definitively that she was not photographed in agony - will 'not be required'. The 'horrors' of the photos have been proved.<br \/><br \/>If this all sounds like the dark ages which we have left, consider a recent (2003) incident in which an Ann Summers advert was banned. It said, \"for fashion and passion whip along to your local store,\" with a photograph of a woman's back. She's wearing a bra and thong and her hands are handcuffed behind her back. The lingerie and sex toys company, that targets female consumers (and also supports charities fighting domestic violence) said its adverts aimed, \"to give women sexual confidence and always showed women in control of their sexuality.\" One might conclude that the prejudice and ignorance of the Betty Page investigations still holds currency.<br \/><br \/>Bettie's religious views are integral to the story, just as the concept of sin is integral to Christianity and contributes to the 'forbidden' nature of sexual enjoyment frequently prevalent in the UK and US - as opposed to the more factual approach found in continental Europe. It could be argued the formulae of sin and redemption, and \"being saved\", are even reflected in mating patterns that perpetuate traditional male dominance. A policeman making a friendly (but sexually motivated) approach to Bettie outside the courtroom offers to 'save' her from loneliness. The knight-in-shining-armour might be chivalrous, but it also assumes a woman in need of rescue.<br \/><br \/>Love it or hate it, The Notorious Bettie Page is an unusual and extraordinary film, and a moral wake-up call for those that heed it. There is excellent ensemble acting, and Gretchen Mol, as Bettie, is remarkable as the whole film succeeds or falls on her powerful performance."}
{"label":1,"sentence":"Now i really liked this movie, it was so funny.Both Akshay Kumar and John Abraham are brilliant actors, i think after watching this film they should do lots more films together in the future.<br \/><br \/>Akshay Kumar gets himself into a bit of trouble by dating 3 women at the same time, but the way he handles in when one comes out of the door and then the other one was just so funny to watch, he acted really well int his film and i hope that he makes more great comedy's like this one in the future, John Abraham plays his best friend, he plays his role really well and he is so underrated i am glad that some of his amazing work has got noticed but he is a really Good actor. i just love John, Neha Dhupia has a small role in this film and plays it well.<br \/><br \/>The muse is really good i really recommend this movie to everyone."}
{"label":1,"sentence":"1928 is in many ways a \"lost year\" in motion pictures. Just as some of the finest films of the silent era were being made in every genre, sound was coming in and - while reaping great profits at the box office - was setting the art of film-making back about five years as the film industry struggled with the new technology.<br \/><br \/>\"Show People\" is one of the great silent era comedies. The film shows that William Haines had comic skills beyond his usual formula of the obnoxious overconfident guy who turns everyone against him, learns his lesson, and then redeems himself by winning the football game, the polo game, etc. This movie is also exhibit A for illustrating that Marion Davies was no Susan Alexander Kane. She had excellent comic instincts and timing. This film starts out as the Beverly Hillbillies-like adventure of Peggy Pepper (Marion Davies) and her father, General Marmaduke Oldfish Pepper, fresh from the old South. General Pepper has decided that he will let some lucky movie studio executive hire his daughter as an actress. While at the studio commissary, the Peppers run into Billy Boone (William Haines), a slapstick comedian. He gets Peggy an acting job. She's unhappy when she finds out it is slapstick, but she perseveres. Eventually she is discovered by a large studio and she and Billy part ways as she begins to take on dramatic roles. Soon the new-found fame goes to her head, and she is about to lose her public and gain a royal title when she decides to marry her new leading man, whom she doesn't really love, unless fate somehow intervenes.<br \/><br \/>One of the things MGM frequently does in its late silent-era films and in its early sound-era films is feature shots of how film-making was done at MGM circa 1930. This film is one of those, as we get Charlie Chaplin trying to get Peggy's autograph, an abundance of cameos of MGM players during that era including director King Vidor himself, and even a cameo of Marion Davies as Peggy seeing Marion Davies as Marion Davies arriving at work on the lot. Peggy grimaces and mentions that she doesn't care for her. Truly a delight from start to finish, this is a silent that is definitely worth your while. This is one of the films that I also recommend you use to introduce people to the art of silent cinema as it is very accessible."}
{"label":1,"sentence":"In 1958, Clarksberg was a famous speed trap town. Much revenue was generated by the Sheriff's Department catching speeders. The ones who tried to outrun the Sheriff? Well, that gave the Sheriff a chance to push them off the Clarksberg Curve with his Plymouth cruiser. For example, in the beginning of the movie, a couple of servicemen on leave trying to get back to base on time are pushed off to their deaths, if I recall correctly. Then one day, a stranger drove into town. Possibly the coolest hot rodder in the world. Michael McCord. Even his name is a car name, as in McCord gaskets. In possibly the ultimate hot rod. A black flamed '34 Ford coupe. The colors of death, evil and hellfire. He gets picked up for speeding by the Sheriff on purpose. He checks out the lay of the land. He is the brother of one of the Sheriff's victims. He knows how his brother died. The Clarksberg government is all in favor of the Sheriff. There's only one way to get justice served for the killing of his brother and to fix things so \"this ain't a-ever gonna happen again to anyone\": recreate the chase and settle the contest hot-rodder style to the death. He goes out to the Curve and practices. The Sheriff knows McCord knows. The race begins... This is a movie to be remembered by anyone who ever tried to master maneuvering on a certain stretch of road."}
{"label":1,"sentence":"Higher and Higher was one of Rodgers&Hart's lesser Broadway musicals it only had a run of 84 performances on Broadway in 1940. Yet it yielded one of their bigger hits It Never Entered My Mind.<br \/><br \/>Nevertheless except for one minor song, So Disgustingly Rich, the entire Broadway score was scrapped when RKO bought the film rights. Instead a whole new score by Jimmy McHugh and Harold Adamson was written, mostly to accommodate one Francis Albert Sinatra who was making his feature film debut.<br \/><br \/>Sinatra who had done some vocal cameos in previous films, takes a leaf from the page of his singing rival Bing Crosby. When Bing did his feature film debut in The Big Broadcast, he played Bing Crosby. Frank Sinatra took on the role of Frank Sinatra and I can't think of anyone who could have done a better job. <br \/><br \/>The Chairman of the Board is billed third here behind stars Jack Haley and Michele Morgan. He's the butler and she's the scullery maid to Leon Errol. In fact Errol is a millionaire who hasn't paid his help for seven months. Mainly because he's about to go belly up into chapter 11 or so he informs the staff.<br \/><br \/>Errol's a delightful old soul to work for and none of the staff want to lose a good thing. They pool their resources and get Michele Morgan to impersonate Errol's daughter who's over in Switzerland with her mother. The idea being to snag a rich bankroll in the hopes rescuing the family fortune. Only Michele starts looking at another.<br \/><br \/>It's a slight plot and certainly no worse than a whole lot of musicals, but RKO invested this film with a good cast of players. Barbara Hale and Elizabeth Risdon play another débutante and her mother who suspect something's not right, Victor Borge is a fortune seeking no account, Dooley Wilson, Paul Hartman, Grace Hartman, Marcy McGuire, Mel Torme and Mary Wickes, play others of the Errol household staff. Not a bad bunch at all.<br \/><br \/>Sinatra sang three good ballads all of them had some kind of commercial success, The Music Stopped, A Lovely Way to Spend an Evening, and I Couldn't Sleep a Wink Last Night. The last one was nominated for an Oscar for Best Song, but lost to Alice Faye's You'll Never Know.<br \/><br \/>1943 was the year of the Musician's Union Strike against the recording industry. To get their material out, Frank Sinatra recorded the songs from Higher and Higher with an acapella chorus for Columbia. Bing Crosby recorded songs from his film Dixie in the same manner for Decca. Both of them were denounced by the president of the union, James C. Petrillo as strikebreakers and both did not cross the picket line again. The strike wasn't settle completely until 1944 although Decca broke ranks earlier from the other record companies and settled earlier than Columbia, RCA Victor and the others.<br \/><br \/>The strike provided some anxious moments for Sinatra. He had just left the Tommy Dorsey Orchestra when the strike was called. It closed off a needed venue for his artistry when he wasn't sure whether leaving Dorsey would prove to be a right career move. <br \/><br \/>Fortunately Higher and Higher was received well a legend was launched."}
{"label":1,"sentence":"I was probably one of the few Australians not watching the tennis when this series aired. I have to say when William McInnes first appeared I though, that is one crappy actor! But as the series continued he toned down his performance and I totally loved him. He was such a rotten guy but he did make me laugh. I watched the show to see Hugo Speers (Heart and Bones, The Full Monty) and Tom Long (SeaChange, Two Hands). It was interesting to see Speers play a nice, quiet man and even more interesting to watch Tom Longs' rippling muscles! Sigh... Seriously, Long's performance was a total shock and really brilliant. He stole the show. Martin Sacks was good also in a small role, and the leading actress put in an entertaining performance. I'd recommend this programme if you enjoy stories with a twist and watching Tom Long walk around with no shirt on..."}
{"label":1,"sentence":"While there aren't any talking animals, big lavish song production numbers, or villians with half white \/ half black hair ... it does have 1 thing ... realistic people acting normally in a strange circumstance, and Walt & Roy did in their eras with the studio. If you thought think \"The Castaways\" or \"The Island At The Top Of The World\" weren't identical, or you hold them to a higher authority than Atlantis, then your idealism is just as whacked as keeping your kids up till midnight to watch a friggin' cartoon."}
{"label":1,"sentence":"Kalifornia is the story of a writer and his girlfriend photographer who are looking for someone to help pay gas money and take turns at the wheel for a cross country road trip to famous murder sights. Ironically a serial killer and his girlfriend answer the post. Kalifornia is a diamond in the rough and a very intriguing journey with a serial killer. Great performances all around by the leads with Pitt in particular being exceptional. Check it out!!"}
{"label":1,"sentence":"Magnificent and unforgettable, stunningly atmospheric, and brilliantly acted by all.<br \/><br \/>I really cannot understand what sort of people are panning this masterpiece and giving the preponderance of votes as 8 (and nine ones!)<br \/><br \/>This, along with Grapes of Wrath, is John Ford's greatest movie. I would say that Long Voyage Home is next in line, though quite a way back.<br \/><br \/>Rating: 10. It deserves a 12."}
{"label":1,"sentence":"The story: On the island Texel, photographer Bob, who makes a photo shoot for a magazine, meets the mysterious Kathleen. Her free spirit and lust for life intrigues Bob, who has suffered a very traumatic experience shortly before. Her life is not so simple as it seems, however. Through Kathleen, Bob gets entangled in a dangerous network. Will Kathleen be able to win his trust?<br \/><br \/>Review: The dialogue in this movie is very natural and the story unfolds nicely although it stays a bit on the surface and it would have been nice if the character's 'psychology' would have been worked out a little more. Why do these people do the things they do? What motivates their choices? This is what gives a movie depth and something to think about in my view. The story never reaches an emotional climax, even though the characters go through enough to justify that. So you don't get to know the characters on that deeper level. The actors deliver good work and play in a very natural and 'believable' way, but I think it would have suited the movie better if Kathleen had been played by a younger actress, as this character's naiveness doesn't quite work for a grown-up woman. Camera-work is nice, and there are some great shots of the nature on the island. I give the movie a 7\/10."}
{"label":1,"sentence":"This was a wonderful little American propaganda film that is both highly creative AND openly discusses the Nazi atrocities before the entire extent of the death camps were revealed. While late 1944 and into 1945 would reveal just how evil and horrific they were, this film, unlike other Hollywood films to date, is the most brutally honest film of the era I have seen regarding Nazi atrocities.<br \/><br \/>The film begins in a courtroom in the future--after the war is over (the film was made in 1944--the war ended in May, 1945). In this fictitious world court, a Nazi leader is being tried for war crimes. Wilhelm Grimm is totally unrepentant and one by one witnesses are called who reveal Grimm's life since 1919 in a series of flashbacks. At first, it appears that the film is going to be sympathetic or explain how Grimm was pushed to join the Nazis. However, after a while, it becomes very apparent that Grimm is just a sadistic monster. These episodes are amazingly well done and definitely hold your interest and also make the film seem less like a piece of propaganda but a legitimate drama.<br \/><br \/>All in all, the film does a great job considering the film mostly stars second-tier actors. There are many compelling scenes and performances--especially the very prescient Jewish extermination scene towards the end that can't help but bring you close to tears. It was also interesting how around the same point in the film there were some super-creative scenes that use crosses in a way you might not notice at first. Overall, it's a must-see for history lovers and anyone who wants to see a good film.<br \/><br \/>FYI--This is not meant as a serious criticism of the film, but Hitler was referred to as \"that paper hanger\". This is a reference to the myth that Hitler had once made money putting up wallpaper. This is in fact NOT true--previously he'd been a \"starving artist\", homeless person and served well in the German army in WWI. A horrible person, yes, but never a paper hanger!"}
{"label":1,"sentence":"This movie reminded me that some old Black & White movies are definitely worth the look.<br \/><br \/>Initially I had some reservations, however from the beginning of the movie until the end I was captivated. I was VERY impressed with the mixture of drama, suspense & comedy.<br \/><br \/>Arthur Askey (Tommy Gander) is HILARIOUS and had me in stitches the whole time.<br \/><br \/>Definitely add this movie to your movie-night for some light relief from the sometimes depressing and \"too\" powerful or overly \"funny\" movies of today."}
{"label":1,"sentence":"A film destined to be on late-night TV long after the present instant \"money-makers\" have long been forgotten. Perhaps a little too subtle for today's youngsters, but in time they'll grow into an appreciation of this movie."}
{"label":1,"sentence":"Another fantastic film from a country, where due to decades of oppression from fundamentalist regimes, has no problems in creating passionate subject matter. Panahi takes a different approach this time around with a blend of ironic comedy and an endearing, non-professional cast. While still getting across his message of what he sees as being inherently wrong with his country, he does so without the need of a heavy storyline. It is a positive take on a country, in particular its people, that the Iranian population desperately need. The greatest pity is it won't be released domestically. The insular, paranoid Iranian government assert that this fine film maker is only successful overseas because he is part of a global conspiracy to embarrass them. After growing up amid revolution and watching the academics, artists and educated 'disappear' over the last 25 years he shows great bravery in continuing to put his work out there. The realism achieved by shooting at the actual world cup qualifier really transports you to the event. The fact he shot it on 35mm is amazing as most would only attempt this project using a digital format. It looks fantastic. His insistence in only using non-professional actors also really works in this film. Fine performances all round. After watching many films showing the problems Iran has and also the news media reporting the facts we can tend to demonise the people as well as the government. This film does the opposite. It shows us they still love the same things and that by laughing at themselves and the absurd rules of sharia law that maybe a change for the better isn't too far away. Some call Panahi a feminist film maker but I think he just fights for the most oppressed demographic in Iran. Young, independent women."}
{"label":1,"sentence":"After realizing what is going on around us ... in the news .. in our homes .. the whole new world .. I remembered this show and how obsessed I was watching it every week (in my town) ..<br \/><br \/>I started looking for this series .. 3 days ago .. didn;t have luck till this moment .. and I was shocked when I read about it and about CBS ..<br \/><br \/>People, I believe they stopped the show because it's talking about something way ahead of our understanding of the new world ... it was trying to deliver a hidden message about something terrifying ..<br \/><br \/>The people who stopped it are the same who are controlling the world Now .. I remember in one of the episodes it was talking about the ONE dollar and the pyramid with the one eye ..."}
{"label":1,"sentence":"My favorite movie. What a great story this really was. I'd just like to be able to buy a copy of it but this does not seem possible."}
{"label":1,"sentence":"The story-line of \"The Thief of Bagdad\" is complex, owing to its being told in flashbacks and having three separate and equally important strands woven together. The screenplay by Lajo Biros and the dialogue by Miles Malleson keep the story moving skillfully at all points.The young King Ahmad of Bagdad is angry at his vizier Jaffar for executing a man for having different ideas. He discovers while in disguise that people blame him for Jaffar's deeds and hate him. He is imprisoned by Jaffar, where he meets Abu the young thief. The two escape and take a boat to the city of Basra. There the companions spy when men clear the way so none will see the Princess of the city passing by. Ahmad falls in love with her and visits her in her garden. He tells her he has come to her from beyond time and wins a kiss. Then he is captured. When Jaffar comes to win the Princess of Basra for himself, Ahmad attacks the evil vizier who blinds him and turns Abu into a dog. Jaffar then asks for the Princess's hand, and he gives the gift of a mechanical flying horse to the Sultan of Basra. The blind Ahmad then tells his tale in the marketplace, accompanied by Abu as his dog. The Prince has fallen into a sleep and nothing can wake her. So Jaffar sends his servant Halima for Ahmad and the dog, in hopes the prince can rouse her. He does awaken her. She boards a ship to find a doctor to cure Ahmad, but she is captured by Jaffar who then throws the dog overboard. She then allows Jaffar to take her in his arms, on his promise to restore Ahmad's sight and turn Abu back into a thief. The princess sees a vision of Ahmad; he is in a boat; Jaffar sends a storm to beset him and Abu is shipwrecked on a deserted island. Abu finds a genie or djinn who wants to kill him now that he is free after many centuries spent imprisoned in a bottle. Abu tricks him into proving he really came from so small a vessel, then corks him in again. For freeing him, he gets three wishes. His first is for sausages. In the meanwhile, the Princess pleads with her father to refuse Jaffar; but Jaffar shows the Sultan a new mechanical toy, one of whose six arms stabs him to death. Abu makes a second wish, to find Ahmad. The cunning genie flies him to the goddess of the All-Seeing eye. Abu has to climb a great web to get to the gem that is the eye, battling a giant spider, then scaling the goddess's statue. Abu gazes into the 'eye' and sees Ahmad in a canyon. He has the genie take him to Ahmad. Ahmad uses the eye to see the princess. She smells a flower and forgets everything at once. Abu wishes they were in Bagdad, but the genie laughs and leaves; Jaffar tells the Princess that she is in love with him, omitting mention of Ahmad. Ahmad tries to fight his way to the Princess, but Jaffar smashes the 'eye'. Abu finds himself in the \"Land of Legend\", where the old men who rule want to make him their king. He steals a bow and a magic carpet and escapes instead, to hurry to save Ahmad and the princess. The thief arrives in time to save the young king from the executioner, using his bow from the flying carpet, to the wonder of the throng who had come to watch the execution. Jaffar tries to flee on the mechanical flying horse, but another shot from the bow finishes him. Ahmad is ruler again and plans to wed his Princess; but when he tries to make Abu his vizier, the young thief refuses, saying that what he wants is adventure, not hard work and confinement in a palace however grand it may be. This fantastic story was given a sumptuous production by producer Alexander Korda. The production was designed by Vincent Korda who was also art director, while Georges Perinal did the colorful cinematography. The directors credited are Ludwig Berger and Michael Powell, with Tim Whelan, Alexander Korda, William Cameron Menzies and Zoltan Korda participating. The extraordinary and numerous costumes designs were the work of John Armstrong, Oliver Messel and Marcel Vertes. The production, apart from its gorgeous and expensive-looking visual splendors, I claim is dominated by two other elements, the choral music of Miklos Rozsa and the performance by Conrad Veidt as the evil Jaffar. Rex Ingram plays the genie with a curious accent, plus his usual intelligence and power. June Duprez is lovely and effective as the Princess Mary Morris is a sad and beautiful Halima, and Miles Malleson a properly bumbling and avaricious Sultan. As Ahmad, John Justin appears to do most of what can be done with the part of a young prince in love and then some; he is memorably good in his winning role. This film has a spaciousness about it that is found, I assert, in other Korda works also. Its imaginative content stands in contrast to very-strong realistic sets, costumes and set-design elements. This is one of the most memorable idea-level fantasies of all time, worthy to be enjoyed over and over."}
{"label":1,"sentence":"I've just watch 2 films of Pang brothers, The Eye and One take only. When I watched The Eye, I was kind of disappointed about this two guys, who I had heard good words about them before. That film (The Eye) has a really bad script, especially the ending (childish,cliche and too coincident in my opinion) , but its still good in photography and experimental images. So I decided to see One take only and I didn't disappointed again. Still great photography, stunning image, MTV-style editing, cool music and this time,the story has a lot of indie spirit,logical and beautiful, you'll see some tiny plot holes, but it doesn't cause any trouble with the storyline. The only problem about this film is I get a bad DVD."}
{"label":1,"sentence":"Escaping the life of being pimped by her father(..and the speakeasy waitressing)who dies in an explosion, Lily Powers(Barbara Stanwyck, who is simply ravishing)sluts her way through the branches inside a bank business in big city Gotham. When a possessive lover murders who was supposed to be his next father-in-law(and Lily's new lover), the sky's the limit for Lily as she has written down her various relationships in a diary and subtlety makes it known the papers will receive it if certain pay doesn't come into her hands. Newly appointed president to the bank, Courtland Trenholm(George Brent), sends Lily to Paris instead of forking over lots of dough, but soon finds himself madly in love after various encounters with her in the City of Love. This makes Lily's mouth water as now she'll have reached the pedestal of success seducing a man of wealth and prestige bring riches her way. Though, circumstances ensue which will bring her to make a decision that threatens her successful way of achieving those riches..Trenholm, now her husband, is being indicted with jail certain and has lost the bank. He needs money Lily now has in her possession or he'll have absolutely nothing.<br \/><br \/>Stanwyck is the whole movie despite that usual Warner Brothers polish. Being set in the pre-code era gives the filmmakers the chance to elaborate on taboo subjects such as a woman using sex to achieve success and how that can lead to tragedy. Good direction from Alfred E Green shows through subtlety hints in different mannerisms and speech through good acting from the seductive performance of Stanwyck how to stage something without actually showing the explicit act. Obviously the film shows that money isn't everything and all that jazz as love comes into the heart of Lily's dead heart. That ending having Lily achieve the miraculous metamorphosis into someone in love didn't ring true to me. She's spent all this time to get to that platform only to fall for a man who was essentially no different than others she had used before him."}
{"label":1,"sentence":"I just purchased and viewed the DVD of this film. The DVD transfer is from last year, 2001. This 1988 film is really a great little film. Overlooked by most people. I saw it in the theater in 1988 and have loved it ever since. I love the opening shot of Pittsburgh (not Baltimore, as another user commented). Makes Pittsburgh look like one of the most beautiful cities in the world! And I must say, the tour of Pitts on the garbage truck with Nicky is a very scenic, interesting one! Tom Hulce, as everyone else has said, gives a remarkable, wonderful performance. The DVD is a good transfer, with no extras, but a widescreen format. I recommend it to those who love the movie."}
{"label":1,"sentence":"Hrm-I think that line was from the old movie posters.<br \/><br \/>This is a dumb movie that seems to have been translated from some language that was totally unfamiliar to the translator. Here's a tip: Any movie that starts with a black screen and text reading \"In the future...\" is going to be fun. This means that the premise is so implausible that they have to explain it to you.<br \/><br \/>In this case, \"In the future...\" means that, instead of fighting wars, nations have guys climb into giant robots and duke it out to determine, well, that's never terribly clear, but it's probably something really important. There are good guys (obviously capitalists, i.e. \"us\") and bad guys (Commies!) and there are big stop-motion robots.<br \/><br \/>Sadly, the effects budget was pretty slim, so we don't get to see a lot of the big robots. There are plenty of cheap looking interior scenes, and then a big space fight near the end. The space fight is especially nice, as it serves precisely no purpose other than the blow the remainder of the effects budget.<br \/><br \/>With said money now spent, the climactic fight degenerates into (and I'm not making this up) two guys hitting each other with sticks. I can always get a laugh in a bar by re-enacting the final scene, complete with a last line guaranteed to leave any audience scratching their heads.<br \/><br \/>Like I said-it's dumb. That's why I bought the tape."}
{"label":1,"sentence":"A simple movie in the beginning, a simple movie in the end. It does have that un-ending and pretending cliche, but, most tv movies have that any ways.<br \/><br \/>Christopher Reeve does a good job as being an ex-con\/drifter. The marriage between her and the woman he works for, I feel is a bit queer, but, I believe for the time period it is set in, that it is believable none-the-less.<br \/><br \/>Now, I saw the edited 'tv' version, even tho the movie was made and showed on 'tv', I find that a bit queer as well. But, I feel if I saw the entirety of the piece, I would give it more-in-likely the same rating.<br \/><br \/>J.T. Walsh does a nice job, not his best role, but, still....a nice job.<br \/><br \/>7\/10"}
{"label":1,"sentence":"This is a lovely tale of guilt-driven obsession.<br \/><br \/>Matiss, on a lonely night stroll in Riga (?) passes by a woman on the wrong side of a bridge railing. He passes by without a word. Only the splash in the water followed by a cry for help causes him to act. And then only too little and too late.<br \/><br \/>The film chronicles his efforts at finding out more about the woman. On a troll of local bars, he finds her pocketbook. He pieces more and more of her life together. His \"look\" changes as his obsession grows. He has to make things right. In a marvelously filmed dialog with the \"bastard ex-boyfriend\" he forces Alexej to face up to the guilt that both feel.<br \/><br \/>Haunting long takes, a gritty soundtrack to accentuate the guilt, barking dogs. Footsteps. Lovely film noir with a lovely twist. A good Indie ending."}
{"label":1,"sentence":"If you enjoy Cleese & all the British 'Pythonesque' humour of the time, then this little gem is absolutely hilarious.<br \/><br \/>Arthur Lowe is a real treat!<br \/><br \/>I saw this with friends on TV when it first came out, and its classic quotes have formed a part of our jokes for 30 years, and will do forever! I have it on tape and it is continually appreciated.<br \/><br \/>Perhaps some reviewers are taking it too seriously.<br \/><br \/>I can't believe it is now only available in the US (NTSC of course), and not in UK, where it should be an essential part of the history of British humour!!"}
{"label":1,"sentence":"It seems Hal Hartley's films are kind of hit or miss with most audiences. This film will be no exception to that rule. Fay Grim acts as a sequel to Hartley's 'Henry Foole' from 1998. The focus this time is on Henry's ex wife (played to perfection by the always welcome Parker Posey), who is being pestered by CIA goons about Henry's unpublished book about all of his shady dealings. In the interim of all of this, Fay ends up on an odyssey,dealing with international spies,etc. The film does get a bit bogged down in the second half. If you've been a fan of Hal Hartley in the past, this is one not to be missed. For the novice Hartley first timer who has only heard of his film making technique, you might want to check out his earlier films before taking on this one (especially if you haven't seen 'Henry' yet). I admired the camera work,which at times reminded me of certain early Man Ray photography."}
{"label":1,"sentence":"I must say that I really had no idea that I was going to sit down and watch this movie. I guess it was the fact that I had nothing better to do between class. But, for once a TV movie caught my interest. More importantly Helen Hunt caught my eye. I really wasn't a big fan of hers prior to this film. Sure I liked Twister and As Good As It Gets. But, something about this movie really did it for me. I would now see myself as a huge fan. This movie comes with high marks from...me. Give it a chance, it won't let you down."}
{"label":1,"sentence":"I enjoy watching people doing breakdance, especially if they do it as well as in the best scenes of this movie which takes you to a disco club called \"Roxy\". Especially at Christmas time, because there also appears a \"MC Santa Claus\".<br \/><br \/>Even if this is an old film, and even if I have videotaped it from TV, when the State Movie Archive of Finland showed this in the summer of 2004 on their own big screen, I went there to check it out. It's much more enjoyable on big screen than on TV.<br \/><br \/>Even if many people here think that watching this on big screen is a waste of money for the ticket cost, I disagree with this and I think that when I paid my ticket, I got the money's worth by seeing this, as it is on big screen, especially seated on front row of the cinema, an unforgettable experience, and much better than just on video."}
{"label":1,"sentence":"i'm really getting old,,am in the midst of watching this 40 year old flick,and wonder what my grandchildren will be watching 40 years from now,,its an old saying,,but they don't make em like that anymore..it's not only the story,its the music,the acting both by young and old..the cast ,it would seem,were born to play their roles,,young oliver,,old Fagin..too many to mention them all,the role played by the judge oliver stands before,i've seen in other roles over the years..the artful dodger,,Ron moody as Fagin,,Mr and Mrs bumble,,the movie not only won 5 Oscars,,but took a few golden globe awards too..if you decide to see this film..do yourself a favor,,take a few if not all the children,to see this masterpiece"}
{"label":1,"sentence":"If it were possible to distill the heart and soul of the sport--no, the pure lifestyle--of surfing to its perfect form, this documentary has done it. This documentary shows the life isn't just about the waves, but it's more about the people, the pioneers, and the modern day vanguard that are pushing the envelope of big wave further than it's ever been.<br \/><br \/>Stacy Peralta--a virtual legend from my early '80s skateboarding days as a SoCal teen--has edited reams of amazing stock and interview footage down to their essence and created what is not just a documentary, but a masterpiece of the genre. When his heart and soul is in the subject matter--and clearly it is here--his genius is fraught with a pure vision that doesn't glamorize, hype, or sentimentalize his subject. He reveres surfers and the surfing\/beach lifestyle, but doesn't whitewash it either. There is a gritty reality to the sport as well.<br \/><br \/>There is so much that could be said about this documentary, about the surfers, the early history of the sport, and the wild big wave surfers it profiles. Greg Noll, the first big wave personality who arguably pioneered the sport; Jeff Carter, an amazing guy who rode virtually alone for 15 years on Northern California's extremely dangerous Maverick's big surf; and, the centerpiece of the documentary, Laird Hamliton, big wave surfing's present day messiah.<br \/><br \/>There is tremendous heart and warmth among all these guys--and a few girls who show up on camera--and a deep and powerful love for surfing and the ocean that comes through in every word. I found the story of how Hamilton's adopted father met him and how Hamilton as a small 4- or 5-year old boy practically forced him to be his dad especially heartwarming (and, again, stripped of syrupy sentimentality).<br \/><br \/>If you like surfing--or even if you don't--this is a wonderful documentary that must be watched, if only because you're a student of the form or someone who simply appreciates incredibly well-done works of art."}
