{"label":0,"sentence":"Ice-T stars as Mason a homeless African-American who finds himself hunted by wealthy hunters (Rutger Hauer,Gary Busey,Charles S. Dutton, F.Murray Abraham,William McNamara and John C. McGinley) however Mason proves to be much harder prey then the usual targets in this ridiculous and slow paced actioner which takes too long setting up actionscenes and then totally botching them."}
{"label":0,"sentence":"If you want to laugh like crazy, rent Cage. Cage is about two war heroes, Billy and Scott who are best friends. When Billy is shot in Vietnam, he is unable to fend for himself, so Scott takes him in.<br \/><br \/>I have never seen a movie with more gay references to the two main characters. Billy and Scott love to \"wrestle\" and Scott tells Billy that he is \"still sore from last night,\" among other things.<br \/><br \/>Wonderful catch phrases like \"Shut the sh!t up\" and \"Ping Pang Pong, cut the sh!t\" will keep you laughing for hours. The native American guys that are supposed to be playing Mexican gang members are also top notch. As they say, it's \"party time right now. Ba-ba-ba-ba ba-ba.\" I could go on forever, but just watch this movie and laugh your a$$ off. It was so funny I went out and bought the DVD for $5.99"}
{"label":0,"sentence":"I sat through this movie expecting a thought-provoking, fact-based film. But instead was given some of the least thought out arguments against the Christian faith imaginable. For instance, in an effort to prove that Christianity is inherently violent, the narrator constantly quotes the bible without giving context, and thus altering the meaning of the text. Jesus is quoted as commanding the execution of those who disobey him, when in fact, the quote is from a parable Jesus told, involving a king who is then quoted. Thus the narrator makes it appear as if Jesus says one thing when he is actually telling a story where one of his characters says it. This is dishonesty in a very obvious form. Is this really what Atheism has to offer the world? This film also attempts to use the success of the Passion of the Christ over Jesus Christ: Superstar and The Last Temptation of the Christ as evidence that Christians are bloodthirsty. He makes no mention of the fact that the Passion was the most historically accurate Bible-film to date. He makes no mention of the fact that it was actually the best liked by critics of the bunch. He then edits in a series of violent images from the Passion as if to hammer home his point. Ironically, he makes no mention of The Texas Chainsaw Massacre which came out a few months later and plays violence for entertainment, versus dramatic effect.<br \/><br \/>One thing that really bothered me was his mockery of people who actually knew more about the subject matter than he did. All the Christians he interviewed were average schmoes in the parking lot of Billy Graham's New York Crusade. Atheists he interviewed for the film were notable authors and scholars. He asked the Christians how the Christian movement started, and of course, they said it started with the Holy Spirit coming to the disciples at Pentecost. Which is correct (Acts 2). He then gives the commentary, \"isn't it funny how so few Christians seem to know the origins of their own faith?\" and proceeds to explain that the apostle Paul started Christianity after being stopped on the road to Damascus. The poor chap seems convinced that Acts 9 happens before Acts 2. More deception? Or is this simply ignorance? He also throws around nonsense that Paul didn't believe Jesus was a real person. Are you kidding me? 1 Corinthians 15 describes Jesus death and resurrection being witnessed by people (whom Paul names in the passage) for the Corinthians to question if they are in doubt!<br \/><br \/>There are many many other examples of how full of crap this 'documentary' is. But because I don't have time or patience to go into them all, I'll skip straight to the end. It's obvious throughout the whole movie that the narrator has an emotional vendetta against his upbringing in the church. And the climax interview is HIS CHILDHOOD PRINCIPLE! In a last-ditch attempt to disprove the Christian faith, the narrator tries to make a fool out of someone who gave him a detention as a child. Is this what passes as an intellectual documentary for the Atheist community? Surely there are intelligent Atheist filmmakers out there who can make a documentary that isn't a load of made-up crap passed off as 'facts'."}
{"label":0,"sentence":"2 stars for Kay Francis -- she's wonderful! And she didn't deserve this horrible tripe that Warner Bros. threw her way! <br \/><br \/>The two-pronged premise that this movie is based on is ridiculous and unbelievable in the extreme. Kay is a small-town wife and mother who yearns for something bigger: she wants to be an actress. When a big-shot actor comes to town and invites Kay to his hotel to talk about possibilities, Kay tells her husband she's going to the movies. The hubby's biddy of a mother puts a bug in hubby's ear that Kay's not being truthful, and he sets out looking for her. He finds her w\/ the actor in the hotel (they are only talking!) and he slugs the guy, who falls over a railing, lands face-first in a pond (lake?), and dies. Now here's the two unbelievable premises upon which the rest of the movie is based: <br \/><br \/>1) the judge tells the jury that if it's determined that the man died *before* his head went into the water, that they must find the hubby guilty of first degree murder. (Whaaaaa?????? I think slugging a guy in a fit of rage would count for manslaughter or murder 2 at the most, not FIRST DEGREE murder. Give me a break! But the plot required him being found guilty of murder 1 so that he could be sent to prison for life. Whatever.) <br \/><br \/>2) the hubby's lawyer, after the conviction and sentencing, tells Kay that it's all HER fault. His reasoning is that if she hadn't gone over to the actor's room, then her husband wouldn't have had to go after her and slug the guy and kill him. He tells her that she's the guilty one, not her husband, and she nods and agrees. What. The. Hell?!?!?! The rest of the movie is all about Kay trying to achieve fame and money in order to get her husband released from prison and right the wrong she committed by causing him to kill the actor dude in the first place.<br \/><br \/>I can't even go on with this review. The movie was just all too painful. Four years earlier, in the pre-code days, you'd never have caught Kay playing such a wimp! In true Kay Francis fashion, though, she did do her best to make us believe that this woman was a believable character. I give her much credit for trying to breathe some life and credibility to this thankless role. This character was a far cry from pre-code Kay roles and real-life spitfire Kay Francis.<br \/><br \/>Steer way clear of this one! There are much better Kay Francis vehicles out there! (From personal experience, I can highly recommend Mary Stevens, MD and Jewel Robbery; also good are Dr. Monica and One Way Passage. I'm sure there's other great Kay flicks as well, but I'm only mentioning the ones I've seen and can recommend.)"}
{"label":0,"sentence":"If this could be rated a 0, it would be. From the atrocious wooden acting to the dull, plodding pace, the puerile exploitation angle and the sophomoric pseudolesbian titillation added purely for the sake of the sad viewers, this is a disaster of a film.<br \/><br \/>The plot is predictable, as from the beginning one is absolutely certain of what will happen to all of the characters and how the plot will commence. From a boring, unexceptional beginning to a pathetic and bleak ending, every single presence in this film is wasted, and every meagre scrap of talent dug up for this turkey is squandered.<br \/><br \/>If you want to watch something as relentlessly bleak with plenty of the same childish titillation, watch one of the Ilsa films. At least they're unapologetic and up-front about what they're trying to do. How something this horrendously bad ever managed to be rated above a 5 is a miracle of how people with no taste or discerning standards can sometimes come together for the most dubious of purposes.<br \/><br \/>It's not scary, it's not interesting, and above all it's not arousing in any sense of the word. It is, in my opinion, a crime; it is a crime that such a horribly offensive and incompetent piece of trash was ever conceived of and given the resources to come into existence, and even more a tragedy that it is still defended by some woefully misguided viewers.<br \/><br \/>Not even Elvira's cheerful personality and joking ways could soften the blow that this horrifying travesty of film is. Avoid it at all costs."}
{"label":0,"sentence":"This is yet another depressing and boring film about AIDS and tragedy. It begins very uneventful and predictable and continues throughout the movie. I kept waiting for it to pick-up, but unfortunately it never did. The acting is fair, but the script needs A LOT of work. And if you're looking for the nudity, don't waste your time with these not so hot actors. Due to the poor sound quality and lack of captions, I missed 1\/8 of the movie. If you have never seen over five gay films, or have recently come to terms with being gay, you may find this film interesting, otherwise it's your run-of-the-mill low budget movie. It ranks as one of the worst gay films I have ever seen."}
{"label":0,"sentence":"OK so i am like most people, give me free tickets and i will go and see most things, now that multiplex cinemas are so good (i remember the old \"flea pit\" single screen cinemas and i am the healthy side of 40). In England this film was released as \"Liar\", it's a dog. It is a total waste of good celluloid. 4\/10 for the photograpy and set only."}
{"label":0,"sentence":"My comment is for the Russian version of Space Race named Bitva za Kosmos (Battle for Space) shown on Russia's First Channel on April 10-13, 2006. Bad translation could have ruined some details but I doubt it's the case. The number of factual errors is such that it's impossible to list them, especially in the first episode (the development of first missiles). Even the U.S. half of the film contains multiple errors and omissions. The audience is not told of any V-2\/A-4 launches from the U.S. Three different Jupiter C rockets are launched with the same serial number 'UE' onboard. Apollo 1 is to be launched to the Moon, etc. In the Russian half, each and every person is ludicrous. Korolev is scared of NKVD, Glushko is saboteur and traitor, Mishin is alcoholic etc. Men as functions; no motivation, no life at all. Uniform and decorations are awful. Gagarin sings a frivolous song awaiting launch (I think this was added specially for Russian version)."}
{"label":0,"sentence":"How many centuries will pass until the Japanese\/Asian horror films abandon the long-haired ghost-woman shtick? Admittedly, they've managed to rip off \"Ringu\" a million times, and often it worked well - which just goes to show that originality isn't that much of a requirement in the horror genre (or that I'm very uncritical and easy to please?). However, this time around I found myself a little restless, somewhat bored. It's not a bad film, but it's at least half-an-hour longer than it should be, with its absurd 110 minutes length. Compared to many other Japanese horror films, OMC lacks atmosphere and excitement. Plus, the ending is confusing: it makes no sense at all. As for the ring-tone: Miike could have come up with a melody that is more effective than that forgettable little thing. Even though it was played a dozen times I can't even remember it - that's how scary it was. Speaking of Miike, for him this is something of a commercial venture, so if anyone thinks they might be getting perversion of the \"Bijita Q\" or \"Audition\" kind, they're wasting their time."}
{"label":0,"sentence":"I loved Dewaere in Series Noir. His talent is trivialized in \"The Waltzers\" aka \"Going Places\". Okay, it's a couple of guys flaunting convention in the most absurd and irredeemable ways; many folks find such behavior amusing. This was a boring, pointless exercise designed to shock. I find the smirk on Blier's face, the face behind the camera, annoying. Series Noir was a valid expression of personal liberty and licentious behavior. From the first moment when we see Patric Dewaere prancing in the abandoned lot we get an idea of the bewilderingly beautiful anti-hero we'll be spending time with for the next couple of hours. When we see him chasing the hapless middle aged female with his buddy Depardieu in \"Going Places\" we have fair warning that two hours spent with these chaps will be soul-draining. I have trouble eking even a \"3\" for this annoying distraction."}
{"label":0,"sentence":"Omen IV (1991) was a bad made-for-T.V. movie. Since the 80's were over, I guess the executives were experimenting in meth (the drug of choice during the 90's) because there is no other reason to explain this travesty. Why did they even bother making this? A t.v. movie? What were they mulling over when this one came up on the idea board? Did they even think for a second that this movie would catch on as. Perhaps they thought it could make it as a series? We'll never know. But I know one thing. This movie was the major reason why I never bought the Omen trilogy. They should have knocked off a couple of bucks instead of putting out this \"extra\" disc.<br \/><br \/>Omen IV is basically a average American family remake of the first film. Instead of a snot nosed punk kid, we get the spooky girl who's a total brat to everyone around her. If the family had stronger parenting skills, then none of the demonic events that have transpired in the past films would have never occurred. These parents need to put their foot down and do some real discipline! <br \/><br \/>Not recommended, best to avoid at all cost!"}
{"label":0,"sentence":"In Hollywood in the 1930's and 1940's, I think that every studio can make a western, except Warner bros. The few times they try, it always ridiculous (except, perhaps, for They Died with their Boots on - which is a cavalery western.) I have read that Humphrey Bogart, seing James Cagney with this big cowboy hat on his head, said that he looks like a mushroom. True! Cagney and Bogart are too urban, too XXe century to be credible in a western movie. The story here had no suprise, and it did't help. Every 10 minutes, I figure I can see Bogart and Cagney drops their little guns and put hands in a machine gun to get away from the set in a 1930's black car."}
{"label":0,"sentence":"Seriously, I don't even know where to begin. It's like somebody gave a bazillion dollar budget to an autistic third-grader and said 'make me a movie about the secret service'. The editing is ridiculous, the cinematography was random at best, every single syllable of dialogue was completely retarded and the directing ... well, was there even a director there? Everything was just so pointless and lame and pointless...and random....and lame.<br \/><br \/>Here's a SPOILER for you; this movie is the dumbest thing you'll ever see. <br \/><br \/>However, if you liked this piece, you'll also enjoy; Deterrance, Dark Blue, and a partial frontal lobotomy."}
{"label":0,"sentence":"This movie was packed pull of endless surprises! Just when you thought it couldn't get worse, they added more joints and more pink fuzzy-lined vans with raunchy sex scenes. As you can guess, I was a victim of the original version. We were tricked into watching it thinking it was Supervan, the host box which promised lasars, jail breaks, and much more. Who would have thought a Dollar Store Christmas present could have been so much fun!"}
{"label":0,"sentence":"I'm not a big fan of rom\/coms at the best of times. A few have been quite good (check of Dream for an Insomniac), but this one is just more of the same but less.<br \/><br \/>With a running time of 100min, I expect more than 1 laugh every 30mins. The only real belly laugh are when male strangers and friends instinctivly help out Lee's character.<br \/><br \/>All I can say is AVOID. I gaurentee there is at least 10 other movies on the shelf that deserve you $$<br \/><br \/>3 of out 10 (And only cos I'm a big Lee fan)"}
{"label":0,"sentence":"Average (and surprisingly tame) Fulci giallo which means it's still quite bad by normal standards, but redeemed by its solid build-up and some nice touches such as a neat time twist on the issues of visions and clairvoyance.<br \/><br \/>The genre's well-known weaknesses are in full gear: banal dialogue, wooden acting, illogical plot points. And the finale goes on much too long, while the denouement proves to be a rather lame or shall I say: limp affair.<br \/><br \/>Fulci's ironic handling of giallo norms is amusing, though. Yellow clues wherever you look.<br \/><br \/>3 out of 10 limping killers"}
{"label":1,"sentence":"I was totally impressed by Shelley Adrienne's \"Waitress\" (2007). This movie only confirms what was clear from that movie. Adrienne was a marvelously talented writer-director, an original and unique artist. She managed to show the miseries of everyday life with absurd humor and a real warm optimistic and humanistic tendency. Ally Sheedy steals this movie with a terrific performance as a woman who has fallen over the edge. Male lead Reg Rodgers, looking like Judd Nelson, is fine. There is also a great cameo by Ben Vereen. The song at the end of the movie \"The Bastard Song\" written by Adrienne can stand as her optimistic eulogy: <br \/><br \/>\"It's a world of suffering,<br \/><br \/>In a sea of pain,<br \/><br \/>No matter how much sun you bring,<br \/><br \/>You're pummeled by the rain...<br \/><br \/>Don't let the heartless get you down,<br \/><br \/>Don't greet the heartless at your door,<br \/><br \/>Don't live among the heartless\""}
{"label":1,"sentence":"Bromwell High is nothing short of brilliant. Expertly scripted and perfectly delivered, this searing parody of a students and teachers at a South London Public School leaves you literally rolling with laughter. It's vulgar, provocative, witty and sharp. The characters are a superbly caricatured cross section of British society (or to be more accurate, of any society). Following the escapades of Keisha, Latrina and Natella, our three \"protagonists\" for want of a better term, the show doesn't shy away from parodying every imaginable subject. Political correctness flies out the window in every episode. If you enjoy shows that aren't afraid to poke fun of every taboo subject imaginable, then Bromwell High will not disappoint!"}
{"label":1,"sentence":"I actually like the original, and this film has its ups and downs. Here's just a few:<br \/><br \/>Ups: Most of the original voice cast returned.<br \/><br \/>Downs: I didn't like the voice of Timon's Ma. I know she did a voice in The Simpsons, but that show is just plain stupid. <br \/><br \/>Ups: We get to see Simba as a \"teenager.\"<br \/><br \/>Downs: They wasted it with a slug-slurping contest between Timon and Simba. <br \/><br \/>Ups: It was Rafiki who told Timon about \"Hakuna Matata.\"<br \/><br \/>Downs: How did Pumbaa find out about it?<br \/><br \/>Ups: Songs again. (some of the original songs were there, but they were just background music.)<br \/><br \/>Downs: But stupid songs. (a.k.a. Timon's solo.)<br \/><br \/>Overall, this is a pretty good movie. I'd recommend it for fans of the original. But if you don't like the original, chances are you won't like this one.<br \/><br \/>My Score: 7\/10"}
{"label":1,"sentence":"Most people know Paul Verhoeven as the director of many good (and bad) sci-fi movies in Hollywood. But long before that he was churning out generic thrillers in his native land. The story is a basic femme fatale premise, nothing new or enthralling. Verhoeven thinks he can make it better by adding in a series of dream sequences, which instead of defining our main character and his situation, are just used as a way to drive forward the predictable plot. The screenplay was solid, the dialogue helping to pad the effects of the bland story. What really made the movie at at least good was some terrific acting. Jereone Krabbe was amazing as the \"tortured artist\", and the supporters were very good as well. Also, Jan De Bont's cinematography adds at least some life to the film, helping to make Verhoeven look at least capable as a director.<br \/><br \/>6.5\/10<br \/><br \/>* * 1\/2 \/ * * * *"}
{"label":1,"sentence":"Time and time again, I've stated that if people don't want remakes or sequels made, they should stop seeing them and instead venture into the world of independent film. Having said that though, the last time I saw an independent film myself must have been easily six months ago. So here's a review for an indie that I had my attention drawn to on Youtube; the Cure.<br \/><br \/>Right away, you can tell that the film is going for an avant-garde film approach which is telegraphed in its use of extreme close ups, scopophilia and fast editing. It is proud of the way it looks - and it has a right to be. For the most part it is a very nicely composed little piece, save for one inexcusable disregard for the 180 degree rule and a comically bad gunshot effect which is a phenomenon that seems to be THE calling card for self funded projects.<br \/><br \/>Still, despite these amateurish mistakes the majority of the shots are actually a pleasure to look at. We're presented with a good use of props and locations, good visual acting and some very atmospheric, fluid editing, which is made more commendable as this is definitely something you won't see very often at all from a Youtube submission. The plot is fragmented and although the basic premise is fairly simple some may find it hard to follow exactly what is happening, but what we are seeing here is avant-garde storytelling at work; you can't really expect a straightforward three act structure and if you do you might not be ready for this kind of movie.<br \/><br \/>Where the film is unfortunately let down however is the sound. What you're going to hear throughout is a distorted voice-over which often sounds insincere and worse still is the continuous background music, which goes through minimal change and doesn't add much to anything. So much attention is paid to the visuals that the audio frankly sounds neglected, and this becomes really apparent when you realize you've just missed about four sentences of the narration and have to backtrack to pick up what slipped past your attention.<br \/><br \/>So, give it a watch, but do it with the sound turned off.<br \/><br \/>Last thought; was anyone else reminded of the cover for Doug Naylor's Red Dwarf novel \"Last Human\" early in the film? If you have the book you know what I mean."}
{"label":1,"sentence":"I first saw this movie when it originally came out. I was about 9 yrs. old and found this movie both highly entertaining and very frightening and unlike any other movie I had seen up until that time.<br \/><br \/>BASIC PLOT: An expedition is sent out from Earth to the fourth planet of Altair, a great mainsequence star in constellation Aquilae to find out what happened to a colony of settlers which landed twenty years before and had not been heard from since.<br \/><br \/>THEME: An inferior civilization (namely ours) comes into contact with the remains of a greatly advanced alien civilization, the Krell-200,000 years removed. The \"seed\" of destruction from one civilization is being passed on to another, unknowingly at first. The theme of this movie is very much Good vs. Evil.<br \/><br \/>I first saw this movie with my brother when it came out originally. I was just a boy and the tiger scenes really did scare me as did the battle scenes with the unseen Creature-force. I was also amazed at just how real things looked in the movie.<br \/><br \/>What really captures my attention as an adult though is the truth of the movie \"forbidden knowledge\" and how relevant this will be when we do (if ever) come into contact with an advanced (alien) civilization far more developed than we ourselves are presently. Advanced technology and responsibility seem go hand in hand. We must do the work for ourselves to acquire the knowledge along with the wisdom of how to use advanced technology. This is, in my opinion, the great moral of the movie.<br \/><br \/>I learned in graduate school that \"knowledge is power\" is at best, in fact, not correct! Knowledge is \"potential\" power depending upon how it is applied (... if it is applied at all.) [It's not what you know, but how you use what you know!]<br \/><br \/>The overall impact of this movie may well be realized sometime in Mankind's own future. That is knowledge in and of itself is not enough, we must, MUST have the wisdom that knowledge depends on to truly control our own destiny OR we will end up like the Krell in the movie-just winked-out.<br \/><br \/>Many thanks to those who responded to earlier versions of this article with comments and corrections, they are all very much appreciated!! I hope you are as entertained by this story as much as I have been over the past 40+ years ....<br \/><br \/>Rating: 10 out 10 stars"}
{"label":1,"sentence":"In my humble opinion, this movie did not receive the recognition it deserved. Robert Redford lives near me here in Provo, Utah, at Sundance. I enjoy most of his work, and this was my favorite. I'm sorry that more people didn't appreciate it. My grandmother was an avid reader and read the book years before it came out on the big screen. She gave it to me to read after we had seen the movie together. The movie and book hit an emotional spot within my heart, and I was weepy for several days after seeing the movie. Sometimes love isn't enough to keep our loved ones from hurting themselves. We see this in our own family relationships, yet our love and our families and their stories endure throughout generations of time. The cinematography was perfect and breathtaking -- I was awed by its beauty and how well it brought to life the words of the author of the book, Norman Maclean, \"But when I am alone in the half light of the canyon, all existence seems to fade to a being with my soul, and memories. And the sounds of the Big Black Foot River, and a four count rhythm, and the hope that a fish will rise. Eventually, all things merge into one, and a river runs through it. The river was cut by the world's great flood and runs over rocks from the basement of time. On some of the rocks are timeless raindrops. Under the rocks are the words, and some of the words are theirs. I am haunted by waters.\" These words, taken from the book and spoken at the end of the movie (by Robert Redford who is narrating as Norman Maclean), are basically scripture, in my opinion. Any possible flaws the movie may have are overshadowed by the beauty and grace of the story and the cinematography. It was beautiful!"}
{"label":1,"sentence":"As a Pagan, I must say this movie has little if any Magickal significance. It's a \"fun\" witchcraft movie and not meant to teach us anything except that love is the strongest Magick of all, and never to use it in a controlling or vengeful way. That's a lesson everyone needs to learn, not just Pagans.<br \/><br \/>That having been said, this movie is wonderfully written and sweetly executed by Kim Novak and the venerable Jimmy Stewart.<br \/><br \/>Hermione Gingold delivers a stellar performance as Bianca, Elsa Lanchester (with too many movie credits to mention except as Ms. Jane Marbles of \"Murder By Death\") was wonderful as Ms. Novak's absent-minded-yet-capable upstairs neighbor Queenie. Also starring Jack Lemmon (wonderful performance) and Jim Kovacs (brilliantly witty).<br \/><br \/>\"Witches can't cry. Why, they can't shed a single tear because their heart is full of Magick. They don't have time for silly things such as love.\" Queenie.<br \/><br \/>Gillian Holroyd (Novak) and her brother Nicky (Jack Lemmon) are Manhattan witches. Cloaked deeply within the secret underworld of those of the Craft, they live among other New Yorkers as one of them, without so much as causing a raised eyebrow. <br \/><br \/>But then, along comes Shepherd \"Shep\" Henderson (Stewart), a steadfast, no-nonsense, dedicated businessman who is engaged to be married to Gillian's old college rival. <br \/><br \/>By a quirky mishap of chance, he finds himself moving into Gillian's building and is instantly \"bewitched\" by her charm and grace. By the use of Magick, with a little help from Pyewacket (Gillian's familiar, trained by Robert E. Blair) and Queenie, Gillian begins to work on this handsome new dream man to get back at her old enemy.<br \/><br \/>But Magick should never be used to control, nor to hurt, and Gillian learns that the hard way in the most bittersweet way. Not only does she have to face what she's done, but she has to face Shep in her guilt. <br \/><br \/>From the critical perspective; however, the movie takes a serious turn: The effects are very dated to the point of being pure camp. Some of the scenery was seemingly shot in the basement of someone's small home, but at least the characters were quirky and fun.<br \/><br \/>On a personal note, Pyewacket steals the show. Great cat! Great training by Robert E. Blair. <br \/><br \/>As a Note of Trivia, this is the roots for the beloved Bewitched television sitcom. This introduces the original Samantha and Darrin. All the characters of note are present and accounted for. You have but to look, to see it for yourself.<br \/><br \/>This is one of my favorites, and I watch it often.<br \/><br \/>This movie gets a 9.1\/10 from...<br \/><br \/>the Fiend :."}
{"label":1,"sentence":"This film would usually classify as the worst movie production ever. Ever. But in my opinion it is possibly the funniest. The horrifying direction and screenplay makes this film priceless. I bought the movie whilst sifting through the bargain DVD's at my local pound shop. Me and some friends then watched it, admittedly whilst rather drunk. It soon occurred that this wasn't any normal film. Instead a priceless relic of what will probably be James Cahill's last film. At first we were confused and were screaming for the DVD player to be turned off but thankfully in our abnormal state no-one could be bothered. Instead we watched the film right through. At the end we soon realised we had found any wasters dream, something that you can acceptably laugh at for hours, whilst laughing for all the wrong reasons. We soon showed all our other friends and they too agreed, this wasn't a work of abysmal film. This was a film that you can truly wet yourself laughing at. This was a film that anyone can enjoy. This was genius."}
{"label":1,"sentence":"Big splashy film of the Broadway music. Nathan (Frank Sinatra) loves to roll the dice and organize illegal crap games. Blonde loving Adelaide (Vivian Blaine) wants to marry him IF he gives up craps. He decides on one last game when Sky Masterson (Marlon Brando!), who bets big, is in town. He bets Sky that he can't get mission worker Sarah Brown (Jean Simmons) to go with him to Havana. That may sound like a strange plot summary but so is the movie!<br \/><br \/>This is a real mixed bag--there's some wonderful stuff here. The songs are all good and the dancing is incredible. The real show stopper is at the crap game at the end. Also Brando is really quite good here--it might seem strange to think of him singing and dancing but he pulls it off. I have to admit seeing big, bulky Brando pulling off some difficult dance moves was a lot of fun! Also Sinatra is pretty good and Blaine is just wonderful as his long-suffering girlfriend. Her song and dance numbers are definite highlights here.<br \/><br \/>Now for the bad parts--Jean Simmons is a wonderful actress but she's stuck with a drab colorless role and can't do much with it. The movie is far too long at 150 minutes--the scenes between Brando and Simmons really drag and should have been shortened. Also most of the characters speak in very precise English--contractions are never used. Maybe it's trying to be amusing coming out of the mouths of gangsters but I found it jarring and it kept throwing me out of the movie.<br \/><br \/>It's worth catching for the songs and dances but the over length of it does get to you after a while. I give it a 7."}
{"label":1,"sentence":"Wealthy psychiatrist Lindsay Crouse has just published her first novel and is feeling down about her profession feeling that it's hopeless to help her patients. A young gambling junkie client asks her to help him pay off his debts if he truly wants to help him get better. Here she gets involved with Joe Mantegna. To reveal any more of the plot would spoil one hell of a fun movie and 'House of Games' may very well be the best con movie I've seen. David Mamet wrote and directed this gem that's full of snappy dialogue, great one-liners, and enough twists to keep you guessing til the end. Crouse is perfect as the uptight psychiatrist needing a change and Mantegna tops her as the devilishly sly con-man. And with the exception of a coincidence in the last quarter of the movie, the film is in utter control of it's audience; and we are loving the con.<br \/><br \/>*** out of ****"}
{"label":1,"sentence":"I've seen this film criticized with the statement, \"If you can get past the moralizing...\" That misses the point. Moralizing is in the conscience of the beholder, as it were. This is a decent film with a standard murder mystery, but with a distinct twist that surfaces midway through. The resolution leaves the viewer wondering, \"What would I have done in this position?\" And I have to believe that's exactly what the filmmaker intended. To that end, and to the end of entertaining the audience, the film succeeds. I also like the way that the violence is never on stage, but just off camera. We know what has just happened; it's just not served up in front of us, then rubbed in our faces, as it would be today with contemporary blood and gore dressing. Besides, the violence is not the point. The point is the protagonist's moral dilemma, which is cleverly, albeit disturbingly, resolved."}
{"label":1,"sentence":"A trio of buddies, sergeants all in the British Army, carouse & brawl their way across Imperial India. Intensely loyal to each other, they meet their greatest & most deadly challenge when they encounter the resurgence of a hideous cult & its demented, implacable guru. Now they must rely on the lowliest servant of the regiment, the water carrier GUNGA DIN, to save scores of the Queen's soldiers from certain massacre.<br \/><br \/>Based more on The Three Musketeers than Kipling's classic poem, this is a wonderful adventure epic - a worthy entry in Hollywood's Golden Year of 1939. Filled with suspense & humor, while keeping the romantic interludes to the barest minimum, it grips the interest of the viewer and holds it right up to the (sentimental) conclusion.<br \/><br \/>It is practically fruitless to discuss the performance nuances of the three stars, Cary Grant, Victor McLaglen & Douglas Fairbanks Jr., as they are really all thirds of a single organism - inseparable and, to all intents & purposes, indistinguishable. However, this diminishes nothing of the great fun in simply watching them have a glorious time.<br \/><br \/>(It's interesting to note, parenthetically, that McLaglen boasted of a distinguished World War One military career; Fairbanks would have a sterling record in World War Two - mostly in clandestine affairs & earning himself no fewer than 4 honorary knighthoods after the conflict; while Grant reportedly worked undercover for British Intelligence, keeping an eye on Hollywood Nazi sympathizers.)<br \/><br \/>The real acting laurels here should go to Sam Jaffe, heartbreaking in the title role. He infuses the humble man with radiant dignity & enormous courage, making the last line of Kipling's poem ring true. He is unforgettable.<br \/><br \/>Montague Love is properly stalwart as the regimental major, whilst Eduardo Ciannelli is Evil Incarnate as the Thuggee guru. The rest of the cast, Joan Fontaine, Robert Coote, Lumsden Hare, are effective but have little to do. Movie mavens will recognize Cecil Kellaway in the tiny role of Miss Fontaine's father.<br \/><br \/>The film picks its villains well. The demonic Thuggee cult, worshipers of the hideous, blood-soaked Kali, Hindu goddess of destruction, was the bane of Indian life for 6 centuries, ritualistically strangling up to 30,000 victims a year. In 1840 the British military, in cooperation with a number of princely states, succeeded in ultimately suppressing the religion. Henceforth it would remain the stuff of novels & nightmares."}
{"label":1,"sentence":"I actually didn't start watching the show until it came on FX. I was bored and had nothing to watch and saw that the show's reruns were premiering so i decided to watch it. I was so upset that I had not watched the show when it first aired on t.v. I loved the show so much!Finally a show for everyone to enjoy. I remember Full House and Family Matters and Step by Step and they were okay shows but just not funny enough. They would make dumb jokes and laugh over things that were just plain stupid, but not That 70s Show. That 70s Show was hilarious, smart and so real. I think it was the best show ever made and I'm very sorry that it ended. Although I love this show, I do think it should have ended on the seventh season when Eric and Kelso leave. The last season was just not right, Eric was the main character and the show should have ended when his character leaves. I still love this show and I hope TV starts making more shows like this one."}
{"label":1,"sentence":"I went into this expecting not to like it; I figured it would be terribly worthy and earnest, and rather plodding and dull.<br \/><br \/>It's actually far better than that, and I found myself really enjoying it. I don't know too much about Queen Victoria beyond what most know - married to Albert, who died young, and she mourned him ever after. Seeing the circumstances she grew up under was fascinating; in fact I found myself wishing I'd seen more of the story, and I imagine we may see a sequel at some point.<br \/><br \/>Visually the film is stunning. The sets and costumes are incredibly lavish without being too gaudy and over the top. The acting is top notch from everybody involved.<br \/><br \/>In a word, it was great!"}
{"label":1,"sentence":"'The Italian' is among the great or near-great films of 1915 that are available today. The year was a turning point for the feature-length film, especially in America: Lois Weber's 'Hypocrites', Cecil B. DeMille's 'The Cheat' and, of course, D.W. Griffith's 'The Birth of a Nation' set new benchmarks for the art. Additionally, that year, Russian filmmaker Yevgeni Bauer made two of his best pictures, 'After Death' and 'Daydreams'. The French serial 'Les Vampires' also has its admirers today, although I disagree with them. The emergence of the feature-length film was led by Europe, mainly Denmark, France and Italy, but dominance of this market and, to a degree, the art shifted to across the Atlantic in 1915.<br \/><br \/>The most overriding artistic achievement of 'The Italian' is its stunning and often innovative cinematography. There are some picturesque sunsets, mobile framing, including a brief overhead angled shot of the Italian racing to buy a wedding ring and another shot of him holding onto a moving car, and, in general, there is wise use of varied camera angles and expert lighting throughout. An especially amazing shot is a close-up of the Italian enraged as he slowly approaches the camera for an extreme close-up, in reference to D.W. Griffith's 'Musketeers of Pig Alley' (1912). He's so enraged his environment even begins to shake around his anger.<br \/><br \/>Unfortunately, the cinematographer appears to be unknown. The director, although originally without credit in the film, is now known to have been Reginald Barker. Five or so of his other films made for Ince are also available today, but are rather unremarkable. 'Civilization' (1916), which he worked on, was a large production, but a deeply flawed movie. By the way, I'd guess that one or more of the various cinematographers who worked on 'Civilization' also photographed 'The Italian'.<br \/><br \/>Moreover, the entire production is very advanced for then. Venice and New York are well rendered despite the film being shot in Los Angeles (for romanticized Venice) and San Francisco (for the ethnic slums of New York). There are extensive flashbacks, although perhaps one or two too many. I especially like the clever framing of the narrative as being read in a book by a character played by the same actor, George Beban, who is also the lead in the inner, main narrative. The reading of the story is further briefly framed by the opening at the beginning and closing at the end of curtain drapes, à la the theatre, which is reflected within the inner story during the revenge climax in the child's room, with the opening and closing of window curtains. Parallel editing, in-camera dissolves and irises and such are handled expertly. Additionally, Beban and Clara Williams, as his wife, play their parts well.<br \/><br \/>On the other hand, 'The Italian' does have a few drawbacks. The film's early moments of comedy clash rather disharmoniously with the latter parts of harsh and heavy melodrama, although the environmental changes from romanticized Italy to naturalistic New York works well\u0097mostly because it's supported by the lighting and photography. The harsh dissolution of the American dream in this film, enhanced by the stark photography, must have been poignant to the immigrant classes who comprised a disproportionately large population of the movie-going public back then. The Corrigan character should have been foreshadowed more; his brief introduction campaigning for another politician seems inadequate for his later centrality to the Italian's revenge. In addition, the filmmakers were either medically naïf or careless to not explain the lack of breastfeeding of the infant and the unwarranted faith in the healing powers of quietness for the other child. Aside from the deficiencies in plot, 'The Italian' is exceptionally well made."}
