{"label":0,"sentence":"Iran: Problems With EU Countries In Nuclear Talks 6 November 2004 -- An Iranian negotiator says some problems remain at talks with Britain, France, and Germany on resolving a dispute over Iran #39;s nuclear program but that he still hopes an understanding can be reached."}
{"label":0,"sentence":"Judge in London gives okay to let premature baby die LONDON : Doctors caring for a critically-ill premature baby, Charlotte Wyatt, were given permission by a British judge to allow her to die if her condition seriously deteriorates and her breathing stops."}
{"label":0,"sentence":"Karzai Sworn in as Afghanistan's President  KABUL (Reuters) - Hamid Karzai was sworn in as  Afghanistan's first popularly elected president Tuesday,  promising to bring peace to the war-torn nation and end the  economy's dependence on narcotics."}
{"label":0,"sentence":"Apec ministers urge new effort on trade talks SANTIAGO, Chile - Pacific Rim trading nations said today they should pool their influence to breathe new life into talks to free up world trade."}
{"label":0,"sentence":"Strong Quake Kills at Least 3 in Northern Japan An earthquake with a preliminary magnitude of 6.8 and several aftershocks hit northern Japan on Saturday, killing at least three people and injuring more than 250 while knocking "}
{"label":0,"sentence":"Deutsche Telekom sells remaining 7.3 pct stake in SES Global (AFP) AFP - Deutsche Telekom said it had sold its remaining 7.3 percent stake in SES Global, the world's leading satellite operator, for approximately 345 million euros (449.5 million dollars)."}
{"label":0,"sentence":"Summary: Cuba Frees Three Dissidents (AP) AP - THE FREED: Cuba unexpectedly releases for health reasons three political dissidents: economics writer Oscar Espinosa Chepe, who has a liver ailment, Marcelo Lopez, who has a neurological disorder, and Margarito Broche, who suffered a heart attack in prison."}
{"label":0,"sentence":"Kerry Ties Hurt Some Democratic Senators (AP) AP - Senate Democratic leader Tom Daschle hugged President Bush from one end of South Dakota to the other this summer  #151; in his own campaign commercials."}
{"label":0,"sentence":"Pinochet is stripped of immunity by court The Supreme Court of Chile yesterday stripped Augusto Pinochet, the country #39;s former military dictator, of his immunity from prosecution - opening the way for him to be charged with human "}
{"label":0,"sentence":"Baghdad Rocket Attack Kills Two US Soldiers Two American soldiers were killed and five injured Monday in a rocket attack in Baghdad. The military said the incident occurred in the southern part of the city but provided no other details."}
{"label":0,"sentence":"Europes big three gives Iran last chance to come clean on &lt;b&gt;...&lt;\/b&gt; VIENNA - Europes three main states were Thursday to give Iran a last chance to reassure the world it is not secretly developing atomic weapons, offering valuable nuclear technology as a carrot and possible UN sanctions as the stick."}
{"label":0,"sentence":"Iraq Probes Possible Security Breach Over Killings  BAGHDAD (Reuters) - Iraq ordered an investigation on Monday  into whether a security breach triggered a massacre of 49 army  recruits, while two foreign soldiers, an Estonian and an  American, were killed in surging guerrilla raids during  Ramadan."}
{"label":0,"sentence":"Sri Lanka urged to offer more support to rebel go-between Sri Lanka #39;s main foreign donors warn some members of the country #39;s ruling coalition are undermining the shaky peace process aimed at ending the decades-long civil war."}
{"label":0,"sentence":"Italian Govt. Tries to Assure Country Over Hostages  ROME (Reuters) - Italy's government tried to reassure an  anguished nation Thursday that two women hostages in Iraq were  most likely still alive, saying an Islamist group's claim to  have killed them was \"unreliable.\""}
{"label":0,"sentence":"Palestinian Blamed for Twin Sinai Attacks Pictures distributed by Egyptian interior ministery Monday Oct 15 2004 showing from left to right, Palestinian refugee born Ayad Said Saleh, Egyptian Sinai Bedouins Suleiman Ahmed Saleh Flayfil , his brother Mohamed Ahmed Saleh Flayfil and Hammad Gaman "}
{"label":0,"sentence":"Bush Sees Great Chance For Creating Palestinian State Mr. Bush told reporters Friday after meeting with British Prime Minister Tony Blair that he sees a great chance for creating a Palestinian state in the aftermath of the death of longtime Palestinian leader Yasser Arafat."}
{"label":1,"sentence":"UNLV names Utah #39;s Sanford as head coach Calling UNLV  quot;a gold mine, quot; Mike Sanford took over as coach of the Runnin #39; Rebels on Monday after two years as offensive coordinator at high-scoring Utah."}
{"label":1,"sentence":"NASCAR Contenders Aim to Avoid Mistakes (AP) AP - No more mulligans. When Nextel Cup leader Kurt Busch was hit by engine failure at Atlanta Motor Speedway and finished 42nd last Sunday, the mishap tightened NASCAR's new 10-race championship format. It also meant each of the 10 drivers in the title chase has had at least one finish of 30th or worse in the first seven events."}
{"label":1,"sentence":"Lonard wins Australian PGA Championship COOLUM, Australia - Australian Peter Lonard won the Australian PGA Championship by two strokes for his third tournament title in as many weeks on Sunday."}
{"label":1,"sentence":"Savastano's stellar soccer season interrupted by knee injury It was a bittersweet soccer season for Jocelyn Savastano. The former Plymouth North star and Globe All-Scholastic set school, conference, and national records in the first seven games for Saint Anselm College in Manchester, N.H."}
{"label":1,"sentence":"Kuznetsova beats injured Davenport, becomes first Russian woman to &lt;b&gt;...&lt;\/b&gt; Lindsay Davenport hobbled her way out of the US Open, losing a big lead and able to do little but watch Svetlana Kuznetsova win 1-6, 6-2, 6-4 and become the first Russian woman to reach the final at this tournament."}
{"label":1,"sentence":"Willingham firing a winning thing Notre Dame was fortunate to have a man like Tyrone Willingham at the helm. He #39;s a class act and a quality person. The young men who played for him have benefited from his leadership and example."}
{"label":1,"sentence":"Interlagos: Williams top first practice Friday morning usually sees the third cars star  but today, Juan Pablo Montoya took top spot."}
{"label":1,"sentence":"UAE #39;s TEN Sports to Produce Australia-India Cricket Test Series TV &lt;b&gt;...&lt;\/b&gt; The Board of Control for Cricket in India has granted the television production and distribution rights for Australia #39;s test series with India even as the Indian Supreme Court hears arguments over who owns the rights."}
{"label":1,"sentence":"Vince Carter traded to Nets The New Jersey Nets have acquired five-time NBA All-Star guard\/forward Vince Carter from the Toronto Raptors in exchange for center Alonzo Mourning, center\/forward Aaron Williams, forward Eric Williams and two first round draft picks, Nets President Rod "}
{"label":1,"sentence":"Another Recovery As the 16th-ranked Cavaliers prepare for Saturday's season opener at Temple, inside linebacker Rich Bedesem is healthy again after tearing the ACL in his right knee -- again."}
{"label":1,"sentence":"Seattle burned again by fourth-quarter collapse Seattle #39;s young defense hasn #39;t been the same since collapsing in the fourth quarter of an October loss to St. Louis. For good measure, the Seahawks did it again against the Dallas Cowboys."}
{"label":1,"sentence":"Weight of drugs felt Weightlifting #39;s aggressive pursuit of drug cheaters will continue even if it jeopardizes its future in the Olympics, its top official said yesterday following six more positive doping cases in what is again becoming the Games #39; dirtiest sport. Five ..."}
{"label":1,"sentence":"Bernard Hopkins Leaves Calling Card  Stops De La Hoya in Ninth Just four months shy of his 40th birthday, Hopkinswho appeared to be starting to wear De La Hoya down as the fight neared the championship roundsclosed the show with a lethal body shot in the 9th."}
{"label":1,"sentence":"India off to flying start against SA Kanpur: Openers Virender Sehwag and Gautam Gambhir struck half-centuries as India reached 185 without loss at stumps in reply to South Africa #39;s giant 510 first-innings score in first Test on Monday."}
{"label":1,"sentence":"Some tolling thoughts You don #39;t really believe Pedro Martinez is going to pitch for the Yankees, do you? Don #39;t forget about Pedro #39;s working hours on his non-pitching days."}
{"label":1,"sentence":"Eagles Reward Reid with Four-Year Extension  PHILADELPHIA (Sports Network) - The Philadelphia Eagles  locked up their most successful head coach in franchise history  Wednesday, signing Andy Reid to a four-year contract extension."}
{"label":2,"sentence":"Amar Singh urges Kokila Behn to resolve RIL issue Samajwadi Party leader Amar Singh has appealed to Dhirubhai Ambani #39;s widow Kokilabehn to settle the differences between her sons Mukesh Ambani and Anil Ambani who run India #39;s largest private sector company."}
{"label":2,"sentence":"US Air, Pilots to Reopen Concession Talks US Airways Group Inc. (UAIR.O: Quote, Profile, Research) and its pilots union agreed late on Friday to reopen concession talks after leaders of the labor group declined "}
{"label":2,"sentence":"Time Warner, Sony Still Courting MGM Industry talk over the potential sale of Metro-Goldwyn-Mayer might have subsided in recent weeks. But despite summer vacation season, Time Warner Inc."}
{"label":2,"sentence":"At IMF, US bows to pressure to forgive debt WASHINGTON With public pledges and in private conversations, Britain managed to smoke out the United States and win its commitment to the full forgiveness of the debts of the poorest countries during the annual meetings of the World Bank and the "}
{"label":2,"sentence":"Tivo, Netflix star in double feature Two Silicon Valley companies that have already become household names in tech savvy homes are working together to bring movies to the home digitally."}
{"label":2,"sentence":"Export earnings weigh on Nikkei Tokyo #39;s Nikkei average slipped 0.85 percent to finish at a three-week closing low on Thursday as a fall in the dollar further weakened investors #39; confidence in company earnings, prompting selling of exporters such as Honda Motor."}
{"label":2,"sentence":"Europe #39;s Trichet Blasts Low Dollar, Hedges on Intervention European Central Bank president Jean-Claude Trichet today repeated that the euro #39;s rise against the dollar is unwelcome and said intervention in foreign exchange markets  quot;is a weapon quot; that is available to central banks."}
{"label":2,"sentence":"Viacom Posts a Loss on Charges  NEW YORK (Reuters) - Viacom Inc. &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=VIAb.N target=\/stocks\/quickinfo\/fullquote\"&gt;VIAb.N&lt;\/A&gt;&lt;VIA.N&gt; on  Thursday posted a quarterly loss on charges related to the  spinoff of video rental chain Blockbuster Inc.&lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=BBI.N target=\/stocks\/quickinfo\/fullquote\"&gt;BBI.N&lt;\/A&gt;, but  cable network advertising sales and profits rose strongly."}
{"label":2,"sentence":"EU warns Italy on Alitalia stake The Italian state must give up its majority stake in troubled Alitalia when the airline sells new shares, the EU warns."}
{"label":2,"sentence":"Banknorth deal good for consumers, analyst says Canadian control of Banknorth Group Inc. is likely to be good for consumers on this side of the border, an analyst said yesterday after confirmation that TD Bank Financial Group is to become majority shareholder in Banknorth Group Inc."}
{"label":2,"sentence":"Nortel trims layoff plan Telecommunications equipment maker Nortel Networks will not lay off as many employees as it previously predicted, the company said Thursday."}
{"label":2,"sentence":"Custom-made-- in China Custom-designed imported furniture was once an exclusive realm. Now, it's the economical alternative for commercial developers and designers needing everything from seats to beds to desks for their projects."}
{"label":2,"sentence":"UC settles one Enron suit Bee Staff Writer. The University of California, negotiating on behalf of Enron Corp. investors, reached a \\$222.5 million settlement Friday with the Lehman Brothers brokerage firm over its part in the multibillion-dollar Enron debacle."}
{"label":2,"sentence":"ONGC #39;s 10th acquisition abroad Public sector behemoth Oil and Natural Gas Corporation Ltd on Monday said it has acquired an offshore oil field in Western Australia."}
{"label":2,"sentence":"51-49 stakes seen in \\$36 billion plan; rival bid could surface Although a Sprint-Nextel combination is being characterized as a \\$36 billion merger of equals, published reports describe the emerging transaction as a purchase by Sprint."}
{"label":2,"sentence":"Wal-Mart Sales Estimate Boosts Sector  NEW YORK (Reuters) - Wal-Mart Stores Inc. &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=WMT.N target=\/stocks\/quickinfo\/fullquote\"&gt;WMT.N&lt;\/A&gt;, the  world's No. 1 retailer, on Monday said December sales would be  at the top end of its prior estimate on better-than-expected  post-Christmas spending, driving its shares up 2 percent."}
{"label":3,"sentence":"Intel Gives Centrino a Speed Boost the Pentium M 765 -- runs at a speed of 2.1 GHz and has 2 MB of cache. The Pentium M 765 also features Enhanced Intel Speedstep, designed to optimize application "}
{"label":3,"sentence":"RealNetworks Sells Three Million Songs Through Promotion RealNetworks Inc. on Thursday said the three-week cut-rate promotion on its online music store garnered sales of more than 3 million songs."}
{"label":3,"sentence":"Ramjet aims at record Mach 10 speed NASA will attempt to set the world speed record for an air-intake engine tomorrow. The X-43A Hyper-X is a supersonic ramjet that may lead to more efficient launch vehicles and missiles in the future."}
{"label":3,"sentence":"IBM Tops IT Loyalty Survey NEW YORK - These days, technology providers take nothing for granted, especially their customers: There are plenty of stories of providers going to extraordinary lengths to win and keep customers."}
{"label":3,"sentence":"Google rumoured to be planning Internet Explorer rival LONDON - Google could be planning to launch a web browser to challenge the dominance of Microsoft #39;s Internet Explorer, according to widespread industry speculation."}
{"label":3,"sentence":"2004 fourth hottest since records began The year 2004 was the fourth hottest ever recorded and the past decade was the warmest since measurements began in 1861, the World Meteorological Organisation said Wednesday."}
{"label":3,"sentence":"Oceans to Rise One Meter by 2100-Arctic Expert Global warming (news - web sites) is melting the Arctic ice faster than expected, and the world #39;s oceans could rise by about a meter (3 feet "}
{"label":3,"sentence":"Kanoodle and TypePad \/ Movable Type Partner for Sponsored Blogs Kanoodle and TypePad \/ Movable Type Partner for Sponsored Blogs\\\\Kanoodle, sponsored listings provider, and Six Apart, the maker of Movable Type and TypePad blog software, today announced that the companies will offer TypePad subscribers the ability to easily add Kanoodle's content-targeted sponsored links to their sites.  This marks the ..."}
{"label":3,"sentence":"WebMethods names new CEO, chairman The company promotes from within--Chief Operating Officer David Mitchell is appointed CEO."}
{"label":3,"sentence":"Microsoft offers insurance Linux can #39;t, Ballmer says An e-mail Microsoft Chief Executive Steve Ballmer sent to customers around the world yesterday highlighted a new thrust in Microsoft #39;s campaign against Linux."}
{"label":3,"sentence":"Novell files additional lawsuit against Microsoft Less than a week after collecting a \\$536 million settlement from Microsoft, Novell filed another lawsuit, as expected, accusing the software giant of violating antitrust laws."}
{"label":3,"sentence":"Regaining Fury, Hurricane Ivan Churns Toward Cuba Hurricane Ivan will pass near or over the western tip of Cuba today. The powerful Category Five storm, which has already claimed 65 lives, will bring devastating winds and a potential storm surge of 20 feet (6 meters) or more."}
{"label":3,"sentence":"Intel programming tools reach new 64-bit chips They let developers create software that supports 64-bit x86 chips--important in making the new generation of chips useful."}
{"label":3,"sentence":"Infineon execs get to serve time over price-fixing Four senior executives of German chipmaker Infineon Technologies will serve jail time and pay steep fines for their role in a scheme to fix prices in the memory chip market, said the US Department of Justice."}
{"label":3,"sentence":"Conway's golden handshake PeopleSoft's ousted CEO walks away with a severance package in excess of \\$16 million."}
{"label":3,"sentence":"SpaceShipOne rockets in NEW ERA A red, white and blue rocket plane zoomed into space Monday, winning a \\$10 million prize as the world #39;s first privately built reusable spacecraft and heralding the future of commercial space travel."}
