{"label":0,"sentence":"Tokyo Stocks Higher in Early Trading (AP) AP - Tokyo's benchmark stock index was higher Thursday morning as investors bought stock futures in a technical bounce, but trade was largely directionless after Wall Street's mixed performance. The dollar was slightly higher against the Japanese yen."}
{"label":0,"sentence":"Iran Converts Uranium in Defiance of UN  By Francois Murphy VIENNA (Reuters) - Iran defied the  United Nations on Tuesday by announcing it has begun converting  a large amount of raw uranium to prepare it for enrichment, a  process that can be used to develop atomic bombs."}
{"label":0,"sentence":"Italian women kidnapped in raid on relief agency BAGHDADGunmen kidnapped two Italian women working for an aid agency and two Iraqis in broad daylight in central Baghdad yesterday."}
{"label":0,"sentence":"Afghanistan #39;s Karzai in Pakistan for terror talks Afghan President Hamid Karzai began a visit to neighbouring Pakistan on Monday to discuss cooperation in the battle against Islamic militants ahead of his October re-election bid."}
{"label":0,"sentence":"For Young Armenians, a Promised Land Without Promise An independent Armenia has proved too constricting and its promise too distant for the next generation's ambitions."}
{"label":0,"sentence":"House Leadership Blocks Vote on Intelligence Bill A core of highly conservative Republicans aligned with the Pentagon moved to block a vote on a bill that would have enacted the recommendations of the 9\/11 panel."}
{"label":0,"sentence":"Barroso 'backs down' on EU vote The incoming EU Commission president is to call for a delay in a crucial vote on his new team, reports say."}
{"label":0,"sentence":"Mbeki in Ivory Coast rebel town on peace mission President Thabo Mbeki took his peace mission to Ivory Coast #39;s rebel-held stronghold of Bouake today, where he was greeted by hundreds of people demanding Laurent Gbagbo, the president, quit."}
{"label":0,"sentence":"Testimony Opens in 9\/11 Retrial Case (AP) AP - A witness who knew the Hamburg-based Sept. 11 hijackers outlined the group's hatred of Israel and said its members believed suicide attacks were legitimate as testimony opened Tuesday in the retrial of a Moroccan accused of helping the pilots."}
{"label":0,"sentence":"Israeli violence continues in Gaza, 4 Palestinians killed Israeli occupation forces killed four Palestinian fighters in Gaza Strip early Monday, saying that two of them were trying to cross the fenced border from the territory in a rare case of its kind, military sources said."}
{"label":0,"sentence":"Addressing UN Assembly, Annan urges nations to restore respect for &lt;b&gt;...&lt;\/b&gt; Decrying what he described as  quot;shameless quot; disregard for the rule of law around the globe, United Nations Secretary-General Kofi Annan yesterday urged world leaders gathered at the General Assembly to do everything within their power to restore respect for "}
{"label":0,"sentence":"Cuban President Fidel Castro Honors Hugo Chavez Havana, Dec 14 (AIN) Cuban President Fidel Castro awarded visiting Venezuelan Head of State Hugo Chavez with the Carlos Manuel de Cespedes Order at a rally marking the 10th anniversary of Chavez #39; first visit to Cuba."}
{"label":0,"sentence":"Bush to Meet With Leaders of Mexico, Chile President Bush aims to dispel the perception of U.S. neglect of Latin America and burnish an American reputation damaged by the Iraq war, undertaking a second-term diplomatic offensive in the region akin to his recent courting of Europe."}
{"label":0,"sentence":"Routine operation but more evidence of heart trouble Tony Blair will undergo a catheter ablation operation which will correct his heart #39;s abnormal rhythm - a condition the Prime Minister has suffered from in the past."}
{"label":0,"sentence":"Strong Quake Shakes Northern Japan, Felt in Tokyo  TOKYO (Reuters) - An earthquake with a preliminary  magnitude of 5.6 shook northern Japan on Monday in the same  area where the country's deadliest quake in nine years killed  23 people and injured more than 2,000 two days ago, media  reported."}
{"label":0,"sentence":"Karzai Win Assured as Afghan Poll Count Winds Up  KABUL (Reuters) - Afghan President Hamid Karzai is sure of  victory in his country's historic presidential poll, but the  result will not be announced for a day or so until the last few  ballot boxes are counted, an official said Monday."}
{"label":0,"sentence":"Queen opens climate summit The Queen is to open a conference on climate change today during her state visit to Germany. The gathering, held at the British embassy in Berlin, will make recommendations on climate change to Prime Minister Tony Blair."}
{"label":0,"sentence":"Pope Returns  quot;rare icon quot; to Russia #39;s Orthodox Church MOSCOW, RUSSIA (ANS\/BosNewsLife) -- A Vatican cardinal has handed a rare icon back to the Russian Orthodox Church in Moscow as a personal gift from Pope John Paul II, the British Broadcasting Corporation (BBC) reported Saturday, August 28."}
{"label":0,"sentence":"Joy in Italy as hostages freed : Two Italian women aid workers and their two Iraqi colleagues abducted in Baghdad have been freed after difficult negotiations, Prime Minister Silvio Berlusconi told a delighted parliament today."}
{"label":0,"sentence":"Syrian Troop Redeployment Said Meaningless Israeli Prime Minister Ariel Sharon reacted skeptically on Wednesday to a redeployment of Syrian troops in Lebanon, saying that the move did not mean any real change in Syrian policy."}
{"label":0,"sentence":"Thornton Gets Star on Hollywood Walk LOS ANGELES - Billy Bob Thornton got a star on Hollywood's Walk of Fame Thursday - as well on a special greeting on the pages of Variety from ex-wife Angelina Jolie.   \"Billy, I love your brilliant mind..."}
{"label":0,"sentence":"FDA Eyes Rules on Child Anti-Depressants WASHINGTON - Federal health advisers considering more stringent warning labels for anti-depressants linked to suicidal thoughts among children were told on Tuesday that a new warning added in March appeared to have little impact on children's use of the drugs.    Children aged 1 to 17 still account for 7 percent of anti-depressants prescribed, said Michael Evans of the Food and Drug Administration's Office of Drug Safety..."}
{"label":0,"sentence":"Police Patrol Najaf, Workers Clear Rubble (AP) AP - The crash of explosions and crackle of gunfire that have torn through Najaf for weeks gave way Saturday to the clangs of shovels clearing the destruction and the wail of police sirens announcing the return of government control to the devastated holy city."}
{"label":0,"sentence":"Peace Talks for Sudan #39;s Darfur Collapse Sudan #39;s rebels and government broke off internationally brokered peace talks for the bloodied Darfur region Wednesday after three weeks with little progress and no deal."}
{"label":0,"sentence":"Car Bomb Targeting Iraqi Police Kills 10 A car bomb targeting police exploded on a crowded Baghdad street Wednesday, killing at least 10 people and wounding 15 others, police said."}
{"label":0,"sentence":"Egypt Signs Trade Deal With Israel, U.S. (AP) AP - Egypt wants jobs. Israel wants a meaningful peace. And the nations plan to sign an agreement that they hope will fulfill both their goals."}
{"label":0,"sentence":"Crisis talks in Paris as concerns grow for kidnapped French &lt;b&gt;...&lt;\/b&gt; PARIS (AFP) -- As hopes dimmed that two French journalists held captive in Iraq would be freed soon, French President Jacques Chirac was to discuss the crisis Sunday with his foreign minister, who returned from a mission to the Middle East with no news of "}
{"label":0,"sentence":"Iraq Government Won't Postpone Elections (AP) AP - The Iraqi government brushed aside Sunni Muslim demands to delay the Jan. 30 election, and a spokesman for the majority Shiite community called the date \"nonnegotiable.\" Insurgents stepped up attacks, blasting U.S. patrols in Baghdad and killing a U.S. soldier north of the capital."}
{"label":0,"sentence":"Ballots Pour Into Afghan Counting Centers KABUL, Afghanistan - Ballot boxes poured into counting centers Monday for a tally of the troubled presidential election in Afghanistan amid signs an opposition boycott was wavering after at least two candidates agreed to accept the ruling of an independent panel's inquiry.    Election organizers hope their decision, announced late Sunday, to establish a panel of about three foreign election experts to investigate the balloting will end the boycott, which many fear could seriously undermine the winner's ability to rule this war-ravaged nation..."}
{"label":0,"sentence":"Polls point to Howard victory Australians vote in less than 24 hours to choose a new government with most key pointers suggesting the incumbent conservative coalition of Prime Minister John Howard will be returned."}
{"label":0,"sentence":"Henman Crushes Coria to Keep Masters Hopes Alive &lt;p&gt;&lt;\/p&gt;&lt;p&gt; By Steve Keating&lt;\/p&gt;&lt;p&gt; HOUSTON (Reuters) - Britain's Tim Henman pounded ArgentineGuillermo Coria 6-2, 6-2 Thursday to keep alive his hopes ofreaching the Masters Cup semi-finals.&lt;\/p&gt;"}
{"label":0,"sentence":"Al-Qaida Aims to Disrupt Afghan Elections KABUL, Afghanistan - U.S.-led forces trying to protect landmark Afghan elections face a rising wave of violence from about 2,000 insurgents, including al-Qaida militants slipping in from Pakistan, an American general said Saturday.    In the latest bloodshed, Afghan police said suspected Taliban gunmen killed nine militia soldiers in two attacks on checkpoints in a troubled southern province..."}
{"label":1,"sentence":"Freshman Sparkles as Notre Dame Rebounds Freshman Darius Walker had two fourth-quarter touchdowns and the Fighting Irish renewed hope for a turnaround season by upsetting the eighth-ranked Wolverines."}
{"label":1,"sentence":"PSV on verge of breaking losing Euro streak PSV Eindhoven look likely to break a run of eight previous failures to reach the knockout phase of the Champions League after their 1-0 win over Norwegians Rosenborg on Tuesday."}
{"label":1,"sentence":"Sky #39;s the limit when it comes to Sox spending If you want to get a rise out of a small-market general manager, ask him about the Red Sox being limited by their budget. Already this weekend at the winter meetings, we #39;ve "}
{"label":1,"sentence":"Gannon Out 6 Weeks Oakland quarterback Rich Gannon has a broken vertebrae in his neck that will sideline him at least six weeks."}
{"label":1,"sentence":"Rogge steps up pressure over Jones drugs claims Marion Jones was under growing pressure last night after the International Olympic Committee president Jacques Rogge set up an investigation into allegations she used banned performance-enhancing drugs."}
{"label":1,"sentence":"Rangers held by Inverness Inverness, Scotland (Sports Network) - Rangers squandered a chance to return to the top of the table Sunday as it was held at Inverness, 1-1."}
{"label":1,"sentence":"Phils fire Bowa PHILADELPHIA - Larry Bowa took the job as Phillies manager facing rows of cameras and scores of reporters. He said goodbye to the job Saturday with a quiet, lonesome walk in the bowels of Citizens Bank Park to his car."}
{"label":1,"sentence":"This is how its done Navy beat Army by two years yesterday, tying the rivalry at an almost-poetic 49-49-7. For while the Midshipmen hired their reparative coach fully three Decembers ago, the "}
{"label":1,"sentence":"Offensive balance eludes Cats Even-mannered and analytical possibly to a fault, the word just fits Bill Snyder. It #39;s more than just Snyder #39;s goal for the Kansas State offense."}
{"label":1,"sentence":"England 2, Wales 0 AFTER having waited 20 years to renew rivalries with their nearest neighbour, Wales are now probably hoping they could have a similar wait for the next encounter."}
{"label":1,"sentence":"Auburn Defeats Virginia Tech in Sugar Bowl  NEW ORLEANS (Sports Network) - Jason Campbell passed for  195 yards and a touchdown, Auburn's defense solidified its  status as one of the nation's toughest, and the third-ranked  Tigers completed the first perfect season in school history  with a 16-13 victory over No. 9 Virginia Tech in the Sugar  Bowl."}
{"label":1,"sentence":"Rangers seek Champions League riches against CSKA Moscow Rangers can reduce their grim 68 million pound (\\$123 million) debt by beating CSKA Moscow in Wednesday #39;s final Champions League qualifier but manager Alex McLeish "}
{"label":1,"sentence":"No predicting a men #39;s winner Picking the men #39;s winner of the US Open, which will begin today in Flushing Meadows, NY, is no sure thing, based on what happened at the year #39;s two previous Grand Slam events."}
{"label":1,"sentence":"Ricky wants to play again He inquires about a return to the NFL but it #39;s doubtful he will play for Miami. DAVIE - After traveling the world, Ricky Williams has decided he would like to play football again."}
{"label":1,"sentence":"Twins #39; young guns impress The notion that young people should be seen, and not heard, has never caught on within the Twins organization. Not in Spring Training."}
{"label":1,"sentence":"Late surge lifts Sonics This is the 10th game, after all, and their start had nothing to do with their 101-94 victory over the Raptors in Toronto last night at Air Canada Centre."}
{"label":1,"sentence":"Jump into different world is plunge into abyss FOR those who hoped that the ego had landed after the 2003 Rugby World Cup success, the news that he is resigning from his post as England coach to aim for Sven-Goran Erikssons job in football has the foreboding of an embarrassing new chapter for Sir "}
{"label":1,"sentence":"Eagles lead Vikings at halftime Donovan McNabb #39;s 11-yard touchdown pass to LJ Smith helped the Philadelphia Eagles take a 10-6 lead over the Minnesota Vikings at halftime on Monday night."}
{"label":1,"sentence":"Bullpen gets two new arms In a week that featured the breakdown of trade talks involving Randy Johnson and Jason Giambi #39;s steroid admission, trades for Felix Rodriguez and Mike Stanton sure seem trivial."}
{"label":1,"sentence":"Soccer: The season to forget teams and reward stars There are probably turkeys with a shrewder idea about the meaning of Christmas than there are ex-professional soccer players who truly know their game."}
{"label":1,"sentence":"College Basketball Wrap: Washington Beats Loyola-Marymount  LOS ANGELES (Sports Network) - Nate Robinson scored a  game-high 28 points to lead 16th-ranked Washington to a 100-93  win over Loyola-Marymount at Gersten Pavilion."}
{"label":1,"sentence":"McDyess plans to face the Knicks Despite spending more than a year-and-a-half as a Knick, McDyess managed played only 18 games last season after sitting out the entire 2002-03 season with knee injuries."}
{"label":1,"sentence":"Trojans Hang On to Spoil Stellar Day for Cal Quarterback Aaron Rodgers tied an N.C.A.A. record by completing 23 consecutive passes, but he watched his last three attempts sail off target in the final minute."}
{"label":1,"sentence":"Isringhausen has hip surgery, should be ready for spring training Cardinals closer Jason Isringhausen had successful surgery on his left hip Monday and should be fully recovered in time for spring training."}
{"label":1,"sentence":"Kim fires 62 to take first-round lead SPRINGFIELD (Illinois): Christina Kim celebrated her parents silver wedding anniversary by firing a 62, matching her career best, here Thursday to take the first-round lead in the \\$1."}
{"label":1,"sentence":"Sacked Chelsea striker Mutu banned 7 months November 5, 2004. Chelsea striker Adrian Mutu has been suspended for seven months and fined 20,000 following an FA disciplinary hearing into his failed drugs test."}
{"label":1,"sentence":"Out for 7 months FORMER Chelsea striker Adrian Mutu was banned seven months and fined 20,000 (\\$61,000) by the Football Association yesterday for failing a drugs test."}
{"label":1,"sentence":"Victory for Barrichello The Brazilian, who took pole position yesterday with Formula Ones fastest-ever qualifying lap, beat Ferrari team-mate Schumacher by 1.3 seconds to the delight of thousands of their passionate home fans."}
{"label":1,"sentence":"Clemens ready to step to fore At 42, Roger Clemens is ready to pitch on three days #39; rest with a chance to make postseason history for the Houston Astros. After all, playing in the postseason with "}
{"label":1,"sentence":"Benitez Wont Blame Dudek Liverpool manager Rafael Benitez was loyal to goalkeeper Jerky Dudek, refusing to blame his goalkeeper for the fumbled cross that enabled Portsmouth to snatch a last-gasp equaliser through Lomana LuaLuas header at Anfield on Tuesday night."}
{"label":1,"sentence":"No. 1 USC 31, Stanford 28 USC had another harrowing trip to the Bay Area. Thanks to their defense and their unstoppable tailback tandem, this one had a much happier ending."}
{"label":1,"sentence":"Falcons' Crumpler, Price Miss Practice (AP) AP - Alge Crumpler and Peerless Price joined an injury list that already included Warrick Dunn and Keith Brooking for the Atlanta Falcons."}
{"label":2,"sentence":"Regulator Says Fannie Mae Deliberately Flouted Rules Fannie Mae #39;s prime regulator said today that the giant mortgage company deliberately flouted accounting rules to project an image of smooth and relatively low-risk-earnings growth."}
{"label":2,"sentence":"Leading Indicators Decline in August A closely watched measure of future economic activity fell in August for a third consecutive month, reflecting an uncertain climate for both businesses and consumers."}
{"label":2,"sentence":"Caesars plans Wembley casino US casino giant Caesars plans to build a 335m gambling and leisure resort beside the new Wembley Stadium in London, its first foray into Europe."}
{"label":2,"sentence":"Russian Gas Monopoly to Bid for Prize Yukos Oil Assets In an attempt to create a state energy leviathan, the Russian natural gas monopoly Gazprom said today that it would bid for the prize oil assets of Yukos."}
{"label":2,"sentence":"Clear Channel Plays Rough in Motorcycling Battle Supercross is shaping up to be the latest battleground in the fight over media consolidation."}
{"label":2,"sentence":"Markets lower as falling price for oil and BMO earnings fail to &lt;b&gt;...&lt;\/b&gt; TORONTO (CP) - A strong profit report from the Bank of Montreal and a lower price for oil weren #39;t enough to spark buying interest as North American stock markets edged lower Tuesday."}
{"label":2,"sentence":"Banks pay price for money laundering THE fight against money laundering is costing banks and other financial institutions dear as they invest heavily in technology to combat crime, according to a survey by KPMG."}
{"label":2,"sentence":"BC lumber lobby says WTO ruling on Byrd Amendment helps softwood &lt;b&gt;...&lt;\/b&gt; VANCOUVER (CP) - A World Trade Organization ruling gives Canada needed clout to recover more than \\$3 billion in duties destined for US lumber producers, a Canadian lumber lobby says."}
{"label":2,"sentence":"Bank on course to freeze rates Experts expect the Bank of England to leave interest rates on hold at 4.75 on Thursday."}
{"label":2,"sentence":"Incentives Likely to Boost U.S. Car Sales (Reuters) Reuters - A month-end sales blitz of incentives\\by General Motors Corp.  and Ford Motor Co.  to\\clear out older vehicles will spur a slight rise in U.S. car\\and truck sales for September, analysts said."}
{"label":2,"sentence":"File-sharers win court case TWO FILE SHARING companies have been told by a court that they are not liable for people in their networks swapping illegal content. "}
{"label":2,"sentence":"Santander to sell up to 79 million RBS shares SPAINS Santander Central Hispano is to sell up to 79 million shares in Royal Bank of Scotland, and said it will end cross-directorships with RBS if its bid for Abbey National is successful."}
{"label":2,"sentence":"Oil prices rocket to new one-month highs after stocks plunge LONDON : World oil prices sprinted up to new one-month high points as traders showed alarm at a steep fall in US crude oil inventories in the wake of Hurricane Ivan."}
{"label":2,"sentence":"World oil prices hit record highs World oil prices scaled record peaks last night, rising on concern over disruptions to supply from strike-hit producers Nigeria and Norway."}
{"label":2,"sentence":"Travis Perkins to buy Wickes for 950m British building materials merchant Travis Perkins Plc said on Thursday it agreed to pay 950 million (\\$1.84 billion) for home-improvement chain Wickes, sending its shares down nearly 3 percent."}
{"label":2,"sentence":"BusinessWeek Chooses Outsider as Editor in Chief BusinessWeek, reaching outside its own ranks, announced yesterday that it had selected Stephen J. Adler, a senior editor of The Wall Street Journal, as its next editor in chief."}
{"label":2,"sentence":"Smithfield profits from protein-rich pork The flip side of low-carb dieting is high-protein eating, and that #39;s helping boost profits at Virginia #39;s Smithfield Foods, the world #39;s biggest pork producer."}
{"label":2,"sentence":"Financier #39;s bet on steel pays off big and the steel industry will never be the same because of it. Ross, the financier who in less than three years cobbled together his International "}
{"label":2,"sentence":"Producer prices post surprise August drop Producer prices dropped unexpectedly last month as energy price gains eased and the cost of food and vehicles fell, according to a government report on Friday that showed inflation pressures fading."}
{"label":2,"sentence":"Dell expands SMB desktop services Dell Inc. introduced on Monday a new suite of desktop support services for small and medium size businesses (SMBs) designed for companies with overstretched IT staffs."}
{"label":2,"sentence":"Mutual funds attract Fed governors #39; eyes Mutual funds aren #39;t just popular with the masses. They #39;re also investments of choice among the people who oversee the nation #39;s economy."}
{"label":2,"sentence":"Lockheed Profit Jumps on IT, Jet Demand (Reuters) Reuters - No. 1 U.S. defense contractor Lockheed\\Martin Corp.  reported a 41 percent rise in quarterly\\profit on Tuesday, beating Wall Street forecasts, as demand\\soared for its combat aircraft and information technology\\services."}
{"label":2,"sentence":"Jobless Claims Drop for 3rd Straight Week The number of Americans filing new claims for unemployment benefits edged down last week for a third consecutive time, signaling that the labor market may be improving after hitting a speed bump in June and July."}
{"label":2,"sentence":"WTO ruling on net gambling angers US The Bush administration dismissed as  quot;deeply flawed quot; a World Trade Organisation decision that the US has no right to ban cross-border gambling on the internet."}
{"label":2,"sentence":"US Air agents agree to pay, benefits cuts ARLINGTON, Va. - The union for 5,800 US Airways Group Inc. customer-service and reservation agents said it reached agreement on pay and benefit cuts the airline had sought to help emerge from bankruptcy."}
{"label":2,"sentence":"Treasury Yields Near Seven-Month Lows  NEW YORK (Reuters) - U.S. Treasuries rallied early Monday,  compressing yields to their lowest levels in nearly seven  months, as record high crude oil prices pressured equities and  threatened to be a drag on world economic growth."}
{"label":2,"sentence":"SEC may act against Ex-Lucent CEO Lucent Technologies Inc. said Monday that three of its former employees have been notified by the Securities and Exchange Commission that regulators are considering recommending civil action against them."}
{"label":2,"sentence":"Europe blesses Oracle-PeopleSoft union com October 26, 2004, 7:41 AM PT. This fourth priority #39;s main focus has been enterprise directories as organizations spawn projects around identity infrastructure."}
{"label":2,"sentence":"Calpine Prices Senior Secured Notes Calpine Corp. added more high-yield bonds to its debt load Tuesday after pricing a \\$785 million deal into the market. The company - which has been criticized by market analysts in the past because of its frequency "}
{"label":2,"sentence":"FAO Schwarz to Open on Thanksgiving in NY  NEW YORK (Reuters) - FAO Schwarz on Monday said it would  reopen its flagship toy store on New York City's Fifth Avenue  on Thursday."}
{"label":2,"sentence":"Redskins, Redmond,  amp; Red Ink What was Dan Snyder thinking? No, I #39;m not referring to the whole Steve Spurrier fiasco. This has nothing to do with his Washington Redskins team -- though one can argue that it #39;s a reasonably brisk jog between "}
{"label":2,"sentence":"The Value Advantage Come inside the value camp and cozy up to long-term results with a cushion of safety."}
{"label":3,"sentence":"Red Hat names new CFO Two months after announcing the resignation of its chief financial officer and six weeks after it changed the way it books support subscription revenue, Linux vendor Red Hat Inc. has named a new CFO."}
{"label":3,"sentence":"More Security Holes Found In Internet Explorer 6.0 Three more vulnerabilities in Microsoft #39;s Internet Explorer 6.0 browser were disclosed Wednesday by Danish security vendor Secunia, bringing the total of IE bugs found by the firm in the last two months to an even dozen."}
{"label":3,"sentence":"Is there a future for the 1Gig email services? We all remember April 1st when Google announced its new Gmail web-mail service with an overwhelming 1Gig storage space. Their mere announcement brought a new wave of 1Gig web-mail services such as Walla  , Spymac  and more. Since they don't charge for the service, their plan is to profit from advertisement revenue stream.  It's been 6 month now, and Gmail is still in beta stage and many competitors are joining the scene on an almost daily basis. "}
{"label":3,"sentence":"Two agencies may clash over rare bird Two US Interior Department agencies may clash over separate and apparently incompatible efforts to help the northern sage grouse. The Fish and Wildlife Service is trying to "}
{"label":3,"sentence":"Philly Broadband Clash Pits City Against Telcos (Reuters) Reuters - Philadelphia officials have laid the\\groundwork to provide wireless, high-speed Internet access\\anywhere in the city, but their plan could be scotched under a\\state bill that could be signed into law on Tuesday."}
{"label":3,"sentence":"Mozilla Firefox - setting the world on fire After a year in development, today is the day the Mozilla Foundation released their long awaited browser named Firefox officially launching version 1.0."}
{"label":3,"sentence":"Watchdogs: Broadband policy a bust Consumer advocate organizations say U.S is trailing in broadband and that inequality is increasing."}
{"label":3,"sentence":"PalmOne Updates Treo Phone with Display, Battery  NEW YORK (Reuters) - PalmOne Inc. &lt;A HREF=\"http:\/\/www.reuters.co.uk\/financeQuoteLookup.jhtml?ticker=PLMO.O qtype=sym infotype=info qcat=news\"&gt;PLMO.O&lt;\/A&gt; on Monday  unveiled a new version of its popular Treo that adds a  removable battery and short-range wireless technology to the  device, which combines a mobile phone and digital organizer."}
{"label":3,"sentence":"T-Mobile Checks in at Red Roof T-Mobile Hotspot #39;s network of public venues with Wi-Fi is extensive and its partners are big names you #39;ve heard of(Starbucks, FedEx Kinko #39;s, Borders Books)."}
{"label":3,"sentence":"News: Future Heat Waves: More Severe, More Frequent, and Longer Lasting Heat waves in Chicago, Paris, and elsewhere in North America and Europe will become more intense, more frequent, and longer lasting in the 21st century, according to a new modeling study by two scientists at the National Center for Atmospheric Research (NCAR). (NCAR press release)"}
{"label":3,"sentence":"Microsoft FAT patent falls flat Patent office rejects one of four patents on File Allocation Table format for Windows, though Microsoft can appeal.\\"}
{"label":3,"sentence":"Wisconsin ruling could set \\$300M precedent on modified apps A Wisconsin judge's refusal to order the state to refund sales tax paid by a Neena, Wis., company on a customized SAP AG rollout could relieve the state from paying out more than a quarter of a billion dollars in tax refunds to software users."}
{"label":3,"sentence":"Revenge Really Is Sweet, Study Shows Revenge feels sweet, and Swiss researchers said on Thursday they have the brain scans to prove it. In a study investigators said might "}
{"label":3,"sentence":"More mobile anti-virus appears Trend Micro will become the latest major anti-virus software company to provide protection against mobile phone viruses with the release today of Trend Micro Mobile Security 1.0."}
{"label":3,"sentence":"Nvidia to work on PlayStation 3 chip Graphics chip leader Nvidia announced Tuesday that it is working with Sony to develop the graphics processor for the next version of Sony #39;s PlayStation video game console."}
{"label":3,"sentence":"Consumer Alert: Car Restraint Systems Rated (Nov. 15) -- Would your car protect your head and neck in case of a crash? The Insurance Institute for Highway Safety tested restraint systems in dozens of cars."}
{"label":3,"sentence":"Egyptians wanted pets to join them in paradise If you think Americans are pet-crazy, consider new research that finds ancient Egyptians embalmed their animals with as much care as they did humans."}
{"label":3,"sentence":"T-Mobile introduces new Windows Mobile Smartphone in Germany The SDA Music (pictured) phone is the first Windows Mobile Smartphone to be release by the operator and gives not only allows access to Microsoft applications like Outlook, but also can be used to relax after work thanks to the integrated audio player."}
{"label":3,"sentence":"New Aibo is a dancing fool Latest incarnation of Sony's robot hound is a four-legged MP3 player. It'll also fetch pictures while you're away."}
{"label":3,"sentence":"Attacks on Windows PC #39;s Grew in First Half of 2004 A survey of Internet vulnerabilities to be released Monday shows a sharp jump in attacks on Windows-based personal computers during the first six months of 2004, along "}
{"label":3,"sentence":"Seeking a little iPod 101? A few tips on this hot gift Millions of people will buy or receive Apple Computers iPod digital-music players this holiday season. They are beautifully designed and easy to use."}
{"label":3,"sentence":"Report: Artists Find Internet Useful, But Criticize File-Sharing com. While recording and film industry interests have hammered away at the sharing of music and videos files over the Internet, the creative artists who actually produce the content welcome the Internet "}
{"label":3,"sentence":"Microsoft disses Itanium 2 p2pnet.net News:- Microsoft #39;s Windows Server 2003 Compute Cluster Edition doesn #39;t like servers built around Intel #39;s Itanium 2 chip."}
{"label":3,"sentence":"SBC links e-mail, voice messages, fax New service lets consumers access an all-in-one mailbox from anywhere using a phone or the Internet."}
{"label":3,"sentence":"Big Demand for Digital Music Players An anonymous reader writes  quot;Market research company IDC is predicting a rosy future for MP3 player sales. They predict that by 2008 it will grow into a \\$58 billion industry - four times bigger than the US record industry."}
{"label":3,"sentence":"Apple could pay more to Apple The row has been brewing almost as long as Steve Job #39;s computer outfit existed. In 1978 Apple Records sued Jobs and got an agreement that Apple Computer would never enter the music business."}
{"label":3,"sentence":"SAP taps HP for software-as-service push With help of longtime partner, German software maker dips toe in market it had downplayed."}
{"label":3,"sentence":"EU court ruling on Microsoft could come by mid-Nov. The European Union (E.U.) judge ruling on whether to suspend sanctions against Microsoft could deliver his verdict as early as mid-November, sources familiar with the process said Friday."}
{"label":3,"sentence":"Sony Considers MP3 Support to Silence iPod Fans Consumer electronics giant Sony Corp. said on Thursday it is mulling a major strategic shift to make digital music devices that play MP3 song files."}
{"label":3,"sentence":"IBM Stock Is Rising in Pre-Market Trading (AP) AP - International Business Machines Corp. stock rose in pre-market trading Tuesday, a day after the the company reported better than expected earnings for the third quarter."}
{"label":3,"sentence":"EMC, Veritas Tune Mail Archiving EMC Corp. and Veritas Software Corp. are building up their respective e-mail archiving offerings through development and acquisition to give customers more stringent control of enterprise content."}
{"label":3,"sentence":"Google Gaps Leave Search Susceptible While Google has risen in prominence and popularity, the details of its search software, even though it is open source, are largely unknown to outsiders."}
