{"label":0,"sentence":"Abdication Secures Cambodian Peace -Sihanouk King Norodom Sihanouk said on Tuesday his decision to abdicate gave Cambodia a chance to choose a successor in his lifetime and thus avoid another bloodbath."}
{"label":0,"sentence":"Resistance Rages to Lift Pressure Off Fallujah BAGHDAD, November 12 (IslamOnline.net  amp; News Agencies) - As the US military continued Friday, November 12, their massive sweep of Fallujah, resistance attacks were remarkably intensified across the war-torn country, in an effort to alleviate the "}
{"label":0,"sentence":"Motor Racing: Panis Reaches the End of the F1 Road &lt;p&gt;&lt;\/p&gt;&lt;p&gt; By Alan Baldwin&lt;\/p&gt;&lt;p&gt; LONDON (Reuters) - Olivier Panis, the oldest driver andonly Frenchman on the Formula One starting grid, says farewellto grand prix racing in Japan this weekend.&lt;\/p&gt;"}
{"label":0,"sentence":"Barghouti Release Would Reward Terror consecutive life terms, plus another 40 years, by an Israeli civil court that found him guilty of five cases of murder of innocent citizens, attempted murder and membership in a terror organization."}
{"label":0,"sentence":"Arms hold key as Ulster deal deadline is put back Sinn Fin #39;s president, Gerry Adams, last night placed responsibility for clinching an agreement to restore the power-sharing executive in Northern Ireland firmly in the hands of the British and Irish government - despite the enduring barrier of mistrust "}
{"label":0,"sentence":"HK Votes in Close Poll, Focus on More Democracy Hong Kong residents voted on Sunday in a legislative election seen as a referendum on greater democracy and a test of popularity for China #39;s communist rulers in the former British colony."}
{"label":0,"sentence":"UK and US defy UN over Iraq election By James Cusick, Westminster Editor, and Zainab Naji in Baghdad. The British and United States governments are on course for another confrontation with the United Nations over the proposed elections in Iraq."}
{"label":0,"sentence":" #39;Morgan wants four pillars #39; on reform agenda THE Federal Government #39;s control of both houses of parliament created a rare opportunity to overhaul the four pillars banking policy, Westpac chief executive David Morgan said yesterday."}
{"label":0,"sentence":"McKenry doesn #39;t back Scrafton: PM Prime Minister John Howard said a former public servant had not backed the claims by former adviser Mike Scrafton about the children overboard affair. "}
{"label":0,"sentence":"Panama state of emergency after fatal mudslides Panama declared a state of emergency on Saturday, a day after torrential rains and mudslides killed at least 14 people and wrecked or damaged the homes of about 10,000 people."}
{"label":0,"sentence":"Iran given last chance to halt uranium enrichment VIENNA - Senior officials from France, Britain and Germany will meet Irans top nuclear negotiator in Vienna on Thursday to offer Tehran a final chance to halt uranium enrichment plans or face possible UN sanctions."}
{"label":0,"sentence":"Ivan Devastates Grenada, Kills at Least 12 ST. GEORGE'S, Grenada - The most powerful hurricane to hit the Caribbean in nearly a decade killed at least 12 people in Grenada, damaged 90 percent of its homes and destroyed a prison that left criminals running loose, officials said Wednesday..."}
{"label":0,"sentence":"N.Irish 'Bloody Sunday' Probe Enters Final Phase  LONDONDERRY, Northern Ireland (Reuters) - The  longest-running and costliest public inquiry in British legal  history -- into Northern Ireland's so-called \"Bloody Sunday\" --  entered its final phase on Monday."}
{"label":0,"sentence":"Good Samaritans Aiding Hurricane Victims PUNTA GORDA, Fla. - Hundreds of local residents and some from across the nation have turned out to provide a vast array of free aid since Hurricane Charley ravaged the area on Aug..."}
{"label":0,"sentence":"Senate Allows Musharraf To Hold Duel Office General Pervez Musharraf to retain duel office-army chief and presidency- beyond December 31, 2004 amid opposition #39;s walkout. The bill, already passed by the National Assembly, was endorsed by the Upper-House "}
{"label":0,"sentence":"African Union to hoist 'Help Wanted' sign at poverty summit (AFP) AFP - How to create sustainable employment for impoverished, mostly illiterate African populations residing primarily in rural areas is the challenge the African Union aims to tackle at a summit opening Wednesday in Burkina Faso."}
{"label":0,"sentence":"Iraq Leader Tells Congress That Sacrifice Won't Be in Vain Offering a simple, \"Thank you America,\" Iraqi interim Prime Minister Ayad Allawi addressed a joint meeting of Congress ."}
{"label":0,"sentence":"Jiang pushes increased China-France contacts in Shanghai, meets &lt;b&gt;...&lt;\/b&gt; SHANGHAI, China - French President Jacques Chirac pushed for expanded economic and academic ties in Shanghai on Monday, speaking before students at a leading university and lunching with former Chinese leader Jiang Zemin."}
{"label":0,"sentence":"Car bombs, US raids kill 21 in Baghdad BAGHDAD - The Iraqi capital was engulfed in violence yesterday as 21 people were killed and more than 100 wounded from two car bomb attacks and from United States-led offensives on Shi #39;ite and Sunni rebel pockets in the city."}
{"label":0,"sentence":"France Cautious About Purported Iraq Hostage Talks (Reuters) Reuters - France was torn between hope and doubt\\about its two hostages in Iraq on Wednesday after a purported\\French negotiator announced their imminent release but\\officials insisted they knew nothing about his efforts."}
{"label":0,"sentence":"Gbagbo puts hard-liner in charge of Ivory Coast army President Laurent Gbagbo has named a hard-liner as army chief of staff, prompting diplomats to warn Sunday of a possible resumption of hostilities against the rebel-held north of the Ivory Coast."}
{"label":0,"sentence":"Deadly clashes rock Iraqi rebel hotspots RAMADI, Iraq (AFP) - Deadly fighting erupted on Sunday in a restive Iraqi province where eight marines were killed a day earlier, as Japan vowed to stand firm with its troops in Iraq despite the beheading of a Japanese tourist."}
{"label":0,"sentence":"Four Nations Lobby For UN Security Council Seats Japan, Brazil, India and Germany are joining forces to lobby for permanent seats on the UN Security Council. The move comes as a high-level panel prepares recommendations on reforming and enlarging the most powerful UN body."}
{"label":0,"sentence":"Terror cell arrests rise to 12 SECURITY forces had arrested two more people, bringing to 12 the number of suspects held after authorities broke up an al-Qaeda cell plotting to blow up Italian and Ukrainian embassies and kill Western diplomats, a judicial official said today."}
{"label":0,"sentence":"Iran Says Nuclear Freeze Won't Last Long  TEHRAN (Reuters) - Iran reiterated Tuesday it was only  prepared to freeze its uranium enrichment activities for a few  months and would not, as the EU and Washington want,  permanently mothball facilities which could make atomic bombs."}
{"label":0,"sentence":"AU to deploy 5,000 troops in Darfur The African Union is to decide early October whether it will send 3,000- to 5,000 troops to the troubled region Darfur to help stop the violence there, Nigerian President Olusegun Obasanjo said."}
{"label":0,"sentence":"Radical Cleric Accepts Najaf Peace Plan NAJAF, Iraq - Radical Shiite cleric Muqtada al-Sadr accepted a peace plan Wednesday that would disarm his militia and remove them from their hideout in a revered shrine, raising hopes of resolving a crisis that has angered many of Iraq's majority Shiites and threatened to undermine the fledgling interim government.    But al-Sadr has made contradictory statements in the past, and aides to the cleric said he still wanted to negotiate details of the deal to end two weeks of fighting between his forces and U.S.-led troops..."}
{"label":0,"sentence":"Israel Presses Offensive in Northern Gaza (AP) AP - Israel's largest and bloodiest offensive in Gaza in four years of conflict moved into its third week, with missile strikes killing six Palestinians and Israeli troops digging into the northern end of the crowded territory."}
{"label":0,"sentence":"Falluja Battle Erupts, Clashes in Baghdad  FALLUJA (Reuters) - A battle erupted near a mosque in  northwest Falluja on Friday just hours after U.S. Marines said  insurgents were now trapped in the south of the city."}
{"label":0,"sentence":"U.S. Thinks Explosives Vanished in Spring '03 Pentagon officials have identified the period during which nearly 400 tons of powerful explosives from an Iraqi military facility vanished, leading to speculation over should claim responsibility for the disappearance."}
{"label":0,"sentence":"Pakistan dealt crushing blow to Al Qaeda Pakistan said that it had dealt Al-Qaeda network a crushing blow after killing senior Al Qaeda operative, Amjad Farooqi, who is accused of hiding the chief plotter of Sept."}
{"label":0,"sentence":"Sudanese rebel movement says peace talks have collapsed (AFP) AFP - One of two rebel movements engaged in peace talks with Sudan's government mediated by the African Union (AU) said the negotiations had collapsed and could be suspended for weeks."}
{"label":1,"sentence":"Report: NHL agent loses certification According to a report in the Ottawa Sun, an NHL agent has lost his certification for leaking information about a players #39; association website to a reporter from a Minnesota newspaper."}
{"label":1,"sentence":"Ranieri believes victory to be turning point Valencia coach Claudio Ranieri believes that his side #39;s Champions League win at Anderlecht on Wednesday will be a turning point for his team, but believes they have to improve further if they are to qualify for the last sixteen."}
{"label":1,"sentence":"Giambi Returns To Yankees #39; Lineup Kansas City, MO -- New York Yankees first baseman Jason Giambi will make his first appearance since late July, as the former American League MVP was inserted in the starting lineup for Tuesday night #39;s game against the Kansas City Royals at Kauffman Stadium "}
{"label":1,"sentence":"Report: Kidd Not Expected Back Until December (Reuters) Reuters - New Jersey Nets guard Jason\\Kidd continues to recover from surgery on his left knee and\\will reportedly be sidelined until December."}
{"label":1,"sentence":"Kim fires 62 to take first-round lead SPRINGFIELD (Illinois): Christina Kim celebrated her parents silver wedding anniversary by firing a 62, matching her career best, here Thursday to take the first-round lead in the \\$1."}
{"label":1,"sentence":"NBA Nets' Mercer undergoes knee surgery (AFP) AFP - New Jersey nets guard Ron Mercer underwent surgery on his left knee, a procedure that is expected to sideline him for the next eight weeks of the National Basketball Association season."}
{"label":1,"sentence":"Clemens clocks Cards Astros 5, Cardinals 2, St. Louis leads series 2-1 Roger Clemens isn #39;t done yet, and neither are the Astros. Putting aside talk this might be his final game, Clemens focused on "}
{"label":1,"sentence":"Celtics' Broadcaster Taken to Hospital (AP) AP - Celtics longtime play-by-play television broadcaster Mike Gorman was taken to the hospital Monday night at halftime of Boston's game against Golden State with complaints of stomach cramps."}
{"label":1,"sentence":"Young gun Kovalainen puts Schumacher in shade PARIS (AFP) - Seven-time world champion Michael Schumacher found himself overshadowed as young Finn Heikki Kovalainen beat him on his way to winning the Race of Champions at the Stade de France."}
{"label":1,"sentence":"Carolina's Davis Will Not Face 49ers  CHARLOTTE, N.C. (Sports Network) - Carolina Panthers  running back Stephen Davis will miss his seventh game of the  season on Sunday when the club travels west to face the San  Francisco 49ers. Davis was officially listed as \"out\" on  Friday's injury report."}
{"label":1,"sentence":"MLB, players #39; union engage in steroid talks CBC SPORTS ONLINE - Major League Baseball players and owners are currently meeting to hammer out a deal that would toughen rules on steroid testing in baseball."}
{"label":1,"sentence":"O #39;NEILL STILL HARBOURS DREAM Celtic manager Martin O #39;Neill believes victory in Ukraine would put his side back on course for a place in the Champions League knock-out stages."}
{"label":1,"sentence":"Ryder-Monty gives Europe early advantage at Oakland Hills Colin Montgomerie drew first blood for holders Europe with a birdie-three at the first hole as the 35th Ryder Cup began at Oakland Hills under cloudy skies on Friday."}
{"label":1,"sentence":"Inzy proves hard to please Captain Inzamam-ul-Haq said Pakistan still had room for improvement after knocking India out of the Champions Trophy at Edgbaston."}
{"label":1,"sentence":"Carter vows full effort despite unhappiness In his first public statements since a trade demand last month, the Toronto Raptors star defiantly refused to soften his position yesterday, but insisted that he would still play hard for the team he wants to leave."}
{"label":1,"sentence":"Holliston is pushed by Rogers Coming into last night's showdown with undefeated Tri-Valley League rival Holliston, the Medfield Warriors had reason to be confident. They had been averaging more than 30 points per game, and they had the league's leading scorer in halfback Bryan Lee."}
{"label":1,"sentence":"Dostanic off to winning start at Red Star Serbia and Montenegro champions Red Star Belgrade beat city rivals Cukaricki 1-0 on Saturday to give new manager Ratko Dostanic his first taste of success on his debut."}
{"label":1,"sentence":"US men #39;s soccer team carries itself with a swagger They play with a confident air these days, even a swagger, more befitting the Brazilians and Germans. "}
{"label":1,"sentence":"Halladay Throws Another Simulated Game (AP) AP - Toronto ace Roy Halladay threw 25 pitches Sunday during his second simulated game in four days."}
{"label":1,"sentence":"UPDATE 3-Roddick hits record serve as US take control Andy Roddick broke his own fastest serve record as he helped the US take a 2-0 lead over Belarus in their Davis Cup semi-final on Friday."}
{"label":1,"sentence":"No. 18 Virginia Tech Squeaks Past UNC Mike Imoh Runs for 236 Yards and Two TDs As No. 18 Virginia Tech Downs North Carolina 27-24. Virginia Tech #39;s Mike Imoh (29) drags North Carolina #39;s Tommy Richardson (8) into the end zone as Jeff King (90) celebrates "}
{"label":1,"sentence":"Montgomerie Triumphs in Ryder Cup (AP) AP - Colin Montgomerie looked out of place only once Sunday at the Ryder Cup. During the closing ceremonies, he walked self-consciously onto the stage without a female companion."}
{"label":1,"sentence":"Finish line is in sight for Martin Self-proclaimed sham Mark Martin vowed to leave racing at the top of his game. A late-season surge has put him there, back in the chase for that elusive NASCAR title."}
{"label":1,"sentence":"S Korean gymnast accepts ruling South Korea #39;s Yang Tae-young accepted an international sport court #39;s ruling on Thursday that rejected his appeal for a gymnastics gold medal at the Athens Olympics."}
{"label":1,"sentence":"Redskins Lead, 3-0 After a Washington touchdown was wiped out by a penalty, Ola Kimrin hit a 24-yard field goal to give the Redskins a 3-0 lead over the Lions in the second quarter."}
{"label":1,"sentence":"NFL Suspends Seattle Receiver Four Games Seattle receiver Koren Robinson was suspended without pay Monday for the next four games for violating the NFL's substance-abuse policy."}
{"label":1,"sentence":"Out for 7 months FORMER Chelsea striker Adrian Mutu was banned seven months and fined 20,000 (\\$61,000) by the Football Association yesterday for failing a drugs test."}
{"label":1,"sentence":"Rangers Designate Bacsik for Assignment (AP) AP - Pitcher Mike Bacsik was designated for assignment by the Texas Rangers on Sunday after going 1-1 with a 4.60 ERA in three starts."}
{"label":1,"sentence":"Winning Iraqi Soccer Team Rare Cause for Joy  BAGHDAD (Reuters) - When Iraq's Olympic soccer side beat  Costa Rica nine days ago en route to their semi-final clash  with Paraguay later on Tuesday, Hussein Allawi jumped so high  with joy he cut his hand in the ceiling fan."}
{"label":1,"sentence":"Ravens' win comes too late BALTIMORE -- The Baltimore Ravens showed exactly why they had to depend on outside help to reach the playoffs. Baltimore needed to beat the Miami Dolphins and have three other games fall its way to earn a wild-card berth. The Ravens did their part, stumbling to a 30-23 victory yesterday, but failed to get the help they needed elsewhere and ..."}
{"label":1,"sentence":"League setup aids Big Ten in BCS With No. 14 Minnesota trying to become the seventh Big Ten member to earn a Bowl Championship Series berth, it #39;s a good time to point out that - in an age of conference expansion - staying small has its advantages."}
{"label":1,"sentence":"Celtics Sign Gugliotta, Wait on Payton (AP) AP - Ten days after trading for Gary Payton, the Boston Celtics still have no idea if the nine-time All-Star will ever wear a Celtics' uniform."}
{"label":2,"sentence":"US elections polling begins today WASHINGTON: Polling for the US elections will begin according to Pakistan time at 5:00 pm on Tuesday as Americans vote in one of the closest presidential elections in decades after a long and often bitter campaign between Republican incumbent George W "}
{"label":2,"sentence":"WHO Urges ASEAN to Curb Tobacco Trade The World Health Organization is urging Southeast Asian nations to strengthen curbs on tobacco trade. Shigeru Omi, the WHO regional director for the Western Pacific, told a conference of the Association of "}
{"label":2,"sentence":"Savvy grocers with a recipe for expansion Albertsons Inc., one of the nation's largest grocery chains, bought the Shaw's and Star Market chains for more than \\$2.1 billion in April to gain a foothold in New England and compete more aggressively against the region's top supermarket company, Stop  amp; Shop. Albertsons chief executive Larry Johnston and Shaw's president Nicola DiFelice spoke with Globe reporter Naomi Aoki."}
{"label":2,"sentence":"Gov #39;s plan to add 18 inspectors greatly inadequate The Romney administration is planning a \\$1.7 million, 18-job boost for the beleaguered agency that inspects amusement park rides, boilers and elevators, but a union official says at least "}
{"label":2,"sentence":"ARI sells \\$115m stake in Colorado Clothing and footware company Colorado Group Ltd today confirmed that Australian Retail Investments (ARI) had sold its \\$115 million stake in the company."}
{"label":2,"sentence":"Kelly: Perennial Winner Southwest In 14.1 Traffic Jump &lt;b&gt;...&lt;\/b&gt; Southwest Airlines (nyse: LUV - news - people ) on Friday said its traffic jumped 14.1 in November. The discount carrier carried 9.6 more passengers during the month than in the year-ago period."}
{"label":2,"sentence":"Banking on Christopher   Banks? Management keeps growing and buying back shares even as the retailer struggles."}
{"label":2,"sentence":"SEC: Fannie Fails Accounting Compliance (Reuters) Reuters - The U.S. Securities and Exchange\\Commission said on Wednesday the accounting practices of\\housing finance group Fannie Mae  from 2001 to mid-2004\\\"did not comply in material respects\" with certain accounting\\standards for derivatives, hedging and other matters."}
{"label":2,"sentence":"United Airlines Says It May Terminate Pension Plans (Update3) Aug. 19 (Bloomberg) -- UAL Corp. #39;s United Airlines, trying to attract financing to exit bankruptcy, said it probably will terminate and replace all its pension plans. "}
{"label":2,"sentence":"IMF gives Argentina one-year reprieve The International Monetary Fund (IMF) has given Argentina a one-year extension on repaying \\$US1.1 billion (\\$A1.58 billion) in debt."}
{"label":2,"sentence":"Insurers may drop thousands of homeowners as moratorium ends Come Dec. 1, many Floridians may find an unwelcome piece of mail interspersed between bills, holiday catalogs and greeting cards: a non-renewal or cancellation letter from their insurers."}
{"label":2,"sentence":"US 30-, 15-year mortgage rates rise in latest week Interest rates on US 30-year and 15-year mortgages edged higher this week amid signs the economy is improving, stoking inflation concerns, mortgage finance company Freddie Mac said on Thursday."}
{"label":2,"sentence":"Wal-Mart Profit Up, Raises Outlook  NEW YORK (Reuters) - Wal-Mart Stores Inc. &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=WMT.N target=\/stocks\/quickinfo\/fullquote\"&gt;WMT.N&lt;\/A&gt;, the  world's biggest retailer, posted a 13 percent rise in quarterly  profit on Tuesday and raised its outlook and expectations for  holiday sales, saying the economy was improving."}
{"label":2,"sentence":"Corporate directors seek tax break, say fees not  #39;employment &lt;b&gt;...&lt;\/b&gt; TORONTO (CP) - Members of corporate boards act as independent professionals, not employees, and this should be reflected in the taxation of their fees, a group representing directors says."}
{"label":2,"sentence":"SBC Offers \\$1.99 Per Month Wi-Fi Add-On SBC Communications Inc., the second-largest local phone company in the United States, said Monday it will offer wireless Internet service for \\$1."}
{"label":2,"sentence":"Shell to Spend More on North Sea Venture Royal Dutch\/Shell Group announced Wednesday that it would spend US\\$1.8 billion on exploration and production in the North Sea, including building a pipeline to transfer gas from Norway to Britain."}
{"label":2,"sentence":"Verizon Considering Bid For Sprint The Wall Street Journal is reporting that Vodafone has given Verizon Wireless the green-light to make a bid to buy Sprint.  quot;Verizon Communications Inc."}
{"label":2,"sentence":"Federated Hurt by Hurricane Jeanne Federated Departments Stores Inc. said Monday that Hurricane Jeanne will hurt third-quarter earnings by 1 cent to 2 cents per share, further lowering an outlook already cut because of lost sales from Hurricane Frances."}
{"label":2,"sentence":"FAO Schwarz takes high-end road for survival Posh toy seller FAO Schwarz, forced into bankruptcy after a price war with discount giants like Wal-Mart, hopes offerings like a \\$12,000 treehouse will lure the "}
{"label":2,"sentence":"Good Night for a Good Knight Phil Knight saved the best for last for the company he helped nurture into a brand superstar."}
{"label":2,"sentence":"Japan deflation struggle nears end Bank of Japan says prices will rise 0.1 in  #39;05, but it will likely keep ultra-low interest rates. TOKYO (Reuters) - Japan #39;s five-year bout with deflation is likely to end next year, the Bank of Japan said "}
{"label":2,"sentence":"BHP Billiton, Alcoa to Sell Shares in Metal Distribution Unit BHP Billiton, the world #39;s biggest mining company, and Alcoa Inc. said they plan to sell shares in their metal-processing and distribution venture."}
{"label":2,"sentence":"More Than 400 Iowans Haven #39;t Received Tax Refunds DES MOINES, Iowa -- Federal officials say more than 400 Iowans who haven #39;t received their 2003 federal tax refunds still have a chance to claim them."}
{"label":2,"sentence":"Equity Firms to Buy Intelsat for \\$3.1 Bln  PARIS (Reuters) - Intelsat is to be sold to four private  equity firms for \\$3.1 billion, the world's second-largest  satellite operator said on Monday."}
{"label":2,"sentence":"FDA Warns Cyberonics on Manufacturing (Reuters) Reuters - Medical devices maker Cyberonics Inc.\\ on Monday said it received a warning letter from the\\U.S. Food and Drug Administration saying the company's \\response to issues involving manufacturing practices at its\\Houston operations has been insufficient."}
{"label":2,"sentence":"Head of Calpers Pension Fund Ousted California officials on Wednesday voted to oust Sean Harrigan as president of Calpers, naming a former real-estate executive seen as more business "}
{"label":2,"sentence":"General Mills cereals to go whole grain Responding to a national push to make whole-grain consumption a public-health priority, General Mills Inc. announced it will make all of its Big G breakfast cereals with whole grain."}
{"label":2,"sentence":"Paxil Maker Will Post Its Unfavorable Test Results Drugmaker GlaxoSmithKline agreed Thursday to settle charges that it hid and misrepresented unfavorable data about the effectiveness and safety of its top-selling anti "}
{"label":2,"sentence":"EU judge considers impact of Microsoft dropouts A European Union judge has summoned all sides for a closed meeting today to consider how to handle the decision by two major opponents of Microsoft to drop out of an antitrust case against the company."}
{"label":2,"sentence":"Can Jamdat Survive the Hype? Earnings from hot new issue Jamdat Mobile don't live up to analysts' expectations."}
{"label":2,"sentence":"Dollar Edges Up, Direction Sought (Reuters) Reuters - The dollar inched up on Monday but\\traders struggled to find direction in a market devoid of\\economic data."}
{"label":2,"sentence":"U.S. July Output Up; Factories Run Faster  WASHINGTON (Reuters) - U.S. industrial output advanced in  July, as American factories operated at their highest capacity  in more than three years, a Federal Reserve report on Tuesday  showed."}
{"label":3,"sentence":"Skulls trojan bites Symbian 60 p2pnet.net News:- Nokia 7610 smart phones, as well as other mobiles running Symbian Series 60 software, could be hit by the new Skulls malware."}
{"label":3,"sentence":"Pressure mounts on EDS over U.K. government IT system grows LONDON -- After continuous computer failures forced the top civil servant of the U.K.'s Department of Work and Pensions' Child Support Agency (CSA) to step down from his job this week, the government is considering scrapping a welfare case management and telephony system developed in large part by Electronic Data Systems (EDS)."}
{"label":3,"sentence":"Maryland's Technology Future Julie Coons, the president of the Technology Council of Maryland, discusses the organization and the region's technology community."}
{"label":3,"sentence":"PC Sector Sale By IBM Would Signal Change (washingtonpost.com) washingtonpost.com - Among corporate technology managers, it's one of the oldest adages: \"Nobody ever got fired for buying IBM.\""}
{"label":3,"sentence":"DoubleClick Signs on MSN to Use Its Rich Media Ads (Reuters) Reuters - A top executive for Web marketing\\company DoubleClick (DCLK.O) on Tuesday said Microsoft Corp's\\(MSFT.O) MSN Web portal will use its rich media ads online,\\paving the way for wider use of a key DoubleClick  product."}
{"label":3,"sentence":"Skype Delivers Mobile VoIP (NewsFactor) NewsFactor - Voice over Internet calling is now available for \\PDA users, with \\Skype Technologies officially launching software designed for handhelds running the Microsoft Windows Pocket PC operating system."}
{"label":3,"sentence":"Microsoft Files More Lawsuits over Spam Going after spammers rather than focusing merely on developing antispam technology is an important step, John Movina, spokesperson for the Coalition Against Unsolicited Commercial Email, said."}
{"label":3,"sentence":"PeopleSoft, Unfazed, Announces 5-Year Pact With I.B.M. PeopleSoft's partnership with I.B.M. is an attempt to show that it is moving forward aggressively despite the turmoil created by Oracle's hostile takeover bid."}
{"label":3,"sentence":"Portable playstation a hit in Japan The new PlayStation Portable (PSP) portable game console reportedly sold out at Tokyo electronic retailers within hours of its debut on Sunday."}
{"label":3,"sentence":"BOFH takes a hit from Cupid's arrow &lt;strong&gt;Episode 26&lt;\/strong&gt; Shall I compare thee to an OS2-free Intel box?"}
{"label":3,"sentence":"MSN Messenger 7 Beta: Sneak Review MSN Messenger 7 Beta: Sneak Review\\\\Just the other day I got hold of the beta version of this much hyped up upgrade to the very popular instant messaging client MSN Messenger 7.  I downloaded it onto a test machine and found that its download size of the beta is ..."}
{"label":3,"sentence":"Motorola to Invest  #36;90 Million in China R D Center (Reuters) Reuters - Motorola Inc. said on Friday it plans\\to invest  #36;90 million in a new research facility in Beijing as\\the U.S. mobile phone maker fights to wrest back top position\\in the domestic handset market."}
{"label":3,"sentence":"BioSET Offers New Twist on the Healing Touch Doctors routinely use plates, rods and screws to bolt a nasty bone fracture back together. But all of that hardware won't help heal the bone and muscle tissue surrounding the injury, said Thomas G. Roueche, president and chief executive of BioSurface Engineering Technologies Inc. of College Park."}
{"label":3,"sentence":"Yahoo battles Google for the cell phone SAN FRANCISCO--Yahoo added a search feature for cell phones Tuesday, just a few weeks after rival Google launched one of its own. While Google SMS (Short Message Service) uses text-only messages to deliver "}
{"label":3,"sentence":"Extinctions Could Have Domino Effect, Study Says A new study estimates that if the nearly 12,200 animals and plants currently listed as threatened or endangered disappear, another 6,300 \"affiliate\" species could also be lost."}
{"label":3,"sentence":"Hitachi strikes new direction with Lightning 8 Sep 2004, 18:44 GMT - Hitachi this week laid a unique bet on storage virtualization with the launch of the latest version of its flagship Lightning disk array."}
{"label":3,"sentence":"Is US Wireless Industry Catching Up on 3G? SAN FRANCISCOWireless software developers and content producers attending the CTIA Wireless show here say the United States is on the verge of catching up with Europe and Japan in the deployment of the latest wireless technology and content."}
{"label":3,"sentence":" #39;Magnetic #39; sharks add bite to compass theory Paris - Marine biologists say they have obtained the first proof that sharks can spot changes in magnetic fields, boosting evidence that the creatures have an internal compass to guide them as well as a phenomenal sense of smell."}
{"label":3,"sentence":"People Wait Overnight To Buy Sony #39;s New PSP Game Console They lined up and waited for hours, and in some cases camped out overnight to be the first to own one of Sony #39;s new handheld PlayStaion Portable devices (PSP) in Japan on Sunday."}
{"label":3,"sentence":"We Love Them. We Hate Them. We Take Them. The relationships we all have with those little pieces of matter, our pills, are becoming ridiculously tangled."}
{"label":3,"sentence":"Hollywood Sues Computer Server Operators (AP) AP - Hollywood movie studios on Tuesday sued scores of operators of computer servers that help relay digital movie files across online file-sharing networks."}
{"label":3,"sentence":"Tivo, Netflix Close to Internet Movie Deal - Report Online DVD renter Netflix Inc. and television recorder maker TiVo Inc. are close to a deal to allow Netflix subscribers to download movies over the Internet to their "}
{"label":3,"sentence":"Update: EU okays Oracle bid for PeopleSoft The European Commission concluded that there's insufficient evidence that the takeover would cause competitive harm in the business software sector."}
{"label":3,"sentence":"OutKast take digi-download crown OutKast topped the first US digital music awards, presented by the Recording industry Association of America (RIAA). They took a multi-platinum award yesterday in recognition of 400,000 downloads for  #39;Hey Ya!"}
{"label":3,"sentence":"MS to launch final Windows Media Player 10 today Microsoft will announce the final version of its Windows Media 10 software today when it launches Windows XP Media Center 2005. Central to the announcement is Windows Media Player 10, which integrates MS #39; latest "}
{"label":3,"sentence":"Google Buys Digital Mapping Company Google Inc. has bought digital map maker Keyhole Corp., extending the search engine leader #39;s bid to fend off rivals with a toolbox that can catalog almost anything in the world."}
{"label":3,"sentence":"Reliving Lewis and Clark: Conflicts With the Sioux This September things suddenly got interesting for reenactors retracing the route of Lewis and Clark up the Missouri: Reliving the journey also meant reliving conflicts with the Sioux Indians."}
{"label":3,"sentence":"Proprietary MSN Search Beta launches tomorrow Tomorrow, Microsoft finally releases the beta version of its proprietary search engine. For over a year, webmasters and SEOs have seen evidence of MSNbot spidering their sites as MSN-Search gathered information and compiled its database."}
{"label":3,"sentence":"Online Extra: \"I Give So They Can Give Back\" (BusinessWeek Online) BusinessWeek Online - Chris Aque, a 17-year-old high school senior in Chicago, is big on the new band Tilly and the Wall. Tilly is the first group to be signed by new indie label Team Love, which was co-founded by Conor Oberst of the band Bright Eyes and Nate Krenkel, and offers free downloads as a way to promote its bands. Aque loves music and talking about the bands he likes with other music fans online at sites including the social networking service LiveJournal."}
{"label":3,"sentence":"Hollywood sues 200 US internet thieves Top Hollywood studios have launched a wave of court cases against internet users who illegally download film files. The Motion Picture Association of America, which acts as the representative of major film "}
{"label":3,"sentence":"Ex-manager at Oracle seeks \\$679,000 IT sales account manager in England seeks compensation after winning her sex discrimination case."}
{"label":3,"sentence":"New IBM Systems Mark Storage\/Server Convergence NEW YORK -- IBM (Quote, Chart) took the covers off its latest storage strategy Tuesday with an imposing DS8000 enterprise-class storage server along with the much smaller, ultra-dense DS6000."}
