{"label":0,"sentence":"Iran: Problems With EU Countries In Nuclear Talks 6 November 2004 -- An Iranian negotiator says some problems remain at talks with Britain, France, and Germany on resolving a dispute over Iran #39;s nuclear program but that he still hopes an understanding can be reached."}
{"label":0,"sentence":"Judge in London gives okay to let premature baby die LONDON : Doctors caring for a critically-ill premature baby, Charlotte Wyatt, were given permission by a British judge to allow her to die if her condition seriously deteriorates and her breathing stops."}
{"label":0,"sentence":"Karzai Sworn in as Afghanistan's President  KABUL (Reuters) - Hamid Karzai was sworn in as  Afghanistan's first popularly elected president Tuesday,  promising to bring peace to the war-torn nation and end the  economy's dependence on narcotics."}
{"label":0,"sentence":"Apec ministers urge new effort on trade talks SANTIAGO, Chile - Pacific Rim trading nations said today they should pool their influence to breathe new life into talks to free up world trade."}
{"label":0,"sentence":"Strong Quake Kills at Least 3 in Northern Japan An earthquake with a preliminary magnitude of 6.8 and several aftershocks hit northern Japan on Saturday, killing at least three people and injuring more than 250 while knocking "}
{"label":0,"sentence":"Deutsche Telekom sells remaining 7.3 pct stake in SES Global (AFP) AFP - Deutsche Telekom said it had sold its remaining 7.3 percent stake in SES Global, the world's leading satellite operator, for approximately 345 million euros (449.5 million dollars)."}
{"label":0,"sentence":"Summary: Cuba Frees Three Dissidents (AP) AP - THE FREED: Cuba unexpectedly releases for health reasons three political dissidents: economics writer Oscar Espinosa Chepe, who has a liver ailment, Marcelo Lopez, who has a neurological disorder, and Margarito Broche, who suffered a heart attack in prison."}
{"label":0,"sentence":"Kerry Ties Hurt Some Democratic Senators (AP) AP - Senate Democratic leader Tom Daschle hugged President Bush from one end of South Dakota to the other this summer  #151; in his own campaign commercials."}
{"label":0,"sentence":"Pinochet is stripped of immunity by court The Supreme Court of Chile yesterday stripped Augusto Pinochet, the country #39;s former military dictator, of his immunity from prosecution - opening the way for him to be charged with human "}
{"label":0,"sentence":"Baghdad Rocket Attack Kills Two US Soldiers Two American soldiers were killed and five injured Monday in a rocket attack in Baghdad. The military said the incident occurred in the southern part of the city but provided no other details."}
{"label":0,"sentence":"Europes big three gives Iran last chance to come clean on &lt;b&gt;...&lt;\/b&gt; VIENNA - Europes three main states were Thursday to give Iran a last chance to reassure the world it is not secretly developing atomic weapons, offering valuable nuclear technology as a carrot and possible UN sanctions as the stick."}
{"label":0,"sentence":"Iraq Probes Possible Security Breach Over Killings  BAGHDAD (Reuters) - Iraq ordered an investigation on Monday  into whether a security breach triggered a massacre of 49 army  recruits, while two foreign soldiers, an Estonian and an  American, were killed in surging guerrilla raids during  Ramadan."}
{"label":0,"sentence":"Sri Lanka urged to offer more support to rebel go-between Sri Lanka #39;s main foreign donors warn some members of the country #39;s ruling coalition are undermining the shaky peace process aimed at ending the decades-long civil war."}
{"label":0,"sentence":"Italian Govt. Tries to Assure Country Over Hostages  ROME (Reuters) - Italy's government tried to reassure an  anguished nation Thursday that two women hostages in Iraq were  most likely still alive, saying an Islamist group's claim to  have killed them was \"unreliable.\""}
{"label":0,"sentence":"Palestinian Blamed for Twin Sinai Attacks Pictures distributed by Egyptian interior ministery Monday Oct 15 2004 showing from left to right, Palestinian refugee born Ayad Said Saleh, Egyptian Sinai Bedouins Suleiman Ahmed Saleh Flayfil , his brother Mohamed Ahmed Saleh Flayfil and Hammad Gaman "}
{"label":0,"sentence":"Bush Sees Great Chance For Creating Palestinian State Mr. Bush told reporters Friday after meeting with British Prime Minister Tony Blair that he sees a great chance for creating a Palestinian state in the aftermath of the death of longtime Palestinian leader Yasser Arafat."}
{"label":0,"sentence":"Colombian Indians Want Time to Forget Their Land &lt;p&gt;&lt;\/p&gt;&lt;p&gt; By Jason Webb&lt;\/p&gt;&lt;p&gt; SABANA CRESPO, Colombia (Reuters) - Coca leaves, the rawmaterial of cocaine, should speed you up and give you a buzz.But you'd never know it to look at the Arhuaco Indians ofColombia's Sierra Nevada, who must be strong contenders for thetitle of World's Most Laid-Back People.&lt;\/p&gt;"}
{"label":0,"sentence":"Israeli Cabinet approves compensation plan for uprooted settlers JERUSALEM The Israeli Cabinet has approved legislation to pay compensation to settlers uprooted by Prime Minister Ariel Sharon #39;s Gaza withdrawal plan."}
{"label":0,"sentence":"At Unusual UN Session, Sudanese Factions Vow to End War The Sudanese government and southern rebels vowed today to end Sudan #39;s long civil war by the end of this year, putting their pledge on paper in "}
{"label":0,"sentence":"Hamza to face UK terror charges Muslim cleric Abu Hamza al-Masri is to face terrorism charges in the UK , which will take precedence over US extradition requests."}
{"label":0,"sentence":"UN to investigate terrorist link UN Secretary-General Kofi Annan has dispatched a team to Jerusalem to look into allegations that a UN ambulance driver was filmed putting a Qassam rocket into his vehicle."}
{"label":0,"sentence":"Clubs to Be Named for Socialite Hilton ORLANDO, Fla. - Paris Hilton knows something about nightclubs, so it makes sense the hotel heiress is the inspiration for a handful of clubs that will bear her name..."}
{"label":0,"sentence":"World's Beer Fans Meet for Annual Munich Binge (Reuters) Reuters - International squads of beer\\drinkers, leather-clad Bavarians and devotees of excess young\\and old converged in Munich on Saturday for the start of the\\planet's biggest beer festival, the Oktoberfest."}
{"label":0,"sentence":"G7: Oil Prices a Risk to Economic Growth (Reuters) Reuters - High oil prices pose a risk to the\\global economy, but the economic outlook for 2005 is still\\favorable, the Group of Seven nations said in a statement\\following their meeting on Friday."}
{"label":0,"sentence":"Abu Ghraib: Guilty plea expected US soldier Staff Sgt. Ivan Frederick will plead guilty at a pretrial hearing to one or two of the charges against him arising from the abuse of detainees at Iraq #39;s Abu Ghraib prison, military sources say."}
{"label":0,"sentence":"Putin lays wreath at Akhmad Kadyrov #39;s grave TSENTOROI, Chechnya. Aug 22 (Interfax) - Russian President Vladimir Putin arrived in the Chechen village of Tsentoroi on Sunday morning and laid a wreath at the grave of former Chechen president Akhmad Kadyrov."}
{"label":0,"sentence":"Europe and US reach Kyoto compromise Europe and the United States reached an 11th-hour compromise late last night at the UN climate change conference in Buenos Aires. The two sides were locked in disagreement on future efforts to reduce harmful "}
{"label":0,"sentence":"Another bomb explodes in Thailand One person was killed and seven injured, three of them critically, in a blast in Thailand on Saturday, the fourth explosion within 24 hours."}
{"label":0,"sentence":"French gays hail new \"Pink TV\" channel (Reuters) Reuters - Gays across France are celebrating the launch of the country's first television channel for homosexuals,\\anticipating a pink mixture of fashion, travel, talk, cult movies, music and soap operas."}
{"label":0,"sentence":"Fan Spends \\$25K Hoping for Bonds HR Ball LOS ANGELES - Spending nearly \\$25,000 for baseball tickets seemed like a worthy investment to Michael Mahan, considering the 700th home run ball crushed by Barry Bonds will likely fetch a much higher price.    But it appears Bonds will reach that historic milestone in the coming days so Mahan, a lifelong Los Angeles Dodger fan, has been selling most of those tickets in the right-field pavilion at Dodger Stadium..."}
{"label":0,"sentence":"Cambodia #39;s King Sihanouk insists abdication is final PHNOM PENH: Cambodia #39;s retired King Norodom Sihanouk has confirmed that he will not retake the throne despite the pleas of his nation to change his mind."}
{"label":0,"sentence":"Unions and VW narrowing differences FRANKFURT Volkswagen and its workers entered a critical week in their wage negotiations Monday, with signs that a compromise was taking shape even as protests flared at factories across Germany."}
{"label":1,"sentence":"UNLV names Utah #39;s Sanford as head coach Calling UNLV  quot;a gold mine, quot; Mike Sanford took over as coach of the Runnin #39; Rebels on Monday after two years as offensive coordinator at high-scoring Utah."}
{"label":1,"sentence":"NASCAR Contenders Aim to Avoid Mistakes (AP) AP - No more mulligans. When Nextel Cup leader Kurt Busch was hit by engine failure at Atlanta Motor Speedway and finished 42nd last Sunday, the mishap tightened NASCAR's new 10-race championship format. It also meant each of the 10 drivers in the title chase has had at least one finish of 30th or worse in the first seven events."}
{"label":1,"sentence":"Lonard wins Australian PGA Championship COOLUM, Australia - Australian Peter Lonard won the Australian PGA Championship by two strokes for his third tournament title in as many weeks on Sunday."}
{"label":1,"sentence":"Savastano's stellar soccer season interrupted by knee injury It was a bittersweet soccer season for Jocelyn Savastano. The former Plymouth North star and Globe All-Scholastic set school, conference, and national records in the first seven games for Saint Anselm College in Manchester, N.H."}
{"label":1,"sentence":"Kuznetsova beats injured Davenport, becomes first Russian woman to &lt;b&gt;...&lt;\/b&gt; Lindsay Davenport hobbled her way out of the US Open, losing a big lead and able to do little but watch Svetlana Kuznetsova win 1-6, 6-2, 6-4 and become the first Russian woman to reach the final at this tournament."}
{"label":1,"sentence":"Willingham firing a winning thing Notre Dame was fortunate to have a man like Tyrone Willingham at the helm. He #39;s a class act and a quality person. The young men who played for him have benefited from his leadership and example."}
{"label":1,"sentence":"Interlagos: Williams top first practice Friday morning usually sees the third cars star  but today, Juan Pablo Montoya took top spot."}
{"label":1,"sentence":"UAE #39;s TEN Sports to Produce Australia-India Cricket Test Series TV &lt;b&gt;...&lt;\/b&gt; The Board of Control for Cricket in India has granted the television production and distribution rights for Australia #39;s test series with India even as the Indian Supreme Court hears arguments over who owns the rights."}
{"label":1,"sentence":"Vince Carter traded to Nets The New Jersey Nets have acquired five-time NBA All-Star guard\/forward Vince Carter from the Toronto Raptors in exchange for center Alonzo Mourning, center\/forward Aaron Williams, forward Eric Williams and two first round draft picks, Nets President Rod "}
{"label":1,"sentence":"Another Recovery As the 16th-ranked Cavaliers prepare for Saturday's season opener at Temple, inside linebacker Rich Bedesem is healthy again after tearing the ACL in his right knee -- again."}
{"label":1,"sentence":"Seattle burned again by fourth-quarter collapse Seattle #39;s young defense hasn #39;t been the same since collapsing in the fourth quarter of an October loss to St. Louis. For good measure, the Seahawks did it again against the Dallas Cowboys."}
{"label":1,"sentence":"Weight of drugs felt Weightlifting #39;s aggressive pursuit of drug cheaters will continue even if it jeopardizes its future in the Olympics, its top official said yesterday following six more positive doping cases in what is again becoming the Games #39; dirtiest sport. Five ..."}
{"label":1,"sentence":"Bernard Hopkins Leaves Calling Card  Stops De La Hoya in Ninth Just four months shy of his 40th birthday, Hopkinswho appeared to be starting to wear De La Hoya down as the fight neared the championship roundsclosed the show with a lethal body shot in the 9th."}
{"label":1,"sentence":"India off to flying start against SA Kanpur: Openers Virender Sehwag and Gautam Gambhir struck half-centuries as India reached 185 without loss at stumps in reply to South Africa #39;s giant 510 first-innings score in first Test on Monday."}
{"label":1,"sentence":"Some tolling thoughts You don #39;t really believe Pedro Martinez is going to pitch for the Yankees, do you? Don #39;t forget about Pedro #39;s working hours on his non-pitching days."}
{"label":1,"sentence":"Eagles Reward Reid with Four-Year Extension  PHILADELPHIA (Sports Network) - The Philadelphia Eagles  locked up their most successful head coach in franchise history  Wednesday, signing Andy Reid to a four-year contract extension."}
{"label":1,"sentence":"Radcliffe #39;s risky recovery strategy Paula Radcliffe has never faced the kind of pressure she will encounter when she runs in the New York City Marathon here today. Just 10 weeks after failing so dramatically to complete the Olympic marathon "}
{"label":1,"sentence":"Lyon #39;s Malouda to earn first France cap against Poland Olympique Lyon midfielder Florent Malouda will earn his first cap for France on Wednesday after coach Raymond Domenech named him in his starting line-up for the friendly against Poland."}
{"label":1,"sentence":"McLeish gives Smith vote of approval for Scotland job THE imminent appointment of Walter Smith as Scotland football manager has been given a glowing endorsement by leading figures in the game."}
{"label":1,"sentence":"Father bets son against Aussies WELFARE authorities in the Solomon Islands have reacted with outrage after a local soccer fan reportedly offered his eight-year-old son as bait for a bet on the Solomons #39; clash with Australia."}
{"label":1,"sentence":"Lions Make Final Roster Moves The Detroit Lions whittled their roster to the mandatory 53 on Sunday, releasing veteran kick-returner Reggie Swinton, second-year receiver and fan favorite David Kircus, rookie linebacker Andrew Battle, recently signed linebacker Michael Young, running "}
{"label":1,"sentence":"Rounding into form A word about Angels in the outfield, and we're not talking about the Hollywood original with Paul Douglas and Keenan Wynn, or the remake with Christopher Lloyd and Danny Glover. This is about the Anaheim fly-chasers, the ones who have not had a moment's peace since alighting on the Fens."}
{"label":1,"sentence":"Cycling: Cardenas Wins 17th Stage of Tour of Spain Colombian cyclist Felix Cardenas has won the 17th stage of the Tour of Spain, but Spain #39;s Roberto Heras remains the overall leader heading into the race #39;s final days."}
{"label":1,"sentence":"Knicks: Carter puts on a show for Raptors If Vince Carter really wants to be traded, then he must slip a few bucks to the Toronto Raptors #39; video coordinator and ask him to burn a few copies of the DVD from last night #39;s game against the Knicks at Air Canada Centre."}
{"label":1,"sentence":"Panthers 37 49ers 27 SAN FRANCISCO Carolina scored 17 points in the final eight minutes to jump past San Francisco 37-to-27. The Panthers had trailed early 17-to-3 before coming back for the win."}
{"label":1,"sentence":"Cards RB Smith leaves game with toe injury TEMPE, Ariz. (Nov. 28, 2004) -- Emmitt Smith was knocked out of the game against the New York Jets in the first quarter with a toe injury."}
{"label":1,"sentence":"Mutu #39;s failed drug test confirmed by player #39;s union Chelsea striker Adrian Mutu failed a drug test, the English players #39; union confirmed Monday. The Romanian could face a ban of up two years from domestic and international soccer."}
{"label":1,"sentence":"Souness won #39;t  #39;give up #39; on Bellamy Newcastle manager Graeme Souness has accepted Craig Bellamy #39;s apology after their training ground bust-up - but warned the striker he has to play by his rules."}
{"label":1,"sentence":"Canas, Lopez Advance to CA Trophy Final (AP) AP - Argentina's Guillermo Canas beat Tommy Haas of Germany 6-4, 6-3 Saturday to advance to the final of the CA Trophy."}
{"label":1,"sentence":"Matters of great import The hybridization of European soccer might have improved the game on the continent, but it is also highlighting the lack of emphasis on player development."}
{"label":1,"sentence":"Federer enters record books with US Open win Federer was close to perfection as he raced through the first set in 18 minutes, dropping only five points. Hewitt fought back winning a tie-break in the second, before Federer stormed through the third to "}
{"label":1,"sentence":"Second-ranked Tigers biggest challenge of the year for Tide Tuscaloosa, AL (U-WIRE) -- There #39;s good and bad news for Tide fans coming into this year #39;s Iron Bowl. The good news is that during the past three years, whenever the Auburn Tigers have defeated the Georgia "}
{"label":2,"sentence":"Amar Singh urges Kokila Behn to resolve RIL issue Samajwadi Party leader Amar Singh has appealed to Dhirubhai Ambani #39;s widow Kokilabehn to settle the differences between her sons Mukesh Ambani and Anil Ambani who run India #39;s largest private sector company."}
{"label":2,"sentence":"US Air, Pilots to Reopen Concession Talks US Airways Group Inc. (UAIR.O: Quote, Profile, Research) and its pilots union agreed late on Friday to reopen concession talks after leaders of the labor group declined "}
{"label":2,"sentence":"Time Warner, Sony Still Courting MGM Industry talk over the potential sale of Metro-Goldwyn-Mayer might have subsided in recent weeks. But despite summer vacation season, Time Warner Inc."}
{"label":2,"sentence":"At IMF, US bows to pressure to forgive debt WASHINGTON With public pledges and in private conversations, Britain managed to smoke out the United States and win its commitment to the full forgiveness of the debts of the poorest countries during the annual meetings of the World Bank and the "}
{"label":2,"sentence":"Tivo, Netflix star in double feature Two Silicon Valley companies that have already become household names in tech savvy homes are working together to bring movies to the home digitally."}
{"label":2,"sentence":"Export earnings weigh on Nikkei Tokyo #39;s Nikkei average slipped 0.85 percent to finish at a three-week closing low on Thursday as a fall in the dollar further weakened investors #39; confidence in company earnings, prompting selling of exporters such as Honda Motor."}
{"label":2,"sentence":"Europe #39;s Trichet Blasts Low Dollar, Hedges on Intervention European Central Bank president Jean-Claude Trichet today repeated that the euro #39;s rise against the dollar is unwelcome and said intervention in foreign exchange markets  quot;is a weapon quot; that is available to central banks."}
{"label":2,"sentence":"Viacom Posts a Loss on Charges  NEW YORK (Reuters) - Viacom Inc. &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=VIAb.N target=\/stocks\/quickinfo\/fullquote\"&gt;VIAb.N&lt;\/A&gt;&lt;VIA.N&gt; on  Thursday posted a quarterly loss on charges related to the  spinoff of video rental chain Blockbuster Inc.&lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=BBI.N target=\/stocks\/quickinfo\/fullquote\"&gt;BBI.N&lt;\/A&gt;, but  cable network advertising sales and profits rose strongly."}
{"label":2,"sentence":"EU warns Italy on Alitalia stake The Italian state must give up its majority stake in troubled Alitalia when the airline sells new shares, the EU warns."}
{"label":2,"sentence":"Banknorth deal good for consumers, analyst says Canadian control of Banknorth Group Inc. is likely to be good for consumers on this side of the border, an analyst said yesterday after confirmation that TD Bank Financial Group is to become majority shareholder in Banknorth Group Inc."}
{"label":2,"sentence":"Nortel trims layoff plan Telecommunications equipment maker Nortel Networks will not lay off as many employees as it previously predicted, the company said Thursday."}
{"label":2,"sentence":"Custom-made-- in China Custom-designed imported furniture was once an exclusive realm. Now, it's the economical alternative for commercial developers and designers needing everything from seats to beds to desks for their projects."}
{"label":2,"sentence":"UC settles one Enron suit Bee Staff Writer. The University of California, negotiating on behalf of Enron Corp. investors, reached a \\$222.5 million settlement Friday with the Lehman Brothers brokerage firm over its part in the multibillion-dollar Enron debacle."}
{"label":2,"sentence":"ONGC #39;s 10th acquisition abroad Public sector behemoth Oil and Natural Gas Corporation Ltd on Monday said it has acquired an offshore oil field in Western Australia."}
{"label":2,"sentence":"51-49 stakes seen in \\$36 billion plan; rival bid could surface Although a Sprint-Nextel combination is being characterized as a \\$36 billion merger of equals, published reports describe the emerging transaction as a purchase by Sprint."}
{"label":2,"sentence":"Wal-Mart Sales Estimate Boosts Sector  NEW YORK (Reuters) - Wal-Mart Stores Inc. &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=WMT.N target=\/stocks\/quickinfo\/fullquote\"&gt;WMT.N&lt;\/A&gt;, the  world's No. 1 retailer, on Monday said December sales would be  at the top end of its prior estimate on better-than-expected  post-Christmas spending, driving its shares up 2 percent."}
{"label":2,"sentence":"Sumitomo Mitsui launches hostile bid of \\$29.2 billion for UFJ &lt;b&gt;...&lt;\/b&gt; NEW YORK, August 24 (New Ratings) - Sumitomo Mitsui Financial Group announced a hostile takeover bid today of \\$29.2 billion (3.2 trillion) for UFJ Holdings Inc (ticker: UFJ)."}
{"label":2,"sentence":"2nd UPDATE: HK Govt Land Sale Sets Post- #39;97 Price Record HONG KONG (Dow Jones)--A post-1997 price record was set Tuesday at a Hong Kong government land sale, reflecting the bullish outlook of property developers for the residential market after several lean years."}
{"label":2,"sentence":"Gold Fields calls for halt to Harmony bid Harmony Gold #39;s (HAR) offer and to vote in favour of the transaction with Canada #39;s IAMGOLD.  quot;Over the past six weeks you have been inundated with misinformation in support of Harmony #39;s value destroying, hostile "}
{"label":2,"sentence":"Stocks are little-changed in the early going NEW YORK Wall Street is sorting through the latest earnings news and stocks are narrowly mixed. The Dow Jones Industrial Average is up three points in today #39;s early going."}
{"label":2,"sentence":"Santander To Cut 3,000 Jobs Spain #39;s Banco Santander Central Hispano is expected to announce today that it will cut up to 3,000 jobs at Abbey National if it succeeds with its agreed bid for the UK bank, the Financial Times reported."}
{"label":2,"sentence":"Sprint, Nextel Announce Merger Plans Sprint Corp. and Nextel Communications Inc. announced this morning that they will merge the companies in a deal that would create a new wireless telecommunications giant.&lt;br&gt;&lt;FONT face=\"verdana,MS Sans Serif,arial,helvetica\" size=\"-2\" color=\"#666666\"&gt;&lt;B&gt;-The Washington Post&lt;\/b&gt;&lt;\/font&gt;"}
{"label":2,"sentence":"Executive's death stuns State Street  The chief executive of State Street Global Advisors, Timothy B. Harbert, died of a heart attack on Tuesday night, the company said yesterday. He was 53."}
{"label":2,"sentence":"Retailer's Share Up on Wal-Mart Interest (AP) AP - Shares of Japan's troubled supermarket chain Daiei Inc. soared 27 percent Thursday following reports that U.S. giant Wal-Mart Stores Inc. planned to submit a proposal for turning the company around."}
{"label":2,"sentence":"Smart Web Changes World The Gartner-sponsored ITXpo symposium in France sets itself to identify long-term technology trends that are altering sectors like travel, marketing and investing. More web-enabled mobile devices and a smarter internet are key players."}
{"label":2,"sentence":"Merck faces threat of 10bn actions Merck, the beleaguered US pharmaceuticals group, could be forced to pay out as much as \\$18bn (9.7bn) over 10 years as a result of lawsuits linked to Vioxx, its controversial arthritis drug."}
{"label":2,"sentence":"Oil Prices Dip Toward  #36;54 (Reuters) Reuters - Oil prices slipped further below  #36;55\\a barrel on Tuesday, breathing easier after a Norwegian strike\\threat receded but still anxious over the thin state of\\pre-winter heating oil supplies."}
{"label":2,"sentence":"After Circulation Scandal, a Move to Build Trust Belo Corporation has set aside \\$23 million to compensate advertisers for exaggerated circulation figures at The Dallas Morning News."}
{"label":2,"sentence":"Finance: It's Almost January, Already  WASHINGTON (Reuters) - Here's a mnemonic device for the  season: When you think about carving your pumpkins, get ready  to pare your taxes."}
{"label":2,"sentence":"Verizon Betting on A Bundle Verizon Communications Inc., the nation #39;s largest telephone company, announced yesterday it is digging up streets and stringing wire in six states, including Washington #39;s Maryland and Virginia "}
{"label":2,"sentence":"Poll: Money Managers Bullish on Stocks More than 56 percent of US money managers are  quot;bullish quot; or  quot;very bullish quot; about the US stock market near term, forecasting stocks will move higher in the next eight months, according to a new Barron #39;s poll."}
{"label":2,"sentence":"Macquarie Buys NTL #39;s Tower Assets for 1.27 Bln Pounds (Update1) A Macquarie Communications Infrastructure Group-led consortium bought NTL Inc. #39;s antenna towers business in the UK for 1.27 billion pounds (\\$2.47 billion)."}
{"label":3,"sentence":"Intel Gives Centrino a Speed Boost the Pentium M 765 -- runs at a speed of 2.1 GHz and has 2 MB of cache. The Pentium M 765 also features Enhanced Intel Speedstep, designed to optimize application "}
{"label":3,"sentence":"RealNetworks Sells Three Million Songs Through Promotion RealNetworks Inc. on Thursday said the three-week cut-rate promotion on its online music store garnered sales of more than 3 million songs."}
{"label":3,"sentence":"Ramjet aims at record Mach 10 speed NASA will attempt to set the world speed record for an air-intake engine tomorrow. The X-43A Hyper-X is a supersonic ramjet that may lead to more efficient launch vehicles and missiles in the future."}
{"label":3,"sentence":"IBM Tops IT Loyalty Survey NEW YORK - These days, technology providers take nothing for granted, especially their customers: There are plenty of stories of providers going to extraordinary lengths to win and keep customers."}
{"label":3,"sentence":"Google rumoured to be planning Internet Explorer rival LONDON - Google could be planning to launch a web browser to challenge the dominance of Microsoft #39;s Internet Explorer, according to widespread industry speculation."}
{"label":3,"sentence":"2004 fourth hottest since records began The year 2004 was the fourth hottest ever recorded and the past decade was the warmest since measurements began in 1861, the World Meteorological Organisation said Wednesday."}
{"label":3,"sentence":"Oceans to Rise One Meter by 2100-Arctic Expert Global warming (news - web sites) is melting the Arctic ice faster than expected, and the world #39;s oceans could rise by about a meter (3 feet "}
{"label":3,"sentence":"Kanoodle and TypePad \/ Movable Type Partner for Sponsored Blogs Kanoodle and TypePad \/ Movable Type Partner for Sponsored Blogs\\\\Kanoodle, sponsored listings provider, and Six Apart, the maker of Movable Type and TypePad blog software, today announced that the companies will offer TypePad subscribers the ability to easily add Kanoodle's content-targeted sponsored links to their sites.  This marks the ..."}
{"label":3,"sentence":"WebMethods names new CEO, chairman The company promotes from within--Chief Operating Officer David Mitchell is appointed CEO."}
{"label":3,"sentence":"Microsoft offers insurance Linux can #39;t, Ballmer says An e-mail Microsoft Chief Executive Steve Ballmer sent to customers around the world yesterday highlighted a new thrust in Microsoft #39;s campaign against Linux."}
{"label":3,"sentence":"Novell files additional lawsuit against Microsoft Less than a week after collecting a \\$536 million settlement from Microsoft, Novell filed another lawsuit, as expected, accusing the software giant of violating antitrust laws."}
{"label":3,"sentence":"Regaining Fury, Hurricane Ivan Churns Toward Cuba Hurricane Ivan will pass near or over the western tip of Cuba today. The powerful Category Five storm, which has already claimed 65 lives, will bring devastating winds and a potential storm surge of 20 feet (6 meters) or more."}
{"label":3,"sentence":"Intel programming tools reach new 64-bit chips They let developers create software that supports 64-bit x86 chips--important in making the new generation of chips useful."}
{"label":3,"sentence":"Infineon execs get to serve time over price-fixing Four senior executives of German chipmaker Infineon Technologies will serve jail time and pay steep fines for their role in a scheme to fix prices in the memory chip market, said the US Department of Justice."}
{"label":3,"sentence":"Conway's golden handshake PeopleSoft's ousted CEO walks away with a severance package in excess of \\$16 million."}
{"label":3,"sentence":"SpaceShipOne rockets in NEW ERA A red, white and blue rocket plane zoomed into space Monday, winning a \\$10 million prize as the world #39;s first privately built reusable spacecraft and heralding the future of commercial space travel."}
{"label":3,"sentence":"Speakers debate RFID benefits, challenges BALTIMORE - While speakers at the EPCglobal Inc. U.S. conference Wednesday talked up the benefits of radio frequency identification (RFID), analysts watching RFID adoptions said many U.S. companies are still waiting to see a clear reason to adopt the technology."}
{"label":3,"sentence":"HP showcases financing Company lets businesses and governments obtain products at \"low lease rates\" or defer payments until January at no extra cost."}
{"label":3,"sentence":"'Doom 3' Game Unlikely for Xbox This Year - id CEO (Reuters) Reuters - The Xbox version of \"Doom 3,\" the\\long-awaited PC video game recently released to wide acclaim,\\is not likely to be released in 2004 dealing a blow to\\enthusiastic game players who are anxiously awaiting it."}
{"label":3,"sentence":"O2 and Nortel demo super-fast wireless broadband O2 and Nortel have completed live mobile test calls using an emerging technology known as High Speed Downlink Packet Access (HSDPA), which the firms claim is three times faster than today #39;s commercial 3G networks."}
{"label":3,"sentence":"Web Site Helps Compare Gasoline Prices (AP) AP - Hate it when you fill 'er up and, five minutes later, spot another station selling gas for a nickel a gallon cheaper?"}
{"label":3,"sentence":"3,000-Year-Old Bodies Studied in Australia (AP) AP - Headless bodies buried 3,000 years ago in the oldest cemetery in the Pacific could reveal much about the earliest settlers of Vanuatu, Fiji and Polynesia, Australian archeologists said on Friday."}
{"label":3,"sentence":"Online Auction to Offer a Bit of Chicago to Bidders Chicago-related items and experiences will be up for sale Dec. 2 to Dec. 16 on eBay as part of an effort to raise money for arts and cultural programs in the city."}
{"label":3,"sentence":"Sun networking foray begins this month Server and software company prepares new foray into market for dot-com infrastructure."}
{"label":3,"sentence":"Apple hints at colorful computer plans Will the company's next PC look like a Christmas tree? A patent filing sheds some light."}
{"label":3,"sentence":"Users buoyed by monthly patch releases Despite Microsoft's release of 10 new software patches, IT managers said the monthly patching approach that the company has been using for the past 12 months is making it easier for them to keep their systems up to date on fixes for security vulnerabilities."}
{"label":3,"sentence":"Apple adds single-processor Power Mac G5 1.8GHz (MacCentral) MacCentral - Apple on Tuesday added a 1.8GHz single-processor Power Mac G5 desktop computer to its arsenal. The US #36;1,499 system is offered alongside dual-processor computers running at 1.8GHz, 2.0GHz and 2.5GHz."}
{"label":3,"sentence":"KPMG witness takes stand in Kazaa trial It is possible to trace users sharing unlicensed music files through their IP address, the Federal Court was told today by the major music labels #39; first witness in their civil case against peer-to-peer software provider Sharman Networks."}
{"label":3,"sentence":"Amendment 37 puts energy bills at risk We look forward to the day when renewable energy accounts for a quarter, half or even three-fourths of Colorado #39;s electricity supplies."}
{"label":3,"sentence":"HP Shelves Virus Throttler Security service was discontinued because of compatibility problems with Windows."}
{"label":3,"sentence":"How Secure Is Your Computer? A nationwide inspection shows Internet users are not as safe online as they believe. The inspections found most consumers have no firewall protection, outdated antivirus software and dozens of spyware programs secretly running on their computers."}
{"label":3,"sentence":"Help for lost and stolen phones A national database is being set up to help return lost and stolen phones to their rightful owners."}
