{"label":0,"sentence":"I purchased a Living Social 4 pack special.  I was able to receive 3 out of the 4 treatments before the final closing.  The girl administering the pedicures was a sweetheart but the polish never lasted more than a week.  I agree with some of the other clients that the atmosphere was noisy or not professional at times.  I had a 4th appt and never received a confirmation call.  I decided to call to confirm and was told I should have received a call from the salon to cancel since that area of the salon had experienced a flood, and that they would call me to reschedule and that I would not lose my deal.  It's been a few weeks so I decided to call today and found out the salon has been permanently closed.  I could see this coming which is why I'm writing the review in case you ever decide to re-open you can learn from the mistakes made.  I understand you are trying to make right all the deals still out there.  Just in case I wanted to let you know that a refund for me is not necessary and I wish you all the best."}
{"label":0,"sentence":"The wait staff were amateurs, I hate having too ask for refills & anything add'l. Our yamakake bowl should come with shoyu but we had to ask for it, we had to ask for small plates to share the dishes, quite frustrating. \\n\\nThe food was very bland & needed more flavor. The portions did not fit the prices. I'll be willing to give them another chance but I'll wait a while so they get more experience."}
{"label":0,"sentence":"Make sure you ask them how their Peking duck is made to order. I order a WHOLE PEKING DUCK to have for my thanksgiving meal with my family. Apparently they make their different with only half duck worth feeding 2 people then the rest is minced with lettuce wraps. That isn't what I wanted. Then had to go thru a process to get a manager just to get a roasted ducked. They need to update tire menu with a better description"}
{"label":0,"sentence":"The sandwiches were delicious, but super greasy, I was shocked because it used to be so light at the other location. Have they under new management? I really wanted something healthy, and this was definitely not it."}
{"label":0,"sentence":"I have heard several people talking about this place the last few weeks, so I thought I would give it a go.\\nI love that the Camelback corridor is blooming with new restaurants, but no need to go back to this one.\\n\\nPRO's:\\nThe restaurant, cafeteria style, is extremely clean! Awesome!\\nThe menu, several options to the core styles of Mexican dishes (ie: burros, tacos, etc)\\nAround $8 for a generous meal for one...not bad!\\n\\nCON's:\\nService is slow.  Going through the line of 'fixings' takes a while.\\nIf you want lettuce in your burro, prepared to have it on the side.  They make your burrito with choice of meat, cheese, beans, then 'nuke' it in a conveyer belt toaster oven. (really)?\\nI asked for lettuce in my burrito, and they said they put it on the side as to not send it through heater.\\nTortillas made there...but nothing to write home about\\n\\nIt's not a terrible place to go...just nothing worth having a frequent visitor punch card there.\\nI would suggest Panchero's (exact SAME concept) over Cafe Rio."}
{"label":0,"sentence":"Car wash always has issues with equipment.  Poor suction on the vacuums.  Oil sprayed all over the bottom of my vehicle from the tire polisher which I did not even pay for.  Cleaning equipment seems to always miss parts of the vehicle."}
{"label":0,"sentence":"Posted a review about a month ago and looks like it has disappeared.  Anyway the pulled pork was terrible, it wasn't even warm. It definitely was not cooked that day or even the day before, it was sitting under a heat lamp. The beans were also not good at all, had no flavor except for salt. Found a hair at the bottom of the beans too. Long story short eating here was a big regret and led to some serious toilet time."}
{"label":0,"sentence":"The toong tong was a decent appetizer and the pad ke-mao was a good entree, but the pak rad kang (with chicken added) was a disappointment. All in all, the food was fine. Not special, but not terrible either.\\n\\nThis rating would've been higher--that is, 3 or even 4 stars--had the service come a little closer to living up to the hype in other reviews. As it was, we had a 7pm reservation and were seated promptly upon arrival, but no one came to our table for a full 20-25 minutes after being seated, despite several tables sitting empty (and uncleaned) around us. Had the place been full, it would've been more understandable. But it was kind of ridiculous how good they were at ignoring us as we pleaded nonverbally for at least a strong beverage to pass the time.\\n\\nIncidentally, when it came time for the check, they were very attentive all of a sudden."}
{"label":0,"sentence":"This place \\\"\"USED TO BE GREAT.\\\"\"  All the good senior stylist like Ulda, Mahee, Elaine, Victoria, etc...are gone. Someone told me that Victoria's over at Great clips and Elaine's at Beauty Essence.  Look for them there and stay away from Supercuts."}
{"label":0,"sentence":"go back to the days of standing in the 3rd grade lunch line. you are served up a weird textured burger on plain bun and it is so nasty you eat just enough to make it until you get to go home and not too much in order to prevent death by cafeteria food. this was very similar. even in the awkward freezer burn then microwaved scent. want to relive the elementary lunch room? take a visit here. \\n\\ni really hate to give 1 star but the entire hamburger and fries had to be trashed. so nasty.\\n\\nIf someone suggests going to Rallys for a burger you better scream no!!!!!!! \\n\\nI was hopeful, I had been a few times, never impressed but never disgusted, but i also wasn't paying attention bc i try to only eat at places like this if i'm in a hurry.\\n\\ntoday, i was disgusted. I don't know if my senses were on height or something but this food was stinky. i have a thing about microwaves and these burgers tasted and smelled microwaved. I'm not sure if they were but i don't care, that's even worse if they werent. the meat was kinda grey and the tomatoes were colorless. \\n\\nI always upgrade my drink to a large and they asked if i would like to rally my fries. i stupidly made the assumption that this meant large fries and usually places charge you less if you upgrade both, so i said yes. let me tell you what it REALLY means. it means they are going to put every nasty condiment on your fries and serve them to you with a spork. \\n\\nafter throwin my burger out i figured i could at least eat the fries(this was before i knew that they had been 'rally'ed up) \\n\\ni KNEW i could smell mayonnaise somewhere. i HATE mayonnaise. these fries were soaking in mayonnaise, and a bunch of other slop. I didnt take a very long look at all of the nasty things on top bc i had to trash it before i threw up. \\n\\nmy goodness it was so gross. i can't even handle how gross it was."}
{"label":0,"sentence":"Stopped in for plain-stationery. There's a sandwich-board and window painting advertising that they sell stationery. As this is so hard to find now days, I figured it would be a good local business to support.  I was sadly mistaken.  I was quickly informed that they did not sell stationery, despite protests from myself to the contrary and was quickly ushered to the door.  Apparently I wasn't going to drop enough money to get much attention."}
{"label":0,"sentence":"One of the worst check ins. Guess that Trump sucks. No matter the rest of the experience not much can redeem when it starts off poorly. Immediately I'd choose somewhere else when next in Vegas. Not like there's no choice in this city.\\n\\nThere's no casino, no smoke and the bathroom has a Jacuzzi which was big and the main plus point. From there it goes downhill.\\n\\nValet parking would be nice if it wasn't 15-20mins from giving your ticket stub to getting your car. It just doesn't work. Thankfully the mall is just across the road so that's somewhere you can park if you are more in a hurry.\\n\\nThe lobby wasn't bad and there's a nice semi corridor to get to your room. But when you look at the room (perhaps that's not expected) you notice all sorts of wear and tear and you can tell corners have been cut as this alleged 5 star hotel. Gouges in furniture, scratches, wires dangling. Not great.\\n\\nIf you are facing towards Circus Circus then you have another double whammy. The windows are not sound proof enough. You will hear freight trains go by who blast their horns. Then when you want to lie in, the pool music (assuming this is where the noise comes from) also drifts upward and into the room.\\n\\nDisappointing. Very disappointing. CP much better considering it's \\\"\"lower quality\\\"\".\\nYou have been warned."}
{"label":0,"sentence":"I don't think it's fair to judge a casino on how much you win....  But it is fair to judge them on how they set up the games. \\n\\nCasino Arizona uses five decks for blackjack instead of the standard six. They also use a continuous shuffling machine..... Which raises the house edge and gets about 20% more hands dealt per hour. That's total crap. \\n\\nPlenty of people gamble just for fun but if the casino employees aren't nice it takes a lot of the fun out of it. At Casino Arizona the dealers aren't nice and the waitresses aren't hot.\\n\\nWith all of the other casinos in the valley there's no reason to go to this one."}
{"label":0,"sentence":"I'm still undecided if I like this place. Yes it's all women but it's not very personal. I feel like one of many here. You don't really see the same Dr., Nurse, or PA here. They also have mammography now in office and it wasn't very professional. Took me forever to get my results. I had to call and get them. It was in a tiny room in the back, like they converted a closet! I'm going back to SMIL for my mammograms. Still unsure if I'll stay at Valley a women for Women."}
{"label":0,"sentence":"It's okay, I honestly don't see what all the hype is. I've been here twice. The first time was at lunch and I had a taco and an enchilada that tasted like the sauce was out of a can and uncooked. The second time for dinner was better. I had a skirt steak, which was good, but nothing I'd rave over. I miss El Jeffe's (creativity and flavor).\\n\\nOn the upside, the view is incredible. The service was alright and yes, the restaurant is loud, but you have to blame that on the previous owners that built the horrible Italian restaurant that was there."}
{"label":0,"sentence":"Ate here with my husband in February of 2010. We are Thai food enthusiasts.\\n\\nAll I can say is: Don't bother!"}
{"label":1,"sentence":"Lemon grilled shrimp tacos are unbelievable"}
{"label":1,"sentence":"While on travel to Goodyear, AZ, two of us had a wonderful meal here. The only bad part was the Yelp directions (hint: it's inside the hotel).\\nI had the Buffalo Filet, which was wonderful! Perfectly seasoned and cooked exactly as ordered. The Desert Sweet Corn Souffl\\u00e9 was unusual and delicious. For dessert the Vanilla Bean Cr\\u00e9me Brulee was warm and crunchy and almost too much for two."}
{"label":1,"sentence":"Who would have thought you could find amazing Cajun food in this small, hole in the wall?  We ordered the gator bites, they were fried and pretty hood.  But let's face it, more of a experience than a gourmet item.  I had the fish and grits and my friend had the chicken carbonara, both were phenomenal!  Huge portion, just right amount of spice, great piece of sweet cornbread to sop it up.  Skip the chains, try something new, support locals!"}
{"label":1,"sentence":"solid coffee.. solid sandwiches.. perfect for a hangover\\n\\nthe desserts is food porn and you know you want get dirty.."}
{"label":1,"sentence":"If you want:\\n1) you want a simple manicure\\n2) you want it quick\\n3) you want it cheap\\n\\nThen I highly recommend Uni Hair and Nail Salon, because they do all these things in a clean and spacious environment. Their location close to campus also makes them super convenient. I've gone to get a full set of french tips and both times I was very happy with the quality and the price. The staff here is nice and makes everything hassle free.\\n\\nThat said, I got my first pedi there today and I personally wouldn't come back to them for another, just because my feet didn't seem much improved afterward. I was hoping they'd get rid of some calluses but they didn't... so I took a PedEgg to these calluses after my visit and was able to get rid of them without a lot of effort. Knowing that, I feel that they could have tried harder and done a better job on my feet. But if your feet are in nice condition to begin with, I guess they do a decent pedicure--just nothing exceptional."}
{"label":1,"sentence":"Fantastic gelato!  Locally sourced ingredients and a staff\/ownership that truly cares for their product. Move aside froyo!"}
{"label":1,"sentence":"Pomegranate Margarita with sea salt foam.  To go, pleez."}
{"label":1,"sentence":"I was surprised. I had modest expectations that were summarily surpassed.\\n\\nI had the 22 oz bone-in ribeye and it was outstanding. From the ranch of the M Resort owners. It was tender, juicy and flavorful.\\n\\nJust a little less expensive than the high-end meat joints on the strip....steak in the 40s instead of 50s. But worth it.\\n\\nWine list is good, not great; but workable. Service was very good. \\n\\nThis goes on my list of first-rate Vegas steakhouses.\\n\\nJust opened so they're eager to please."}
{"label":1,"sentence":"This place is pretty nice.  Looks relatively new and is pretty clean.  Good spots to eat and shop.  Terminal is easy to navigate.  I would not be upset if I had a layover here in the future."}
{"label":1,"sentence":"Decided to have breakfast at the Bistro after getting a delicious iced caramel macchiato the day before. I ordered the chocolate waffles with Nutella & caramelized bananas with a cappuccino. OMG, it was one of the best breakfasts I've ever had! The waffles were cooked perfectly and light as air & the Nutella, bananas and whipped cream on top sent it over the edge. Cappuccino was amazing too. \\n\\nGot a package of 6 macarons at the Patisserie- $10 for six which wasn't bad, the sizes were very inconsistent though. I got one giant pistachio and a small chocolate, vanilla, coffee, rasp lychee & passionfruit. The flavors were very good, coffee being my favorite. I wish I had room to try their gelatos & pastries, they looked incredible."}
{"label":1,"sentence":"A forward thinking , family orientated , Community minded efficiently run establishment that roasts and serves GREAT coffee with efficiency , promptness and pleasure! \\nBottom line ---- THE BEST ONE CAN GET !"}
{"label":1,"sentence":"I've gone to the Glendale location several times over the past 2-3 years. I've also been to their Mesa location, but not in 5 years.\\nI go to watch WWE pay-per-view. At least 5 times a year. I haven't tried it any other time. There's always a good crowd for wrestling events. We have fun.\\nO'Sullivans is large and has plenty of seats. Lots of TVs of various sizes. Bar is well-stocked. I love Black & Tans (Guinness and Bass). They don't sell Bass, so I settle for Smithwick's, a BlackSmith. \\nGood food selection. I typically don't experiment with food, I order what I know I'll like. Their meatloaf and shepherd's pie is great. Ribs are o.k. Nacho platter is loaded.\\nOnly problem that I've had, and this has happened on 3 different occasions, is waitress service. First time, during a period when there wasn't a lot of customers around me, I waited 20 minutes to be served. And that was after I notified the manager. He gave me a free drink. Second time, it took 10 minutes. A few weeks ago it happened again. It was very busy and I waited about 8 minutes. Plus waitress brought me the wrong sized drink. \\nI'll continue to go to R.T. O'Sullivans and report the status of their wait staff."}
{"label":1,"sentence":"A modest diner?  In appearance only.   The food manages to be both gourmet and accessible.   We were told that the matzoh ball soup was the chef's grandmother's recipe and indeed, it tasted homemade - meant in a most delish way.  Also loved the squash side dish.  And my fish.  AND, oh my, the pie!\\n\\nThe five stars were also earned with great service and a wide selection of drinks - though I'm sure it wasn't just the Jameson's that made me love this place.  Now I just want them to move to Denver, where I live.\\n\\nOk, ok, I'll stop now."}
{"label":1,"sentence":"The product was great! We went with the less expensive, cotton Gilden shirt and it was perfect. We worked with Cameron who was super attentive and helpful. When we needed to change our order he went above and beyond to help our group. I would definitely go back. The shirts are great and the customer service is amazing as well!"}
{"label":1,"sentence":"This place is a new favorite for me and my husband! We were due with our first baby and wanted to try a new restaurant for our last date without kids. We saw that it had awesome reviews and decided to try it out. We were NOT disappointed! They make their own mozzarella daily and you can tell; fantastic. We have been back multiple times. That staff has always been friendly and accommodating, they use iPads and iPhones to write down your orders. As far as the building, it's so cute and relaxed.  They have a lot of options when it comes to wine and beer. (They even have root beer on tap and a great root beer float I might add) Food wise: the personal pizzas are big enough for me to share with someone and the perfect amount for my husband to eat it on his own. Their pesto veggie pizza is to die for and their pepperoni is awesome as well. I liked building my own pizza too. I've also had their stuffed mushrooms (that have mozzarella, sausage, and some other stuff) and their antipasto salad which I will DEFINITELY have again next time.  This place is priced very reasonably, too! A great date night option!"}
{"label":1,"sentence":"Every time I come to Vegas this is my MUST EAT BUFFET! Just think $50 for all the seafood you can eat! This last time we came they had, snow crab, shrimp, raw oysters, and mussels. They also various hot dishes with shrimp, crawdads, crab, and even lobster! I can stay here for hours just eating away, but then that would mean no room for another buffet while in Vegas! lol \\n\\nIt may be a bit off the strip and you will need to take a cab, but I guarantee it's worth it."}
