{"label":0,"sentence":"Abdication Secures Cambodian Peace -Sihanouk King Norodom Sihanouk said on Tuesday his decision to abdicate gave Cambodia a chance to choose a successor in his lifetime and thus avoid another bloodbath."}
{"label":0,"sentence":"Resistance Rages to Lift Pressure Off Fallujah BAGHDAD, November 12 (IslamOnline.net  amp; News Agencies) - As the US military continued Friday, November 12, their massive sweep of Fallujah, resistance attacks were remarkably intensified across the war-torn country, in an effort to alleviate the "}
{"label":0,"sentence":"Motor Racing: Panis Reaches the End of the F1 Road &lt;p&gt;&lt;\/p&gt;&lt;p&gt; By Alan Baldwin&lt;\/p&gt;&lt;p&gt; LONDON (Reuters) - Olivier Panis, the oldest driver andonly Frenchman on the Formula One starting grid, says farewellto grand prix racing in Japan this weekend.&lt;\/p&gt;"}
{"label":0,"sentence":"Barghouti Release Would Reward Terror consecutive life terms, plus another 40 years, by an Israeli civil court that found him guilty of five cases of murder of innocent citizens, attempted murder and membership in a terror organization."}
{"label":0,"sentence":"Arms hold key as Ulster deal deadline is put back Sinn Fin #39;s president, Gerry Adams, last night placed responsibility for clinching an agreement to restore the power-sharing executive in Northern Ireland firmly in the hands of the British and Irish government - despite the enduring barrier of mistrust "}
{"label":0,"sentence":"HK Votes in Close Poll, Focus on More Democracy Hong Kong residents voted on Sunday in a legislative election seen as a referendum on greater democracy and a test of popularity for China #39;s communist rulers in the former British colony."}
{"label":0,"sentence":"UK and US defy UN over Iraq election By James Cusick, Westminster Editor, and Zainab Naji in Baghdad. The British and United States governments are on course for another confrontation with the United Nations over the proposed elections in Iraq."}
{"label":0,"sentence":" #39;Morgan wants four pillars #39; on reform agenda THE Federal Government #39;s control of both houses of parliament created a rare opportunity to overhaul the four pillars banking policy, Westpac chief executive David Morgan said yesterday."}
{"label":0,"sentence":"McKenry doesn #39;t back Scrafton: PM Prime Minister John Howard said a former public servant had not backed the claims by former adviser Mike Scrafton about the children overboard affair. "}
{"label":0,"sentence":"Panama state of emergency after fatal mudslides Panama declared a state of emergency on Saturday, a day after torrential rains and mudslides killed at least 14 people and wrecked or damaged the homes of about 10,000 people."}
{"label":0,"sentence":"Iran given last chance to halt uranium enrichment VIENNA - Senior officials from France, Britain and Germany will meet Irans top nuclear negotiator in Vienna on Thursday to offer Tehran a final chance to halt uranium enrichment plans or face possible UN sanctions."}
{"label":0,"sentence":"Ivan Devastates Grenada, Kills at Least 12 ST. GEORGE'S, Grenada - The most powerful hurricane to hit the Caribbean in nearly a decade killed at least 12 people in Grenada, damaged 90 percent of its homes and destroyed a prison that left criminals running loose, officials said Wednesday..."}
{"label":0,"sentence":"N.Irish 'Bloody Sunday' Probe Enters Final Phase  LONDONDERRY, Northern Ireland (Reuters) - The  longest-running and costliest public inquiry in British legal  history -- into Northern Ireland's so-called \"Bloody Sunday\" --  entered its final phase on Monday."}
{"label":0,"sentence":"Good Samaritans Aiding Hurricane Victims PUNTA GORDA, Fla. - Hundreds of local residents and some from across the nation have turned out to provide a vast array of free aid since Hurricane Charley ravaged the area on Aug..."}
{"label":0,"sentence":"Senate Allows Musharraf To Hold Duel Office General Pervez Musharraf to retain duel office-army chief and presidency- beyond December 31, 2004 amid opposition #39;s walkout. The bill, already passed by the National Assembly, was endorsed by the Upper-House "}
{"label":0,"sentence":"African Union to hoist 'Help Wanted' sign at poverty summit (AFP) AFP - How to create sustainable employment for impoverished, mostly illiterate African populations residing primarily in rural areas is the challenge the African Union aims to tackle at a summit opening Wednesday in Burkina Faso."}
{"label":1,"sentence":"Report: NHL agent loses certification According to a report in the Ottawa Sun, an NHL agent has lost his certification for leaking information about a players #39; association website to a reporter from a Minnesota newspaper."}
{"label":1,"sentence":"Ranieri believes victory to be turning point Valencia coach Claudio Ranieri believes that his side #39;s Champions League win at Anderlecht on Wednesday will be a turning point for his team, but believes they have to improve further if they are to qualify for the last sixteen."}
{"label":1,"sentence":"Giambi Returns To Yankees #39; Lineup Kansas City, MO -- New York Yankees first baseman Jason Giambi will make his first appearance since late July, as the former American League MVP was inserted in the starting lineup for Tuesday night #39;s game against the Kansas City Royals at Kauffman Stadium "}
{"label":1,"sentence":"Report: Kidd Not Expected Back Until December (Reuters) Reuters - New Jersey Nets guard Jason\\Kidd continues to recover from surgery on his left knee and\\will reportedly be sidelined until December."}
{"label":1,"sentence":"Kim fires 62 to take first-round lead SPRINGFIELD (Illinois): Christina Kim celebrated her parents silver wedding anniversary by firing a 62, matching her career best, here Thursday to take the first-round lead in the \\$1."}
{"label":1,"sentence":"NBA Nets' Mercer undergoes knee surgery (AFP) AFP - New Jersey nets guard Ron Mercer underwent surgery on his left knee, a procedure that is expected to sideline him for the next eight weeks of the National Basketball Association season."}
{"label":1,"sentence":"Clemens clocks Cards Astros 5, Cardinals 2, St. Louis leads series 2-1 Roger Clemens isn #39;t done yet, and neither are the Astros. Putting aside talk this might be his final game, Clemens focused on "}
{"label":1,"sentence":"Celtics' Broadcaster Taken to Hospital (AP) AP - Celtics longtime play-by-play television broadcaster Mike Gorman was taken to the hospital Monday night at halftime of Boston's game against Golden State with complaints of stomach cramps."}
{"label":1,"sentence":"Young gun Kovalainen puts Schumacher in shade PARIS (AFP) - Seven-time world champion Michael Schumacher found himself overshadowed as young Finn Heikki Kovalainen beat him on his way to winning the Race of Champions at the Stade de France."}
{"label":1,"sentence":"Carolina's Davis Will Not Face 49ers  CHARLOTTE, N.C. (Sports Network) - Carolina Panthers  running back Stephen Davis will miss his seventh game of the  season on Sunday when the club travels west to face the San  Francisco 49ers. Davis was officially listed as \"out\" on  Friday's injury report."}
{"label":1,"sentence":"MLB, players #39; union engage in steroid talks CBC SPORTS ONLINE - Major League Baseball players and owners are currently meeting to hammer out a deal that would toughen rules on steroid testing in baseball."}
{"label":1,"sentence":"O #39;NEILL STILL HARBOURS DREAM Celtic manager Martin O #39;Neill believes victory in Ukraine would put his side back on course for a place in the Champions League knock-out stages."}
{"label":1,"sentence":"Ryder-Monty gives Europe early advantage at Oakland Hills Colin Montgomerie drew first blood for holders Europe with a birdie-three at the first hole as the 35th Ryder Cup began at Oakland Hills under cloudy skies on Friday."}
{"label":1,"sentence":"Inzy proves hard to please Captain Inzamam-ul-Haq said Pakistan still had room for improvement after knocking India out of the Champions Trophy at Edgbaston."}
{"label":1,"sentence":"Carter vows full effort despite unhappiness In his first public statements since a trade demand last month, the Toronto Raptors star defiantly refused to soften his position yesterday, but insisted that he would still play hard for the team he wants to leave."}
{"label":1,"sentence":"Holliston is pushed by Rogers Coming into last night's showdown with undefeated Tri-Valley League rival Holliston, the Medfield Warriors had reason to be confident. They had been averaging more than 30 points per game, and they had the league's leading scorer in halfback Bryan Lee."}
{"label":2,"sentence":"US elections polling begins today WASHINGTON: Polling for the US elections will begin according to Pakistan time at 5:00 pm on Tuesday as Americans vote in one of the closest presidential elections in decades after a long and often bitter campaign between Republican incumbent George W "}
{"label":2,"sentence":"WHO Urges ASEAN to Curb Tobacco Trade The World Health Organization is urging Southeast Asian nations to strengthen curbs on tobacco trade. Shigeru Omi, the WHO regional director for the Western Pacific, told a conference of the Association of "}
{"label":2,"sentence":"Savvy grocers with a recipe for expansion Albertsons Inc., one of the nation's largest grocery chains, bought the Shaw's and Star Market chains for more than \\$2.1 billion in April to gain a foothold in New England and compete more aggressively against the region's top supermarket company, Stop  amp; Shop. Albertsons chief executive Larry Johnston and Shaw's president Nicola DiFelice spoke with Globe reporter Naomi Aoki."}
{"label":2,"sentence":"Gov #39;s plan to add 18 inspectors greatly inadequate The Romney administration is planning a \\$1.7 million, 18-job boost for the beleaguered agency that inspects amusement park rides, boilers and elevators, but a union official says at least "}
{"label":2,"sentence":"ARI sells \\$115m stake in Colorado Clothing and footware company Colorado Group Ltd today confirmed that Australian Retail Investments (ARI) had sold its \\$115 million stake in the company."}
{"label":2,"sentence":"Kelly: Perennial Winner Southwest In 14.1 Traffic Jump &lt;b&gt;...&lt;\/b&gt; Southwest Airlines (nyse: LUV - news - people ) on Friday said its traffic jumped 14.1 in November. The discount carrier carried 9.6 more passengers during the month than in the year-ago period."}
{"label":2,"sentence":"Banking on Christopher   Banks? Management keeps growing and buying back shares even as the retailer struggles."}
{"label":2,"sentence":"SEC: Fannie Fails Accounting Compliance (Reuters) Reuters - The U.S. Securities and Exchange\\Commission said on Wednesday the accounting practices of\\housing finance group Fannie Mae  from 2001 to mid-2004\\\"did not comply in material respects\" with certain accounting\\standards for derivatives, hedging and other matters."}
{"label":2,"sentence":"United Airlines Says It May Terminate Pension Plans (Update3) Aug. 19 (Bloomberg) -- UAL Corp. #39;s United Airlines, trying to attract financing to exit bankruptcy, said it probably will terminate and replace all its pension plans. "}
{"label":2,"sentence":"IMF gives Argentina one-year reprieve The International Monetary Fund (IMF) has given Argentina a one-year extension on repaying \\$US1.1 billion (\\$A1.58 billion) in debt."}
{"label":2,"sentence":"Insurers may drop thousands of homeowners as moratorium ends Come Dec. 1, many Floridians may find an unwelcome piece of mail interspersed between bills, holiday catalogs and greeting cards: a non-renewal or cancellation letter from their insurers."}
{"label":2,"sentence":"US 30-, 15-year mortgage rates rise in latest week Interest rates on US 30-year and 15-year mortgages edged higher this week amid signs the economy is improving, stoking inflation concerns, mortgage finance company Freddie Mac said on Thursday."}
{"label":2,"sentence":"Wal-Mart Profit Up, Raises Outlook  NEW YORK (Reuters) - Wal-Mart Stores Inc. &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=WMT.N target=\/stocks\/quickinfo\/fullquote\"&gt;WMT.N&lt;\/A&gt;, the  world's biggest retailer, posted a 13 percent rise in quarterly  profit on Tuesday and raised its outlook and expectations for  holiday sales, saying the economy was improving."}
{"label":2,"sentence":"Corporate directors seek tax break, say fees not  #39;employment &lt;b&gt;...&lt;\/b&gt; TORONTO (CP) - Members of corporate boards act as independent professionals, not employees, and this should be reflected in the taxation of their fees, a group representing directors says."}
{"label":2,"sentence":"SBC Offers \\$1.99 Per Month Wi-Fi Add-On SBC Communications Inc., the second-largest local phone company in the United States, said Monday it will offer wireless Internet service for \\$1."}
{"label":2,"sentence":"Shell to Spend More on North Sea Venture Royal Dutch\/Shell Group announced Wednesday that it would spend US\\$1.8 billion on exploration and production in the North Sea, including building a pipeline to transfer gas from Norway to Britain."}
{"label":3,"sentence":"Skulls trojan bites Symbian 60 p2pnet.net News:- Nokia 7610 smart phones, as well as other mobiles running Symbian Series 60 software, could be hit by the new Skulls malware."}
{"label":3,"sentence":"Pressure mounts on EDS over U.K. government IT system grows LONDON -- After continuous computer failures forced the top civil servant of the U.K.'s Department of Work and Pensions' Child Support Agency (CSA) to step down from his job this week, the government is considering scrapping a welfare case management and telephony system developed in large part by Electronic Data Systems (EDS)."}
{"label":3,"sentence":"Maryland's Technology Future Julie Coons, the president of the Technology Council of Maryland, discusses the organization and the region's technology community."}
{"label":3,"sentence":"PC Sector Sale By IBM Would Signal Change (washingtonpost.com) washingtonpost.com - Among corporate technology managers, it's one of the oldest adages: \"Nobody ever got fired for buying IBM.\""}
{"label":3,"sentence":"DoubleClick Signs on MSN to Use Its Rich Media Ads (Reuters) Reuters - A top executive for Web marketing\\company DoubleClick (DCLK.O) on Tuesday said Microsoft Corp's\\(MSFT.O) MSN Web portal will use its rich media ads online,\\paving the way for wider use of a key DoubleClick  product."}
{"label":3,"sentence":"Skype Delivers Mobile VoIP (NewsFactor) NewsFactor - Voice over Internet calling is now available for \\PDA users, with \\Skype Technologies officially launching software designed for handhelds running the Microsoft Windows Pocket PC operating system."}
{"label":3,"sentence":"Microsoft Files More Lawsuits over Spam Going after spammers rather than focusing merely on developing antispam technology is an important step, John Movina, spokesperson for the Coalition Against Unsolicited Commercial Email, said."}
{"label":3,"sentence":"PeopleSoft, Unfazed, Announces 5-Year Pact With I.B.M. PeopleSoft's partnership with I.B.M. is an attempt to show that it is moving forward aggressively despite the turmoil created by Oracle's hostile takeover bid."}
{"label":3,"sentence":"Portable playstation a hit in Japan The new PlayStation Portable (PSP) portable game console reportedly sold out at Tokyo electronic retailers within hours of its debut on Sunday."}
{"label":3,"sentence":"BOFH takes a hit from Cupid's arrow &lt;strong&gt;Episode 26&lt;\/strong&gt; Shall I compare thee to an OS2-free Intel box?"}
{"label":3,"sentence":"MSN Messenger 7 Beta: Sneak Review MSN Messenger 7 Beta: Sneak Review\\\\Just the other day I got hold of the beta version of this much hyped up upgrade to the very popular instant messaging client MSN Messenger 7.  I downloaded it onto a test machine and found that its download size of the beta is ..."}
{"label":3,"sentence":"Motorola to Invest  #36;90 Million in China R D Center (Reuters) Reuters - Motorola Inc. said on Friday it plans\\to invest  #36;90 million in a new research facility in Beijing as\\the U.S. mobile phone maker fights to wrest back top position\\in the domestic handset market."}
{"label":3,"sentence":"BioSET Offers New Twist on the Healing Touch Doctors routinely use plates, rods and screws to bolt a nasty bone fracture back together. But all of that hardware won't help heal the bone and muscle tissue surrounding the injury, said Thomas G. Roueche, president and chief executive of BioSurface Engineering Technologies Inc. of College Park."}
{"label":3,"sentence":"Yahoo battles Google for the cell phone SAN FRANCISCO--Yahoo added a search feature for cell phones Tuesday, just a few weeks after rival Google launched one of its own. While Google SMS (Short Message Service) uses text-only messages to deliver "}
{"label":3,"sentence":"Extinctions Could Have Domino Effect, Study Says A new study estimates that if the nearly 12,200 animals and plants currently listed as threatened or endangered disappear, another 6,300 \"affiliate\" species could also be lost."}
{"label":3,"sentence":"Hitachi strikes new direction with Lightning 8 Sep 2004, 18:44 GMT - Hitachi this week laid a unique bet on storage virtualization with the launch of the latest version of its flagship Lightning disk array."}
