{"label":0,"sentence":"Migrants #39; ordeal ugly side of paradise Pleasant visions of fun in the sun in the Dominican Republic are being shattered by sad images of residents being smuggled away on wooden boats, only to perish at sea. "}
{"label":0,"sentence":"Portugal PM, Cabinet Submit Resignations  LISBON (Reuters) - Portugal's prime minister said on  Saturday he and his cabinet had submitted their resignations, a  move that came a day after a snap election was called."}
{"label":0,"sentence":"Gulf war syndrome is genuine says law lords #39; inquiry Veterans of the 1991 Iraq conflict were jubilant yesterday as the head of an inquiry into illnesses among them agreed that they were victims of Gulf war syndrome and censured the government for having dismissed their plight."}
{"label":0,"sentence":"Putin calls for establishment of new international security system Russian President Vladimir Putin Friday said on Friday that terrorism is a common threat to the international society, and a new international security system should be created "}
{"label":0,"sentence":"Negotiation offer on Iraq hostage THE Australian Government might help plead for the release of kidnapped CARE Australia worker Margaret Hassan, Foreign Minister Alexander Downer said today."}
{"label":0,"sentence":"Chechen envoy warns of bloodshed UK-based envoy Akhmed Zakayev warns of more bloodshed in Chechnya unless peace talks are held."}
{"label":0,"sentence":"Hamas Gunmen Kill Alleged Collaborator in Gaza  GAZA (Reuters) - Hamas gunmen on Saturday killed a young  Palestinian they accused of helping Israel assassinate Hamas  leader Sheikh Ahmed Yassin and other militants, calling it a  warning to others not to collaborate with Israel."}
{"label":0,"sentence":"Action over global warming demanded The Government #39;s chief scientist has warned the world must act fast to combat global warming or face the dire consequences. Professor Sir David King said climate change cannot be avoided and that  quot;action is affordable, inaction is not quot;."}
{"label":0,"sentence":"Israel, Palestinians Await Powell Visit  JERUSALEM (Reuters) - Israel said before a visit by  Secretary of State Colin Powell on Sunday that it would  consider calls to pull its troops away from West Bank cities to  facilitate a Palestinian presidential election."}
{"label":0,"sentence":"Responding to McCain, Bush Plans Legal Action on Ads (Reuters) Reuters - President Bush on Thursday\\sought to smooth over differences with Sen. John McCain by\\promising to take legal action to stop political ads by outside\\groups, including those attacking the war record of Bush's\\Democratic presidential rival, John Kerry."}
{"label":0,"sentence":"Saddam clung to his fantasies Baghdad #39;s most notorious prisoner, Saddam Hussein, does not have much to do most days. His one court appearance in 10 months has come and gone."}
{"label":0,"sentence":"Child Soldiers in Front Line of Wars Across World (Reuters) Reuters - Boys and girls as young as nine years\\old are in the front line of wars across the world, and even\\when the fighting has finished they are largely neglected in\\the peace process, a report said Wednesday."}
{"label":0,"sentence":"Clinton to Democrats: Discuss Convictions (AP) AP - Former President Clinton, noting an \"astonishing turnout among evangelical Christians\" in this year's election, warned Tuesday that Democrats \"cannot be nationally competitive when we don't feel comfortable talking about our convictions.\""}
{"label":0,"sentence":"Manmohan hopes peace process to continue: New PM greeted NEW DELHI, Aug 28: Indian Prime Minister Manmohan Singh on Saturday greeted Prime Minister Shaukat Aziz on his taking office and said he sincerely hoped that the peace dialogue between the two countries would succeed."}
{"label":0,"sentence":"Suspect in Srebrenica massacre arrested One of the most feared members of the Bosnian-Serb army, who was accused of decapitating between 80 and 100 Muslims in 1995 and of carrying out the "}
{"label":0,"sentence":"U.N., Cambodia to Thrash Out Khmer Rouge Trials  PHNOM PENH (Reuters) - The last details of how former Khmer  Rouge leaders will be tried for their roles in the deaths of an  estimated 1.7 million Cambodians should be thrashed out by the  end of the year, a United Nations official said on Wednesday."}
{"label":1,"sentence":"NFL games on TV NY JETS (2-0) at MIAMI (0-3) When\/where: Sunday, 4 p.m., at Miami. TV: Ch. 4. Last season: Miami won, 21-10 and 23-21. Comments: The Jets are coming off a bye week, while the Dolphins lost to the Steelers in a hurricane last weekend. Jay Fiedler reportedly will be back starting at quarterback for Miami, in place of an ineffective A.J. ..."}
{"label":1,"sentence":"Jordan Says Wizards Won't Tolerate Guff (AP) AP - Kwame Brown's boycott of a team huddle during a game was an example of immaturity that will not be tolerated, according to Washington Wizards coach Eddie Jordan."}
{"label":1,"sentence":"Oklahoma #39;s mastery of Texas borders on ridiculous DALLAS -- Oklahoma #39;s dominance of Texas is reaching infomercial status. Less annoying, maybe, but more effective. It has become a rite of fall."}
{"label":1,"sentence":"Sri Lanka crush Pakistan Lahore, Pakistan - Sanath Jayasuriya defied the dew factor with a five-wicket haul as Sri Lanka crushed Pakistan by a massive 119 runs in the day-night final of the triangular series on Saturday."}
{"label":1,"sentence":"Marino Doesn't See Return to Dolphins Soon (AP) AP - Dan Marino misses being part of the Miami Dolphins, yet does not see a scenario where he'd soon consider returning to the team's front office."}
{"label":1,"sentence":"Shapiro: We Still Want Clement Indians General Manager Mark Shapiro said Tuesday that he remains hopeful of signing free-agent pitcher Matt Clement.  quot;We #39;ll ride this out to the end, quot; Shapiro said, adding that he has already offered more "}
{"label":1,"sentence":"Egaleo 0 Middlesbrough 1 Middlesbrough rarely found their rhythm, but still ran out 1-0 winners in an uninspiring encounter against Egaleo in the UEFA Cup group stages."}
{"label":1,"sentence":"Anti-Doping Agency Is Boosted By Ban of Sprinter in Balco Case The United States Anti-Doping Agency received an important validation when sprinter Michelle Collins, 33, received an eight-year suspension on Friday."}
{"label":1,"sentence":"Earlier start will aid Dolphins #39; return NEW ORLEANS -- The kickoff for Friday night #39;s preseason game between the Miami Dolphins and the New Orleans Saints was moved ahead 30 minutes, to give the Dolphins extra time to return home as Hurricane Frances moved toward the Florida coast."}
{"label":1,"sentence":"What #39;s next? West coaching pool deep for UW The search to replace Keith Gilbertson at Washington will be national, athletic director Todd Turner indicated yesterday. But Gilbertson #39;s successor could come from a handful of promising candidates in the West."}
{"label":1,"sentence":"A nice opening act CLEVELAND -- Returning kicks is dangerous work. It is a job for adrenaline junkies and those overloaded with fast-twitch muscle fiber, because things are not always what they seem."}
{"label":1,"sentence":"Valencia: Rossi wins 2004 2004 MotoGP World Champion Valentino Rossi wrapped up the BMW 2004 MotoGP Best Qualifier Award this afternoon at the circuit of Valencia after speeding to another front row start."}
{"label":1,"sentence":"Barrichello grabs pole position in Brazil SAO PAULO, Brazil -- The hometown favorite won the pole position at the Brazilian Grand Prix, after the seven-time world champion crashed during practice."}
{"label":1,"sentence":"Familiar foes meet again According to Serena Williams, at least three doctors told her not to play this US Open because her surgically repaired left knee was acting up of late."}
{"label":1,"sentence":"London bid for  quot;best quot; ever Olympics in 2012: World News: London, Nov 20 :London has launched its bid to host the 2012 Olympics with a pledge that it would be  quot;the best Games the world has ever seen quot;."}
{"label":1,"sentence":"Britain #39;s Law takes equestrian silver ATHENS (Reuters) Britain #39;s Leslie Law has won silver in the equestrian three-day event individual behind Bettina Hoy of Germany. "}
{"label":2,"sentence":"YUKOS Files for U.S. Bankruptcy (Reuters) Reuters - Russian oil major YUKOS said on\\Wednesday it had filed for bankruptcy protection in a U.S.\\court and would seek an order from the court to halt the Dec.\\19 sale by the Russian state of its main oil unit."}
{"label":2,"sentence":"U.S. Food Imports Climb Appetite for foreign foods and beverages is among the reasons the nation is expected to pay as much for imported products in 2005 as it earns by selling products abroad."}
{"label":2,"sentence":"ADV: Forex Trading: The New Financial Account Get real-time rates, free charts and news, as well as a free demo trading account from FXCM - the market maker for Forex trading. Visit the site today."}
{"label":2,"sentence":"Hiring seen improving a bit Some area employers expect to maintain a steady hiring pace during the fourth quarter of 2004, according to a survey released yesterday by Manpower Inc."}
{"label":2,"sentence":"Marsh Plans to Cut 3,000 Jobs to Offset Recent Setbacks Staggered by accusations that it cheated its customers, Marsh   McLennan will lay off 3,000 employees, or 5 percent of its work force."}
{"label":2,"sentence":"Oil Near \\$50 on Supply Fears in Nigeria  LONDON (Reuters) - Oil prices surged to new record highs on  Monday near \\$50 for U.S. crude as Nigeria emerged as the latest  focus for worries about supply security on world energy  markets."}
{"label":2,"sentence":"Cendant to Buy Orbitz for  #36;1.25 Billion (Reuters) Reuters - Travel and real estate heavyweight\\Cendant Corp.  said on Wednesday it will buy travel Web\\site Orbitz Inc.  for about  #36;1.25 billion, making it\\the No. 2 online travel agency."}
{"label":2,"sentence":"Intel changes put state to test I #39;m paranoid that much of Arizona remains clueless about the competitive race of the 21st century, a race we #39;re in whether we want to be or not."}
{"label":2,"sentence":"Oil Prices Slide Toward \\$54  SINGAPORE (Reuters) - Oil prices slipped toward \\$54 a  barrel on Tuesday, breathing easier after a Norwegian strike  threat receded but still anxious over the thin state of global  pre-winter heating oil supplies."}
{"label":2,"sentence":"UPDATE 2-Fed #39;s Santomero sees solid growth, measured hikes The US economy should grow about 4 percent next year, giving the Federal Reserve room to continue raising interest rates at a measured pace, Philadelphia "}
{"label":2,"sentence":"Eisner #39;s challenge in court is to field tough questions Walt Disney Co. chief executive Michael Eisner acknowledged Monday that he and former company President Michael Ovitz were good friends."}
{"label":2,"sentence":"SingTel to launch 3G service SINGAPORE Telecommunications (SingTel) said it will commercially launch its high-speed third generation (3G) mobile service within months, putting it at the forefront of Southeast Asian telecoms firms looking to roll out the technology."}
{"label":2,"sentence":"Google Cuts IPO Price by a Quarter to \\$85-\\$95 a Share (Update7) Aug. 18 (Bloomberg) -- Google Inc., on the eve of pricing the second-biggest Internet initial public offering, slashed the value of the sale almost in half amid the worst market for US IPOs in almost two years. "}
{"label":2,"sentence":"NEWSDAY TAPS SUN EXEC FOR CIRC POST Newsday named Paul Barbetta, director of circulation for The Baltimore Sun, to head its circulation department after a scandal over inflated figures."}
{"label":2,"sentence":"Massachusetts fines two company units \\$5 million BOSTON (CBS.MW) -- Franklin Resources has agreed to pay a \\$5 million fine in connection with charges that it allowed market timing in a fund that prohibited the practice in its prospectus."}
{"label":2,"sentence":"Is Ford Out of the Ditch? Plus, Qualcomm's hazy visibility, EDS is grounded, and no telling with Nortel."}
{"label":3,"sentence":"Firms Push to Ease Tough Federal Scrutiny Two-and-a-half years after Congress passed the most sweeping corporate reforms since the Great Depression, trade groups are maneuvering to revise them, arguing that they are too expensive, too time-consuming and too much trouble for small businesses."}
{"label":3,"sentence":"Sony releases home server that stores 1 terrabyte Sony #39;s Vaio Type X, which is available only in Japan, is a new home server that contains four 250GB hard drives: two for PC files and the other ones for audiovisual materials such as stored TV programs and music."}
{"label":3,"sentence":" #39;Google #39; Your Cluttered Computer Online search-engine leader Google is targeting the computer hard drive with software that promises to scour the clutter of documents, e-mails, instant messages and other stored files."}
{"label":3,"sentence":"HP drops Itanium workstations Hewlett-Packard Co. (HP) has stopped selling workstations based on Intel Corp.'s Itanium 2 microprocessor, a company spokeswoman confirmed Friday."}
{"label":3,"sentence":"Linux firms join forces on security A consortium including Mandrakesoft, the Paris-based Linux seller that recently exited bankruptcy protection, has won a three-year contract worth 7m to improve Linux security."}
{"label":3,"sentence":"An Empire Built of Glass Designer James Carpenter understands the poetics of light and material, working with architects to enhance public places. Fourth in a series profiling this year's MacArthur 'genius award' winners. By Kari Lynn Dean."}
{"label":3,"sentence":"Nothing Black and White About Panda Pregnancy (Reuters) Reuters - Is she or isn't she? Word in the woods\\is that Hua Mei, China's first overseas-born panda now back at\\home, is expecting."}
{"label":3,"sentence":"Halo 2 Xbox game leaks over the Net According to reports, copies of the eagerly awaited Halo 2 Xbox game made an impromptu debut last night on Usenet groups and pirate sites."}
{"label":3,"sentence":"Google and Microsoft to update data sharing SAN FRANCISCO Google and Microsoft were to separately introduce enhanced information-sharing services for Internet users on Thursday."}
{"label":3,"sentence":"Billboard to Rank Cell Phone Ringtones (AP) AP - Back at No. 1 for the 29th straight week, it's everybody's favorite ringtone. The music market tracker Billboard will begin ranking the customized mobile phone sound snippets beginning next week  #151; another sign that ringtones are fast becoming a staple of recording industry sales,"}
{"label":3,"sentence":"Mysteries of newly found hobbit lure tourists to remote &lt;b&gt;...&lt;\/b&gt; LIANG BUA, IndonesiaThe discovery of remains of a tiny human closely related to man on the remote Indonesian island of Flores and tales of hobbit-like creatures "}
{"label":3,"sentence":"RIAA Files 750 Infringement Suits The Recording Industry Association of America yesterday (Oct. 28) brought a new round of copyright-infringement lawsuits against 750 file sharers, including 25 users on 13 university campuses."}
{"label":3,"sentence":"Sun unveils UltraSparc IV It will be Sun's first chip to be built with a 90-nanometer process technology and it will have a higher clock speed and larger and more flexible memory caches than the current generation of UltraSparc IV processors."}
{"label":3,"sentence":"US and 13 Other States Agree on Push to Gather Methane Gas The United States and 13 other countries signed an agreement on Tuesday to explore ways to capture methane gas emissions. Methane, a heat-trapping gas, is the primary component of natural gas."}
{"label":3,"sentence":"Is Microsoft creating tomorrow's IE security holes today? &lt;strong&gt;Opinion&lt;\/strong&gt; Seeds of disaster"}
{"label":3,"sentence":"HP Spurns Intel Add a chapter to the sad tale of Intel #39;s (Nasdaq: INTC) sorry 2004. Today, longtime partner HP (NYSE: HPQ) admitted it would be dropping the beleaguered, 64-bit Itanium chip from its workstation lineup."}
