{"label":0,"sentence":"Wanted to give there cupcakes a try.  I have to admit they are not my favorite. The cake was very crumbly and had only a slight amount of flavor.  The cream cheese frosting was gooey and messy.  I really don't feel they are worth $3.00 a pop.  Just my opinion."}
{"label":0,"sentence":"The food here stinks! I will never go back again! Don't waste your time and money there are other restaurants with better quality food!"}
{"label":0,"sentence":"I enjoy the chicken at El Pollo Loco. I do not enjoy the wait for the chicken at El Pollo Loco and I was admittedly indifferent to the hair that I found on my chicken at my most recent visit at El Pollo Loco. I had waited for ~ 15 minutes for 3 chicken breasts and a wing (no sides, no drink) so I decided to pull the hair off my chicken, remove the portion of skin that the hair was sitting on and have at it. I will say it was still delicious albeit less than sanitary."}
{"label":0,"sentence":"Very average - my pasta was cold,the steaks were ok but very small but the service was what really let it down.the waiter was exasperated by simple questions and when one of our party didn't get a bread roll (as they had no side plate) and requested one it was unceremoniously dumped on the table,minus a plate.i won't be back."}
{"label":0,"sentence":"Let me start by stating I really enjoy the food here. I have been here for lunch, ordered out, and sat down for dinner and never had an issue with the food. I prefer their pizza over most places.  However, SERVICE MEANS A LOT. \\n\\nI have had terrible service there once in person to the point where my boyfriend wanted to walk out. Well last night I called in on my way out of work from a 12 hour shift.  I did not have much brain power left and wanted to just grab food and go home. Lets just say my phone call was very unpleasant.  I asked for pizza and ranch where the person on the phone proceeded to ask how much ranch I would like \\\"\"2 pints, half a pint, blah blah blah.\\\"\" At this point in the day I do not have much left in my brain and was not thinking measurements I just wanted ranch. I said a cup would be fine where he proceeded to tell me \\\"\"well I do not know what that means\\\"\" and continued to repeat himself over \\\"\"2 pints, half a pint blah blah blah\\\"\" \\n\\nI then decided I would let him know I was displeased with his phone etiquette seeing he repeated himself three times when I just wanted a small container of ranch. He could have simply said \\\"\"I will show you sizes when you pick up\\\"\" or something rather than repeating himself over when I obviously didn't understand.  When I approached him in the store he was nothing short of rude. He denied being rude and the manager stood and listened to my conversation and did not care to interject and say I am sorry for your unpleasant phone call. I paid and went to walk out and got the ever popular \\\"\"have a good night!\\\"\" \\n\\nI believe I work very hard and I am pleasant to every person I come in contact with. These people are rude and unpleasant. Will never go here again."}
{"label":0,"sentence":"Came to the Aria pool for my Birthday with my mommy friends and ate here since it was poolside. Big mistake.\\nI dont know why I ordered sushi but I did and I had to send it back. It did not look good at all.\\nEnded up with a chicken quesadilla..for $15 bucks.\\nIt was ok..not great.\\nThe overpriced drink I had was the highlight of the meal.\\nI wont be eating here again."}
{"label":0,"sentence":"Pros: Fun if you are drunk out of your mind. Or just turned 21. Or just turned 21 and drunk out of your mind. Oh, and if you are from Nebraska. Honestly though, the environment is really energetic and loud so don't expect to actually talk to anyone you are eating with. The fish and chips are good, food wise. Oh, and you can take goofy pictures, so that's fun.\\n\\nHint: if you walk in somewhere and they ask if you are there to drink or to eat, never eat the food. Unless you love globs and globs of cheese. The rubbery, oily kind. \\n\\nCons: Literally the WORST meal that I have ever paid for. Had to pay for chips and salsa. The salsa was awful. How do you mess up salsa in a Mexican restaurant? My partner ordered tacos. Only ate two bites of one taco because they were gross. Again, how do you mess up tacos in a Mexican restaurant?  \\n\\nI'm not too surprised because I should have known better. I mean, it's Vegas and I got a coupon for a free appetizer. There had to be a catch. Stick to the buffets, people. Your wallets and stomach will thank you."}
{"label":0,"sentence":"First club I'd ever gone to in Vegas & I had a horrible experience. We thought we got a good deal to go in but ended up paying less at Marquee the next day & had a way better time. \\n\\nThis club is small & overcrowded. There is hardly anywhere to stand without being uncomfortable. The bartender completely ignored me, the free drink the club offered was weak, the security guards have huge chips on their shoulders, the dance floor is small & overcrowded. When I finally made it down there I was told by two security guards to not block the way down. Well where was I gonna go genius? I kept talking crap back to them until I had enough of this crappy club & left. They really need new employees. \\nThe only plus is the good music played."}
{"label":0,"sentence":"i went tonight and it was not crowded at all except they put my family and I with 3 drunk guys who where loud and annoying. the pod has 8 screens (4 on each side) playing the same video which is a bit too much. also, the music and videos were way too loud for such a small place. the view was only good when you got to the top, the rest of it is parking lots and roofs of buildings, which really disappointed us :( also, every single employee that we ran into had an attitude! overall, the pods are clean and air conditioned which was the only good part. this was a one time thing and i wouldn't do it again, plus it's waaaay too overpriced :("}
{"label":0,"sentence":"My friend and I came here on December 21st for dinner after it was recommended to us by the Tix4tonight because it was close to our show's location.  We thought... meh why not? \\n\\nThe ambiance of the place was pretty good and the waitstaff there were very hospitable - the only aspects that prevents it from getting one star. Other than that, I would definitely not go back.\\n\\nThe food, first of all, was HORRIBLE.  For the price of almost $30, I've never been to a buffet more terrible than this one.  Basically, it's an International Buffet with foods: Chinese, Japanese, Latin, Italian, BBQ\/roasted meats, seafoods... and of course all-you-can-drink beer, wine and non-alcoholic stuff.  The crab legs were tasteless, sushi rolls were unimpressive (rice was too hard), their Chinese food consisted mostly of North Americanized creations.  At the Italian stations, their food was lukewarm.   I've walked around the buffet many many circles to find things I'd like to eat but unfortunately didn't have too many things on my plate.  Besides the dessert station which was okay, their food selection, variety and quality was inadequate.  When tasting the food, it just doesn't taste fresh and we were both really really disappointed."}
{"label":0,"sentence":"No bueno! I ordered a blended caramel and my husband ordered a vanilla latte. My drink taste like ice and his seriously taste like a cigarette. No joke!"}
{"label":0,"sentence":"Joel Robuchon is the \\\"\"chef of the century\\\"\".  This place has three michelin stars, 4.5 stars on yelp, and recommended by foodies.  So naturally, after dining at a handful of michelin restaurants, we had high expectations for Joel Robuchon.  For chris sakes, Rod Stewart was sitting at the table behind us!!!  Furthermore, Joel Robuchon was in Vegas that night, and seeing him added a little extra touch.  \\n\\nAfter doing extensive research, my boyfriend and I opted for the two courses.  Here's our story:\\n\\nThe Pros:\\n- Bread cart was AMAZING!!!\\n- Dessert cart was awesome!\\n- Amuse-bouche was yummy caviar\\n- The limo ride was very much appreciated\\n\\nThe Cons:\\nThe Food.  Aside from the above, everything was disappointing.  \\n\\n- Le Canard: duck was passing at best.  The foie gras on the side was overcooked. We love foie gras, but had to force it down...foie gras should not be that way.\\n- The King Crab wasn't even memorable.  I was disappointed after a taste.  It wasn't bad, just nothing special.\\n- La Ch\\u00e2taigne soup was very bacon in flavor.  I can honestly compare it to bacon cooked on a stove top, and thrown into cream sauce.  The foie gras in the soup was overcooked as well.  I wouldn't even know it was foie gras unless I read the menu. \\n- Le Veau: veal was passing.  It wasn't something I tasted and felt \\\"\"wow, I must have this again\\\"\".  \\n\\nAfter we finished our \\\"\"experience\\\"\" we felt disappointed with the food, and mentioned that it is not worth three michelin stars.  In addition, I started to feel queasy.  I thought it was the food's richness, however, if only that were it.  I spent the whole night amidst a toilet, throwing up.   I had one glass of wine, so it was not alcohol related.  Drunkedness and heart burn over food poisoning any day.  FAIL!\\n\\nIn my honest opinion, Joel Robuchon in Vegas is living off of its hype.  It's either politics that gave him the stars, or what it used to be.  But the quality is sub-par, so save your money, do not dine here.  \\n\\nSo overall:\\nJoel Robuchon's Food - BAD\\nFood Poisoning - VERY VERY VERY BAD!!!!"}
{"label":0,"sentence":"I have had not one but many bad experiences at this restaurant. I find that their all you can eat is crap. You can order but don't expect your food. I have gone and ordered and after not getting food I inquired and they told me to reorder. It is sad thatnyou pay a fortune and not get anything. I would hope that they would change their policy. But even after complaining on line I was told to visit their other locations. No compensation or anything. Pretty sad. I would give the satisfaction. And I am not sure how fresh everything is"}
{"label":0,"sentence":"I had a decent 6$ sandwich. That's what I can say. I read other reviews and I really went there hoping for something decent, but I felt let down. \\n\\nYou can't expect much for 6$ so it delivered there. But the service was terrible. 6 people in the place and the girl couldn't bother to show us more attention then the minimum requirement. The place is also dirty, quite dirty. I can handle cheap, but not a fan of dirty. \\n\\nSoupe soupe across the street is a better bet. A few bucks more but much better organized."}
{"label":0,"sentence":"Was very disappointed at the lack of choices on the menus and the fact that a place focused on \\\"\"healthy and vegan friendly\\\"\" items has Absolutely no Gluten free choices other then an omelet and tomato soup.  Food was good but not great. Probably will not eat here again.  Cute decor."}
{"label":0,"sentence":"Negative stars need to exist for establishments like this.\\n\\nI have contacted the better business bureau about this location, as well as their corporate offices. Alerted them to their accusing us of walking out on our checks when we did not, then charging our card the wrong amount. All this after a four hour miserable wait and experience. I have also reported the manager Dan who has handled this so atrociously that it's astounding he has a job at all. \\n\\nPlease: do not eat here or support this business. I venture to guess they will be closed soon anyway; especially after the business bureau begins investigating them."}
{"label":0,"sentence":"Havent been here in a while, so I decided to come back to actually try out the food this time. I used to come here to drink and meet up with friends. I was in the mood for a steak so I ordered the ribeye the food came out in a timely manner and the service was good . Sad to say the steak was not as good as the service . I'm a better stick myself and that is what I compared to. I felt like I ordered from a one star restaurant. I literally wanted to bring in my own cow and show them how to really make some good steak . I guess next time I'll stay in and cook my own."}
{"label":0,"sentence":"Tried to go to Redbrick last night and found out it closed nine months ago. So if you are in Vegas and want GF Pizza, you gotta look somewhere else."}
{"label":0,"sentence":"In a nutshell: buyer beware.\\n\\nThe service was friendly, the price was right... the phone was probably stolen... annnnd did not function as claimed.\\n\\nI hastily bought an unlocked phone from these guys 3 hours before my flight left. We were leaving to travel in Central America for a year and my phone had just died. Hence the haste and the need for a global unlocked phone. Though I realize that buying a used phone means some features are broken, they said the phone checked out. So I was very disappointed to discover that the GPS (50% of the reason I needed the phone) didn't work, the headphone jack didn't work, the back camera was missing a lens, and the front camera didn't work at all, and some other little things. So this is a phone that checked out for being fully functional?\\n\\nNow that I am back in the US, I bought a US SIM. I can't activate the SIM because there's a lost\/stolen alert on my phone (interesting that wasn't a problem in Cen. Am.). So now I have a phone that I bought as a legitimate phone for $150 that I can't use. There are websites where you can check the phone to see if it is stolen. You'd THINK a store that deals in used phones would do that. NOPE. I trusted them. I was burned.\\n\\nAnd now that I'm trying to contact them again, their phone number doesn't work and they're not responding facebook messages. Thanks, Clarence of Unlocked Global Phones. You've really done me a solid, buddy."}
{"label":0,"sentence":"I took my kids for dinner tonight. They ordered their meals and I ordered a Baja salad. They gave me my kids' food and the cashier told me they were just waiting on the chili for my salad. I went and sat down with my kids. I went back up ten minutes later to see where the rest of my order was. The cashier told me he had to have the chili checked. He yelled back for someone to check the chili. Someone in the back yelled they couldn't check it and stated they were too busy to check it. The cashier told me he would have someone check the chili in a few minutes so I stood there for another five minutes waiting. Someone then finally checked the chili and said it wasn't ready yet. By this time, my kids had finished their meals and were eating their Frosties. At that point, I told them to take the salad off my order. The cashier called the manager over and told her he needed a refund. She asked him, \\\"\"Why do we need a refund?\\\"\" The cashier told her the chili wasn't ready for the salad. The manager handed the cashier the keys. He then told her I don't need the keys. It's on a card. (I used my debit card.) At that point, she got very angry, slammed down whatever it was she was doing and came over to do the refund. She was rude and obviously VERY angry. In fact, it seemed that every single employee there was in a terrible mood. I understand people have bad days, but there is absolutely no excuse for every person in there to be treating the customer like they are an inconvenience. If it is so inconvenient for them to serve me my food, I'll be happy to take my business elsewhere. In fact, I left there and went down the road to Quiznos for my dinner. The real slap in the face to me was the fact that there is a banner hanging up on their wall stating \\\"\"Customers are #1\\\"\"."}
{"label":0,"sentence":"Just came here for a Mother's Day brunch.  We called the day before and made reservations for 11:00 knowing that it was going to busy.  We arrived about 5mins early and were told that the the table was just going to be cleaned up and we would be seated.  We proceeded to wait for half an hour.  We saw people get seated that had just put their names on the list while we waited, and these were parties of the same size as us (7).  Once we were finally seated we all decided to get the buffet which was kind of the special.  Once up at the buffet it got worse.  It seemed like they had been way overwhelmed. There were things on the buffet that were missing  like the prime rib, there was just a pile of the fat scraps and no one there cutting anything.  There were things that were cold and picked over as well.  Also none of the plates or cups matched, which is not really a big deal but just added to the unprofessional appearance.  I used to like going to this place when I lived here and thought it would be a good spot to take my mom.  It turned out horrible and I will never be returning here, nor recommending it to anyone."}
{"label":0,"sentence":"Closed ! Probably to health inspectors .. disgusting inside , out dated , and wear junkies and bums hang out.. been many robberies here.."}
{"label":0,"sentence":"I ate here on my birthday when we did a group trip to Vegas. We got in late, and didn't know where to go and ended up choosing this because the baby they use to advertise was everywhere in the hotel.\\n\\nI've had a lot better tasting Chinese food and paid a lot less for it. The Moo Shu Pork was pretty good, but all of the other dishes we got were either too salty or too bland. They forgot about one of the dishes we ordered and didn't bring it until 20 minutes after the first plates arrived. We also had trouble getting refills on anything. This was by far the worst service I've ever gotten in Vegas\\n\\nI will definitely not be eating here again on any of my trips to Vegas."}
{"label":0,"sentence":"Have been here several times since it opened. Unfortunately, this last experience was not the best. After being seated about 8:30 pm on a Friday night, our server came and took our drink order. Then, another one came and took our food order. The original server was nowhere to be seen; we figured it was because the restaurant was getting quieter, and so they sent some of the staff home. No problem. But, after that, after delivering our food, the second waiter never came back. Several people had ordered iced tea of which none were ever refilled. Only waters were refilled. After our plates were cleared, we sat for a good 10 minutes looking for server to bring us the check. Eventually we had to snag a third server to bring us the check. Disappointing. I remember when the restaurant first opened. There was a large size crowd and sometimes a long wait. Now, you can walk right in and be seated (there were 5 of us). Hopefully the service will improve, because restaurants in this area compete fiercely for patrons. I hope the smaller crowd was not an indication that this restaurant is beginning to suffer."}
{"label":0,"sentence":"terrible food and over priced. I don't think the kobe beef burger is kobe beef, in and out burger is better and cheaper.  this place is crap"}
{"label":0,"sentence":"We're extremely huge fans of Penzey's spices.  Prior to returning home to Wisconsin, I made countless trips to the \\\"\"main store\\\"\" in Brookfield, placed dozens of online orders, and have made road trips to Kansas City all in the name of procuring Penzey's spices.  They really are that good.\\n\\nBut this store in Middleton is a major disappointment for two primary reasons: the hours of operation, and the service.\\n\\nThe hours are a bit ridiculous... they close at 5:30pm on weekdays, and an unbelievable 5:00pm on Saturdays and 4:00pm on Sundays.  Really??  I don't know about you, but rarely am I finished shopping by 5:00pm on a Saturday... those days are usually so filled with activities that I'm doing my best to get everything finished by 9:00pm.\\n\\nThere's nothing more frustrating than driving over to a store with the intention of \\\"\"running in to grab\\\"\" (something) only to discover they've closed at a crazy-early hour.  Can someone share with me why the Penzey's stores close so early?  \\n\\nSecond complaint: the service.  Customer service at most Penzey's stores isn't fantastic, but at this particular location, the store clerk was literally sitting on the counter, listening to the Brewers game on her radio, and seemed to be genuinely upset that we were buying $40 worth of spices from her.  The transaction went something like this:\\n\\nMe: \\\"\"Hi.\\\"\"\\n\\nHer: \\\"\"Hi.\\\"\" (rings up spices)  \\\"\"$38.12\\\"\"\\n\\nMe: \\\"\"Ok, here you go\\\"\" (hands her debit card)\\n\\nHer: \\\"\"Want your receipt?\\\"\"\\n\\nMe: \\\"\"Yes please, thanks.\\\"\"\\n\\nThat's it.  Not a \\\"\"thanks\\\"\" or a \\\"\"you're welcome\\\"\" or anything like that.  Not even a casual observation on the spices we purchased... just a \\\"\"why are you bothering me?\\\"\" attitude.  \\n\\nI guess I'll order online, even though this store is literally a mile from my place... :-(  I'd give this place zero stars if possible, but the spices are good; their Tellicherry Peppercorns are amazing, as are their Chili, Taco, and Fajita seasonings.  Also, be sure to try the Foxpoint Seasoning the next time you make potatoes - it's great stuff.  Just wish the service didn't absolutely stink."}
{"label":0,"sentence":"went on a friday night... it was EMPTY wtf.... the band playing was too loud, and the lead singer must have thougt hes Bon Jovi in the 80s.. or Axel dunno.\\n\\nAnyways, there were neither any guys, nor aifroce guys there. If anyone knows where to hang with airforce guys, PLEASE let me know.\\n\\nOur shots were way too expensive.... just saying. The other prices where ok for beer and tequilla mixers."}
{"label":0,"sentence":"25 mins from the strip, not worth the drive. The food isn't that great and it looked like its been sitting out for awhile. The food is bland and the waiter isn't the friendliest."}
{"label":0,"sentence":"I have the impression about Orocco Pier that the views it affords customers makes up for many the the shortfall left by the supposedly arty platings of the various dishes served. The table service we experienced was friendly and pretty efficient but price-wise, particularly for drinks, I found it lacking in value for money.\\n\\nThe food was generally tasty enough although I've had better ravioli. It'll be a while before I think about going back."}
{"label":0,"sentence":"If you want  authentic Korean food, don't go there.\\nThe side dishes and entree was either bland or too sweet. I guess being on the strip they must have decided to make the food sweet to appeal to non-Koreans (especially Japanese). That was the only logical conclusion I can think of because Korean food should not be sweet.\\nThe kimchee hot stone pot rice came out warm with kimchee juice still on the bottom. So, I told them to take it back. It came back 10 min. Later. Still not right and warm-it should be sizzling. My soy bean (den Jang chee gae) was too sweet as well as bland. So, I called the manager but the waitress never called one for me. So, I complained to her that it was one of the worst Korean food I've had in a long time.  I am visiting from los angeles, which has one of the best Korean restaurants outside of Korea. So, I think I know what I am talking about.\\nIt's so sad because I was here for super bowl Sunday. It was not bad. They must have change the cooking concept since to attract the non-Koreans. If I was alone, I would have cancelled the order and walked out.\\n\\nTrust me, stay away unless you like your food bland and sweet.\\n\\nThere are better Korean restaurant. I think Ginsang on the south side on the strip is better. The Korean restaurant on the strip pass the Stratosphere is better. The Korean restaurant in the old shopping center on Sahara, north of the strip is better."}
{"label":0,"sentence":"I called the hotel at 6:29 to tell them I needed pickup from the airport and was told it would be 20-30 minutes. After 45 minutes I call the hotel again and am told it will be 5 more minutes. Finally at 7:26 the van pulls up. Three more minutes and it would be an hour that I waited for the shuttle. The driver is rude and we continue to sit at the airport and wait 15 more minutes. By the time I get to the hotel I have been in pit for nearly two hours, severely cutting into an already limited rest period which is slightly crucial for the people working your flights. Horrible customer service and a waste of time."}
{"label":0,"sentence":"- die pizzen sind extrem fettig\\n- oft ist falscher belag drauf oder iwas fehlt\\n- das wird dann mit extra k\\u00e4se vertuscht\\n- hatte auch schon pizza die im kern noch roh war\\n- hatte mal vergammelte pilze auf der pizza\\n- getr\\u00e4nke schmecken abgestanden\\nIch bab schon ein paar mal gedacht,dass die evtl einfach nen schlechten tag hatten, aber die beschwerden wurden einfach ignoriert! Unversch\\u00e4mt jemanden auf verbranntem essen, zutaten die vergammelt sind \/ auf die man allergisch ist sitzen zu lassen!"}
{"label":0,"sentence":"Poor service and food is overpriced. The food should taste a lot better for what you pay. Also, it's really hard to get a table."}
{"label":0,"sentence":"I would not go back to this place, or recommend to anyone to come here, I was given an estimated time of 45 mins for a screen replacement, came back hour and 15 mins later, and it was still not done, the guy who was supposed to be fixing the phone, was chatting with friends when i arrived, and after seeing me, he still did not start to work on my phone, after the gossip session had ended, and after i waited an additional 25 mins, the screen was replaced, and that too a pretty bad job, not worth the $145.00. Next time going straight to Apple."}
{"label":0,"sentence":"This place sucks! If you can't find it yourself don't bother asking. I was looking for some mechanix gloves, I found 1 pair and had them scan to check inventory. 17 pair in stock but they can't be bothered to help me find them. Again avoid this place.\\nPs... While tons of folks are standing around without help they decided to have a staff meeting( during business hours) full of self congratulations and applause,,,, what a joke"}
{"label":0,"sentence":"First off everything in there was way way over priced for used furniture for what they were asking for it I could go to other stores and buy it brand new. Second it was a maze to get through to the parking lot...I expected better from goodwill...don't waste your gas going here...so DISAPPOINTED...."}
{"label":0,"sentence":"Don't bother with this place..I purchased my tag there few years ago..had a bad experience during purchase..well this tag I purchased broke..the hour hand will not work..I took it in and they had o idea what was wrong..and told me it would take 4weeks and min of $190 ..so I said I can't wait that long and they said then contact tag..so I went to look at new tags and I waited for a long time to even get help...I had to flag someone down ..customer service sucks and they sell faulty watches ..do not buy from here"}
{"label":0,"sentence":"Good God! How did this place rate \\\"\"$$\\\"\"??? \\n\\nBaltimore Crab Cakes $34\\nWith a red cabbage slaw, remoulade sauce\\nand Belgian pommes frites\\n\\nFOR LUNCH?!!"}
{"label":0,"sentence":"I tried this place a couple of times after seeing it on Yelp. Honestly, their shuttle service seemed slower than my regular place. Nothing special going on here, at least to me. It's kind of in a strange place and I had to battle the construction on 143 to get there.Also, I asked about getting a corporate rate and they told me I do not qualify (even though I fly almost weekly). They did mention that they might consider extending me a corporate rate if I gave them my client contacts (I'm in the printing business). I couldn't even come up with a response but I do think that is somewhat unethical. I think I'll stay put with my regular company. They take good care of me. They gave me a dynamite rate without any questions. If it ain't broken, no need to fix it! Lol"}
{"label":0,"sentence":"Me and my friends decided to try this place out due to all the great yelp reviews, but I was disappointed.  I got the carne asada tacos and chicken tacos, which were a $1 each because it was happy hour, and they tasted ok.  The food is very generic like a chain Mexican restaurant something like Baja Fresh,  The service was great and the place is pretty nice.  Just the food was average and wasn't satisfying."}
{"label":0,"sentence":"Came here to kill some time and grab a quick drink before our movie... Upon arriving there was no one to greet us for a while and then when we were finally sat at table we again had to wait for someone to come... It seemed as though no one was coming any time soon so we told the hostess we were just going to move and sit at the bar... Well even at the bar we had to wait longer than we should have... I don't mind waiting but at least let your guests know that you'll be with them in a few... Don't just keep making eye contact without saying anything when it is not even that busy. \\n\\nOh well, at least my Leinenkugel was only $4..."}
{"label":0,"sentence":"My friends and I actually had a lot of fun here.The reason why I'm giving this place a two is cause the lady working was so rude about us finishing our last hole because they were closing."}
{"label":0,"sentence":"Tamba...Indian restaurant on the strip\\nAuthentic and it has spacious dining area. We had been there for lunch buffet and to my surprise I had to pay the bill before you kick off your lunch. There are not too many items when compared to other Indian buffets. \\nIdly's.... too hard and totally disappointed (Most of the Indian's hesitate to eat idly's which are not soft...it's my personal comment) \\nWe had Pakoda and Tandoori chicken which are fine and I would expect to have more starters.\\nChicken curry was the best among the buffet and also tasted couple of vegi curries chole (chick peas) and Dal. \\nLittle expensive for such kind of food (It's Las Vegas and won't comment about the cost).\\nTotally it was not a great indian buffet!!!"}
{"label":0,"sentence":"Great location in this shopping center. The store itself was packed with everything you need for your furry friend...from food to toys to grooming. \\n\\nI went in just browsing and I found myself having questions about the various toothbrushes so I can start cleaning my pooch's teeth. However, the employee never acknowledged me even after he helped another customer before me and he began greeting and helping someone else who came in after me. Granted, I don't demand a lot of attention; I do think it's not too much to expect acknowledgment in a store such as this when at one time I was the only customer.\\n\\nWell, anyway, I think it's great it's a local establishment and I love shopping local. It just didn't score too high in my book since, well, I've experienced better."}
{"label":0,"sentence":"My sister and I bought a mani\/pedi on groupon to use and while the girls were nice enough, I was very unhappy with the end result of my manicure. They kept pushing the shellac product saying it would last a long time. I understand why they did because my nail polish started coming off after the first day! For as infrequently as I treat myself to this service I expect to have my manicure last longer than a day. \\n\\nI wouldn't go back because I felt the manicure was rushed and the shape they created on my nails was not flattering at all. My sister's toenail polish started coming off after a day or two as well. \\n\\nEnd result? Nice staff, but I wasn't paying to meet nice people. Was trying to have a nice manicure pedicure done. Overall a very mediocre experience and I wouldn't go back."}
{"label":0,"sentence":"I had heard good things about Brickhouse. My friend and went there on a Monday for dinner. It was pretty quiet.\\n\\nWe sat in a booth on the main level. Never again! The booth backs are loose, so every time the guy behind me leaned back, I got pushed forward. When he returned to the table after stepping away for a few minutes, he hit the back of the seat pretty hard and I got slammed forward. (I'm not blaming the guy here, the restaurant needs to fix these booths!)\\n\\nThe server didn't tell us that there were drink specials, until he brought them and let me know that my beer was on special. That would have been nice to know ahead of time though. It might have affected my friend's order. The waiter informed my friend that they were out of the beer she ordered (a hefeweizen) and suggested another one that he said was similar. What he brought was not a wheat beer at all, very hoppy and bitter. My beer tasted like garlic, as if they had made a Bloody Mary in the glass, rinsed it with water, and poured my beer. Pretty gross!\\n\\nAlso, there were a ton of gnats\/fruit flies flying around, which was distracting and kind of nasty.\\n\\nThe meat on the pulled pork sandwich was good, but I wish their sauces tasted better. Fries were ok. My friend got a tiny bowl of beef chili, which she said was ok, but pretty brothy for chili. Overall, I thought the food was unimpressive, but not bad."}
{"label":0,"sentence":"Wow I don't know where to begin. I had this place at 5 stars but that was for the old doctor and evaluation. I guess everyone is nice when they're taking your money. I posted earlier with the thought that i would get my contacts but I'm still waiting - 7 months and counting!!  Customer service is non-existent in this place so STAY AWAY!!\\n\\nI was waiting for them to call me when they received the third contact brand in my strength, but I've had to call them three times now! Absolutely NO communication.  This time Mary belle tells me i have to get a whole new exam done because the doctor is in another location and can't sign my prescription.  Again, great communication to the patients huh? All i want now is the air optics brand so at least ill get something for all that money and time wasted, but she said no way.  I asked for the manager but he won't be in until Thursday. I'm going in to talk to him face to face on that day...\\n\\nTo be continued..."}
{"label":0,"sentence":"Went for complete detail and asked to be called when they had finished. 5 hours later I go to check on my car and was told its been sitting waiting for an hour already with no call. The worst part is that there was still dirt in the vents, grass particles in the carpet, and the seats didn't look any cleaner than when I took them the car. They didn't wax the exterior, clean between the rims struts, or even dry the windows. DO NOT WASTE YOUR TIME AND MONEY. After arguing with the ticket writer, who by the way said he was the manager and wasn't, the manager gave me another full detail voucher. IT WILL NOT BE USED. My 2011 WRX will be detailed by true professional next time. Not a car wash detail place, never again."}
{"label":0,"sentence":"Friendly service by owner but gave me food poisoning and spent a day puking followed by a week of stomach pains!  Never going back!"}
{"label":0,"sentence":"Been to this Olive Garden twice with my family. Obviously if it was up to me, I wouldn't have come back a 2nd time. The salad and breadsticks are always good, but the main courses are seriously bad here. Both times I've eaten here I've gotten sick. Tried different stuff each time, didn't matter. The service is lacking here also. While everyone is nice, the service is very slow."}
{"label":0,"sentence":"I know they just opened & are working out the kinks, but the wait staff needs more training & the menu needs a bit of tweeking.  THEY HAD NO VEGGIE BURGER!  They need to learn from Burger Bar in Mandalay Bay.  Had I known I would have brought a box of bocas & made my own.  Coffee came in espresso cups, which was probably an oversite.  I have found that many places in Vegas substitute volume 11 music, for Ambience.  However they did turn it down when we asked them, as we had to scream across the table at eachother.  Hope they pull it together."}
{"label":0,"sentence":"I tried the \\\"\"cold cheese and toppings\\\"\" slice that Beto's is famous for.  If you have heard about there style of serving pizza, and are wondering what the punch line is, there isn't one.   They make a big square tomato-sauce pizza and throw cold shredded cheese and other cold toppings on it, and that's it. There's no secret ingredient or special something  that makes it tastes like anything other than what you would get it you grabbed pizza fixings from your kitchen and forgot to bake them.\\n  \\n I guess a lot of people like it, and more power too them. But I don't get it. Ramblin' Boy didn't get it. I see zero reason to agree with people that say that this is the \\\"\"best\\\"\" pizza in the region. \\n\\n Maybe their hoagies will be better."}
{"label":0,"sentence":"Could have been 5 stars but NOT having a working elevator to the food court puts the icing on the cake. What's worse is that there wasn't a sign that said that there are other access for those with babies and strollers or wheelchairs. If there was one, I didn't see it because the elevator that supposedly takes you to the food court didn't indicate any other working elevators. So I had to carry my 4month child with the stroller along with my 4 year old standing next to me. If my 4 year old wasn't hungry, I would have left and gone somewhere else to eat. But I had to make it happen for her. I will only be back at this mall for the Lego store. I no longer care for anything else. Hanks fashion show mall for being so adequate and convenient for customers."}
{"label":0,"sentence":"I am new Vegas but not new to the Aveda Institute. I have been going to the one in Tempe for years and never had an issue. My stylist was in a mood and was fired or dismissed right during my color, sat for another 45 min waiting for another student to finish when my scalp started burning. New stylist informs me I have \\\"\"hot roots\\\"\" which she preceeded to fix, nightmare is an understatement. Supervisor was rude, charged me the full price of not only service 1 but the repair of the mess that stylist 1 did to my hair. I was there a total of 6.5 hours and was never offered a drink or an apology plus had to pay for orignial service plus repair service. I wrote to the owner and never heard a peep.....not worth the price folks!"}
{"label":0,"sentence":"Don't believe the 5 star ratings on this place, they're from people who've only posted 1 review which means they're the owners or friends\/family of the owners trying to falsely boost their ratings. There are plenty of good, clean smelling places that actually listen to their customers.\\nHorrible! It was like being tortured! I kept wincing and yelping in pain and the Chinese guy massaging laughed at me and patted me like I was being a baby. The 2 of us both felt beat up by both masseurs\/torturers who kept laughing as they pounded on us. I've had deep tissue massages and reflexology massages before and none of them were as rough and painful as this experience...3 days later and still sore. \\nThe place smelled like rotten eggs when we first walked in and looked old for it being their \\\"\"grand opening\\\"\"...Should have just walked out as there were plenty of other places nearby for the same $20\/hr. \\nDo NOT go there unless you like getting beaten up!"}
{"label":0,"sentence":"Made a reservation through Open Table and when my date and I arrived back in September the temp was 98 outside. Despite the fact there were open tables inside we were told that since we had not made our reservation directly with restaurant we would have to dine on patio. Major attitude in providing this news as if we were second class citizens. \\nContacted their website to register our complaint. Have been ignored for two months which is why I am posting this now."}
{"label":0,"sentence":"Because of my noobness, the location is wrong, though they are mostly the same, I couldn't figuer out how to change the address..\\n   I want to say the Scottsdale location is better than the Tempe one and the one I mentioned in Oregon. I saw a sweet Johnny Winter signed 67 SG that I did have a stiffy for. But 8grand, please.. Bizaar will get my 8 grand long before GC does.. \\n\\nOK There are no pros for this crappy place except getting to bang out or explore options before I purchase somewhere, anywhere else. First off the reason they have these incredible blowout sales is because the equipment is always inflated or wrecked. The guitar set up is the worse you can get, though no fault of the few good folks that work there. My advice, just go there to beat up crap like everyone else and then purchase online or somewhere else. I saved $1300 on a digital recorder from Yamaha, then went to Guitar Center (in Oregon) for some cables and mics. I was nagged at by a dude there wanting a commision.. I told him $1300 bucks DUDE!!! They never give you a deal on what you need, just what they want to sell..."}
{"label":0,"sentence":"Being from Tucson, I used yelp to try and locate what is supposedly the best mexican food in the Phoenix\/Scottsdale area.  I had high hopes when I arrived at this restaurant.  It is charming, and looks authentic.  Much like the restaurants down in Tucson.  The chips and salsa came out quick, and the service was great.  Chips and salsa were very good.  However, I was disappointed that you only get one serving, and then you have to pay $3 for another....something that I have never seen before.\\n\\nBut sadly, this is was the only positive for the restaurant.  I had a #1 and the person I was eating with had flat enchiladas.  If this is the best Phoenix has to offer, I feel bad for anyone living here.  The food lacked flavor, the green chili sauce tasted like they opened a can and poured it on top.  Beans and rice were not good at all.\\n\\nThe sopapillas were good, but that is not hard to mess up.\\n\\nAlso way overpriced for what you get. \\n\\n\\nDo yourself a favor, and find another restaurant.  Not worth your time."}
{"label":0,"sentence":"After giving this place a good review the last time I was here, last night's episode has made me angry at this place and causes me to recommend that people do not go here unless they want poor service and want to give business to a disreputable establishment.\\n\\nMy wife, daughter and I went for dinner last night since it was their anniversary celebration and they had a special menu and special pricing.  We got there at about 5:45 pm and the place was already packed and we had to put our name on the waiting list.  There was one other party of four ahead of us.  While we waited three other parties of four and two parties of three came along and put their names on the list.  From the banter and greetings from the staff, it was apparent that the staff knew some of these other parties.  After the one party of four that was ahead of us got seated, three other parties, who were after us, were seated ahead of us -- we can only assume that they got seated before us because the staff knew them.  We complained about this but they ignored our complaint and did not even have the courtesy to respond.  So we left.  \\n\\nI think that this is a pretty crappy way to run their business and to treat other customers in this way.  And one other thing --- being a Vegas junkie, I have come to recognize the old saying, \\\"\"money talks, and crap walks\\\"\".  The reason why I mention this old saying is because between me and my family, we eat and drink at least 2-3 times the average person.  So this establish has just lost the business of some very good customers.  But I guess they don't give a damn."}
{"label":0,"sentence":"Worst sushi rolls ever -- the shape and size of a box of Tic Tacs with chewy rice and a rectangular layer of raw fish on the top. Bland, difficult to eat. We were hoping it was the same chef as Social House (restaurant at what is now Khotan's spot) because there was a jalapeno yellowtail sashimi on the menu (like the amazing one we'd had at Social House two years ago). The jalapeno yellowtail sashimi was actually excellent. The rest of the meal was totally downhill. When we started walking upstairs to get our table, the maitre 'd called out, \\\"\"Watch your step because if you fall, I'd have to laugh at you.\\\"\"\\nSo, they can't make sushi and they have some clueless staffers too. Don't waste your time or if you insist on going, try the hot foods versus the sushi rolls."}
{"label":0,"sentence":"Went here for a simple job to line up my facial beard.End up in getting a hair cut and my beard lined up.The worst decision I ever took.I had to go home and completely shave off my face as the lines were uneven .As far as the haircut ,I walked inside there with a normal Clark haircut and left with a fucked up mohak .All this mess cost me 40$.This place is a joke.NO RETURN FOR ME"}
{"label":0,"sentence":"I'm surprised at some of the reviews of this place.  \\nThe service was okay.  The drinks were a little slow, but the time on food was fine.  There were only about 5-6 tables of people at the time I was there.  \\n\\nThe food is mediocre, but not as bad as some of the other sushi bars in the area.  They make decent nigiri.  I didn't have any \\\"\"signature rolls\\\"\" or anything.  I had the agedashi tofu as well, it was pretty weak.\\n\\nMy biggest complaint was the cleanliness.  This is why I rated it as low as I did.  A sushi bar MUST be clean.  There was a big sticky ring right in the middle of the bar where I was sitting.  My allergies suck right now, but my wife said it smelled fishy.  The area behind the bar (and for some reason the ceiling above it) were far from spotless.  For me cleanliness is a deal breaker at a sushi bar so I will probably never return.\\n\\nOf course the bathroom totally sucked as well."}
{"label":0,"sentence":"Mediocre at best --   There are much better Indian restaurants in the city"}
{"label":0,"sentence":"I will never recommend this daycare. First problem is their prices. It's almost $20 more per day than most other daycares. Plus make sure you always make your reservation and pray you never get called into work at the last minute or it cost you $18 per day per kid drop in fee. Also pray your child never has allergies, a tummy ache, is sleepy or anything like that. Because then they charge you sniffle rates which is $15 per day per kid. OH and btw there is also a weekly fee on top of all that. It came to $700-$800 a week for three kids. Our current daycare is only $400. \\n\\nNext, we did not mind paying that much because our daughter has a major learning disability that presents itself a lot like autism. We were assured over and over that they were trained to handle her. But from day one we were getting calls almost every single day to drop everything at work to come get her. Claimed they couldn't handle her. That she was throwing fits. We duh, that's what kids with her problem do, but funny every single time we showed up she was never in the middle of a fit. We also didn't mind paying because it was one of the few 24\/7 daycare and me and my kid's father needed that for our work schedules. Problem is that our daughter is an insomniac and they refused to give her the meds they doctor said because they were OTC and said she was disrupting other kids by staying awake, even though every time we picked her up, she was sitting at a time quietly coloring. But they told us we couldn't have her there past 9pm if she wouldn't sleep. On top of it they called constantly about my son's allergies and demanded we pick him up. We went to California for the weekend and the kids got mosquitos bites and they called saying we had to pick them up and have a doctors note that they were not chicken pox or bed bugs. Really, so many years claimed to have watching kids and you can't tell the difference? Even our doctor thought it was pointless. \\n\\nIn Feb our oldest missed two weeks of school because she caught the Noro virus from there. We tried to be understanding that it was hitting Vegas bad and with parents working at casinos and then getting the kids, it would be hard to not bring it in.  But twice we the kids got lice from them, the second time is when we yanked them out. And several times when we went in there were signs warning us that our kids had been exposed to things like strep throat, ring worm and pink eye. \\n\\nAll of this got so bad that I lost my job over not having reliable daycare. They also let my son crack his head on something, yet no one could tell us how a two year old child got this huge welt on his head. They lost clothes, medicine, shoes and my daughter's $50 leather boots were destroyed by another kid and the teach did nothing to stop it. And the director is not helpful at all, she is rude and condescending. \\n\\nWe are not the only one with issues, my friend yanked her son out after he was being bit everyday and no one knew how. \\n\\nWe have since moved the kids to a new 24\/7 day care we found closer to home. They love it and we have not had a single call about any of the kids. They get free Karate and Gymnastics, another thing CC charges for, and we pay less then half what we did at this place."}
{"label":1,"sentence":"The must-eat for serious steakhouse enthusiasts. I've been made fun of for my love for the petite medallions (2 of 'em) and shrimp (Louisiana-style) on top, but there's nothing petite about my appetite, I kid you not. Put two of them together, and it's a luscious filet mignon meal. The cocktails are off the hook; and the delectable creamed spinach is an essential on the side. \\\"\"Ruth's Chris\\\"\" is one of those must-once-a-year occasions, it's expensive, but a necessary splurge for any true steak lover. Note: Don't get butter on your nose like I did; the waiter won't laugh at you but your friends will."}
{"label":1,"sentence":"I love the tomato soup and the berry salad. I get extra croutons for the soup because it's the best to dip with. The berry salad is filled with blue cheese, berries, and delicious candy walnuts. Plus, the salad dressing is made with real berries. \\n\\nThe wait can be long, but it's always worth it. I consider this to be one of my favorite lunch spots in Las Vegas.\\n\\nI want to send a extra thank you to Angelica who assisted my family. Her service was 5 star!"}
{"label":1,"sentence":"ok...we have family in town staying at the Palazzo so of course a meal at Zine was a gimme. though pricey...the food was delicious! started out with the wor wonton soup then came honey glazed walnut shrimp, pepper crusted beef tenderloin, fried rice w\/shrimp & pork and sweet & sour pork...the portions were perfect...there was no take home tonight...it was all good. the place had a decent crowd for a saturday nite but we were a party of 5 without reservations and were seated within 5 minutes. \\n\\nhighly recommend!"}
{"label":1,"sentence":"For a small little venue, this is one of the hidden gems of Scottsdale.  The admission is normally just $10, and you buy your typical 2 drinks\/item during the show.  The drinks and appetizers were very good quality, and we got served in the appropriate times of the show.  \\n\\nYou had a nice intimate atmosphere with the comedians.  That may mean he\/she picks on you more, but it makes it more fun and entertaining.  During our show, the headliner was some famous guy from the Food Network who also did several smaller skits on HBO.  I think the comedians are very original and know how to play off of the crowd."}
{"label":1,"sentence":"Had the Bun Bo Hue with spring rolls and a young coconut to drink.\\n\\nThe soup was delicious all normal condiments were provided and service was excellent! Their water has a secret in it that you just have to try. Very different from other restaurants but very delicious!"}
{"label":1,"sentence":"This is a higher end Portuguese establishment located in Vieux-Montr\\u00e9al.  The service is like a dance and on point.  The food is fine dinning and creative.\\n\\nWe had a reservation for 6 people this past Saturday evening.  I've been told by locals that its rare that people can just walk into a place like this one on a weekend, so I advise making a reservation. \\n\\nPros: Presunto! Presunto! Presunto! \\n\\n-The food is not only lovely and delightfully pleasant to look at, but its outstandingly  delicious.  We had a number of tapas items from salads, presunto platters and assortment of traditional mussel dishes.  I was accompanied by friends who frequent this establishment, so the server had the run of the table.  He suggested a variety of tapas not on the menu.  The traditional Portuguese flavors were present with a French flair and presentation.  The menu is simple and reads in both Portuguese and French.  English menus have to be requested. \\n\\n-The service is on point.  The water glass was always full and the table was serviced without question.  Our server was professional and introduced the tapas plates and specials in a gregarious , flamboyant and boisterous manner.  Its in European style here and very entertaining!    \\n\\n-Location is the best in Montreal in my opinion.  There are other beautiful areas like the wealthy residential section of Outremont as well, but something always pulls me to Vieux-Montr\\u00e9al.  There are numerous options in this area and the service can be impeccable. \\n\\nNow with better food and impeccable service comes in higher prices.  A dish can run from $32- $62.00.  Be sure to tip the wait staff 15-20%."}
{"label":1,"sentence":"My brother and I used to frequent this place often when he lived in town. They have the most amazing desserts I've ever tasted. The menu changes depending on the season but it is superb. The atmosphere is very hip and modern. The service is great. Best of all, Chef Kerry Simon is very involved and is a very kind and humble guy. Love this place. Will be going back soon!"}
{"label":1,"sentence":"I was so worried this morning when the AC went out and the forecast called for Sunny, Sunny, Sunny! I chose Number 1 based off their Yelp reviews. They were prompt, thorough and affordable. I spoke with Steve on the phone and was serviced by Leon. My AC is working again and it's only 8:15am! I have their card on the fridge and will be using them again."}
{"label":1,"sentence":"Excellent food and reasonably priced.  I had the Tomato, basil and mozzarella sandwich, which was delicious.  They gave me a cafe mocha as a challenge, saying I will never want one from that 'other' coffee shop again.  ;). It was delish as well.  I would definitely return!"}
{"label":1,"sentence":"Have driven by this place for months and finally got a chance to go.  The first time it was closed due to a family emergency.  Second try they were open - yay!  \\n\\nSimple menu and reasonable prices.  We decided to eat in.  There were a couple others dining in while we were there, still more came to pick up and go.  We tried the fried cod & the fried pawns.  Both came with a garlic-seasoned cole slaw.  Cod was one large piece of fish, not overly breaded.  Pawns were qty of 6, butterflied and breaded.   Ample portion of fries came with both.  \\n\\nWe were served by an enthusiastic owner who genuinely appreciates the business and is doing his best to serve.  Fish & chips is a nice addition to the Scottsdale restaurant line-up.  Patronize the locals and keep the money at home.  \\n\\nNote - they accept credit cards but VISA & MC only.\\n\\nThank you, Seattle's Best.  You remind me of home, but the weather is a whole lot nicer here."}
{"label":1,"sentence":"Best out in the neighborhood in my view. Well balanced pho broth. I come here several times a week. Best 6 bucks money can buy for lunch!  I get the 114 no tripe."}
{"label":1,"sentence":"Love love love this place. Aiden is an artist. He is such a perfectionist and truly cares about how your nails look. He is so knowledgeable and has definitely taken his time to perfect his craft. I definitely recommend him and his luxury nail salon. You won't be dissapointed!!!!"}
{"label":1,"sentence":"Very good food here. First time in nc altogether so i didn't think i could come across anything authentic. Try the salt n pepper squid and canh chua.  The vietnamese iced coffee is outstanding. Only complaint is the I'm not used to the higher price point in comparison to tx. Still a great find."}
{"label":1,"sentence":"When we were on vacation, my friends and I came upon this place by chance. It's a no-nonsense place but with authentic Japanese food. And it was GOOD. REAL GOOD. We were the only customers in there because they were about to close. But they took our orders and never rushed us. The owners and their daughter were extremely polite. Definitely a place I'd go back to when I'm around AZ again."}
{"label":1,"sentence":"Cheeseburger and fries were delicious! \\nPrices are seasonable for the size of the burger and all the condiment options to choose from. \\nService was great! Friendly and helpful staff. \\nClean seating areas inside the restaurant."}
{"label":1,"sentence":"My boyfriend was first introduced to Euro-Deli Batory by his good friend, who incidentally had lived in Poland for many years. We've since moved just down the street from this little secret of a place (not necessarily a factor in our decision), unassumingly nestled between the wood-smoke bagel shops of central Mile-End. \\n\\nThe menu is pretty straightforward, tacked up on a long strip above the deli counters of fresh meats and cheeses. They serve classic Polish homestyle fare, including pierogies, stuffed cabbage rolls, Polish sausage, hunter's stew, borscht, and potato pancakes. They even serve fresh (and bottled to take home, if you want) tripe soup, as well as what I term \\\"\"the man plate\\\"\" - the \\\"\"Polski Talarz\\\"\", which is made up of a huge medley of everything. \\n\\nInside, wooden walls give the impression of a small, warm cabin in the winter, ideal for the lengthy Montreal winters. A few tables are tucked to one side, and sitting beside them, a tiny grocery section filled with sweet treats. \\n\\nService is friendly and quick. Prices are very reasonable and the food is always cooked hot and fresh. Really, what more can you ask for?"}
{"label":1,"sentence":"Can't beat the price for an afternoon or morning of play for the kids! The new snack bar is great and I like that there are rooms for the smaller kids to play away from the more rambunctious older kids.  I wish it was closer but we'll worth the drive to let my girl run and play till she nearly falls asleep on her feet!"}
{"label":1,"sentence":"Very delicious! I'm not going to rave about all the flavor blah blah blah..because everyone already has int their reviews!\\n\\nThe boy and I just returned from Italy 3 weeks ago, and this place still seemed pretty authentic considering it's in Madison. \\n\\nWhy the 4 stars?\\nThe woman behind the counter was friendly and helpful..until we asked for brewed coffee.\\nShe didn't have a pot ready.\\nHer response.. \\\"\"Well, I guuuuueess I could put one on for you. It'll take a few minutes.\\\"\"\\n\\nNot rude, just put out sounding.\\nWhich was strange. Since her ENTIRE job is to serve customers their orders.\\nAnd ours wasn't complicated, or annoying or even strange. \\nJust wanted some coffee with our gelato.\\nWe didn't wait, just took the yummy gelato goodness to go.\\n\\nBut really..4 very pleasant customers, 2 of whom want coffee...is that so hard\/annoying?"}
{"label":1,"sentence":"Just ate here for the first time. Here are my impressions:\\n\\nLoved the atmosphere (much more so then 5 Guys)\\nLOVED the veggie Frites. So nice to know that you can get real, fresh,        veggies at a fast food joint. We went back and got a 2nd order.\\n\\nChicken salad was 5 stars for a fast food joint.\\n\\nThe burger was good, not great. Tasted slightly greasy. Bun was yummy.\\n\\nI ordered the regular fries (supposedly like McDonald's original). They were ok. Could have been hotter. I guess I am getting spoiled by fries that are more like 5 Guys (fresh cut, skin on).\\n\\nI had a coke float with Hagan Daz vanilla ice cream in it. Very generous portion of ice cream and I got to add my own coke and keep refilling as many times as I wanted. I thought that was awesome. \\n\\nMy obvious comparison to 5 guys is because these are really the only 2 burger chains that are a cut above all of the rest. (Sorry In and Out, these 2 are better)\\n\\nSo, 5 Guys wins on the burgers and fries, but Smashburger wins in all other areas because they have ice cream, not to mention it is Hagan Daz, my favorite, milkshakes and more variety of food choices on the menu and a lot of those are healthy options."}
{"label":1,"sentence":"Had  lovely birthday dinner here for my wife. The setting was nice although the waiter did hand me a flashlight to read the menu. With booths around the perimeter and four tables in line down the center the size was intimate, but not isolated. Service was excellent and the food was very good and nicely presented. Rating is on the high end of four stars."}
{"label":1,"sentence":"These are the absolute best cupcakes around!  You will not be disappointed!"}
{"label":1,"sentence":"This has got to be the best Thai food in Arizona!!! My favorite is the Ginger Pork. My husband loves the Cashew Chicken. Make sure to save room for the FBI (Fried banana ice cream). The owners are friendly and come out and talk to you if they can. Great family business!!!"}
{"label":1,"sentence":"I stopped by Molly's stand in Mund's Park with my family and I could not have been more impressed with the tamales. The gentleman working that rainy morning was one of the friendliest people I came across in Arizona. While he tamales were being steamed he asked questions about my vacation a seemed genuinely interested. To top it off, the tamales were outstanding."}
{"label":1,"sentence":"I actually really enjoy this place. It is a super cute resturaunt built from two old phoenix houses linked together.\\n\\nMost of the food is not spectacular but never bad. The mizithra cheese however is so good, the chicken marsala, amazing and flavorful, and the tuscan chicken sandwich (only available at lunch time) very craveable.\\n\\n\\n\\nMost of the salad dressing are made on site, and while I personally am a fan of the bleu cheese, most of my friends go for the creamy pesto.\\n\\nThe bread is delivered fresh daily and once upon a time long long ago when I served tables here for a short time a small loaf of bread was my nightly dinner and quite satisfying.\\n\\nBecause I worked here I can also tell you the kitchen staff back then was always terrific and the whole place very clean.\\n\\nThe price and atmosphere make this a simple and enjoyable place to grab dinner with friends...or sit with your date in the trolly.\\n\\nFor the small prices to get soup or salad, a drink, bread, dinner and a scoop or spumoni, what more can you ask for?\\n\\nAnother notable fact: the location is actually ranked as one of the top haunted places in AZ.  When I worked there the power went out one night and i swear to you we could hear footsteps up in the attic!"}
{"label":1,"sentence":"I live in a Foodie town, and sometimes while I'm in Vegas I never seem to find anything that great unless I eat at an expensive restaurant. So when I do make that choice to eat expensively I go to Smith and Wollensky...mouth is salivating now thinking about their steak with gorgonzola cheese baked on top....\\n\\nI love eating here and make a point of stopping by every time I'm in Vegas. You just can't pass up a good steak..."}
{"label":1,"sentence":"I am a Phoenix\/Glendale native and have grown up on many of the different mexican bakeries over the past 50 years or so here in the valley.\\nOur family has always kept the bakery items as a special occasional treat and we have not found any that are as good as La Purisima...we used to go to the one in Glendale...but then moved to the east valley and only got these little treats on the rare occasion we would be in Glendale...then we found the one in Phoenix!  Still far, but we will sometimes make a trip just for the pastries (pan de huevo). I am hispanic and love their tamales---(very good masa) and they have good tortillas as well.  I could continue to rave on this place forever....well worth the trip!!  Only downfall is CASH ONLY---but it's understandable during these tough times.\\n\\nUpdate  July 2012--the bakery is now called La Promesa--still as good--and they take credit cards now!\\n\\nUpdate--Name has been changed back to La Purisima and they are on a cash only system again.  Still same great quality.  Just bought my masa for our annual tamales from them again."}
{"label":1,"sentence":"Good Persian food with quality basmati rice. Fast and friendly service. Reasonable prices.  \\nI highly recommend it to everyone."}
{"label":1,"sentence":"These guys have always taken good care of my car.  I've been coming to them for 3 years, and only one time did they miss something.  Their prices aren't bad either.  They usually have specials during the week when it's slow."}
{"label":1,"sentence":"Mmmm... Chuck Box... Droooool...\\n\\nSo this place looks kind of run down, some of the staff looks a little scary, and there's literally a 1\\\"\" thick layer of grime on the brick next to the grill that's probably taken 40 years to build up, but damn is it a good burger. This is one of those places where they go out of their way to disgust you and you still come back because the food is so good."}
{"label":1,"sentence":"I enjoy doing business here because I always know I'll be greeted by friendly, helpful people. They provide a quality, affordable product and in a very efficient manner. I highly recommend them!"}
{"label":1,"sentence":"The food at Rosita's is great, the service fine. Their salsas set the standard for the area. The only issues with Rosita's have to do with the neighborhood and the parking. That aside, Rosita's is hard to beat for a balance of price and overall quality."}
{"label":1,"sentence":"Cracker Barrel is an old time favorite of ours. Love the genuine hospitality and the charm and character of the place.\\n\\nMac and Cheese along with the hash brown casserole are amazing!\\n\\nLoved the Dumplings!\\n\\nSweet Tea is the best - especially since you can't get sweet tea here."}
{"label":1,"sentence":"Vulgar.  Raunchy.  Awkward.\\nSide-splitting.  Preposterous.  Very funny.\\n\\nWarning: those who pride themselves on being virtuous, take themselves as serious-minded, prefer a lecture than a comedy -- need not come.  Then again, maybe you should!  It's sexual, where cabaret meets burlesque meets Cirque du Soleil.\\n\\nIn a small but amazingly decorate tent in the round on the grounds of Caesars Palace, audience members are 5-30 feet away from the action.  Incredible performances, one after the other and mostly acrobatic in nature varying from tight robe to ribbon to tap, brawn and might, beautiful bodies in action, with comedic hosting by Penny and the Gazillionaire (think Borat), who provide plenty of laughs.\\n\\nIt's definitely a show I'll remember forever.\\n\\nTip1: If you want to avoid being picked on, sit a few rows back.  If not, beware!\\nTip2: Not for kids!\\nTip3: Parents who go with the adult children -- not on your life.  Awk!"}
{"label":1,"sentence":"This is one of my favorite Walmart's by far. It is always clean and well stocked. The staff are amazing, very helpful and very friendly. Carol the door greeter is such a sweetheart! The produce and dairy departments rock. Oh yea the bakery\/deli crew is pretty to too. Overall Id say all the department's hold it down! I will say on the down side it does get really busy. Expect long lines on weekends."}
{"label":1,"sentence":"I got the deal on livingsocial.com I was happy with the whole experience. The complimentary breakfast and the shuttle (which is more like a ford explorer car) if you thinking shuttle its \\\"\"not\\\"\"! The room was nice, clean, well organized. I was in room 534 & got 2 cards (to use to get in my room, to the pool, gym, the elevator). I was in a two queen bedroom. I could see the strip from my room from a far distance. It was a 2 nights & 3 day stay. The added fees just for staying (the days we did) was a total of $31.50. I was happy with the daily fees\/tax compared to other places. You give them your car licence plate (if you park your car there) so your car will not get towed and parking is free.\\n\\n\\\"\"Daily\\\"\" fee\/tax (I received once I checked out; they give me a print out) \\n\\nRoom tax: $4.56\\nAmenities fee: $9.99\\nAmenities fee tax: $1.20\\n\\nhttps:\/\/www.livingsocial.com\/escapes\/properties\/74102-contemporary-hotel-stay-for-under-50\\n\\n\\u2122 4\/18\/14 - 4\/20\/2014"}
{"label":1,"sentence":"Great fried rice and Mongolian beef! The only thing I didn't care for was the orange chicken it tasted weird."}
{"label":1,"sentence":"Its been about a little over 3 years since i've been here, so i will only base my rating on the experiences i had here then.\\n\\nI moved to AZ when I graduated from highschool and made friends with a bunch of other non arizonians and we came here probably 3 times a week for happy hour. I was only 18 and the rest of my \\\"\"crew\\\"\" were of age. I had never had sushi before so this place was a little intimitating at first, but once i started to try it, i enjoyed it very much so. (Now that i'm more of a sushi expert, i can say their sushi wasn't great, but good for beginners.) I can still say (at least 3 years ago) that they have the best calamari i've ever had. This place, at the time, had a great atmosphere and saki bombs were okay to do here... \\n\\nIt may have just been the company i was with, but i greatly enjoyed coming to this place and sneaking saki bombs and shots :)\\n\\nnext time i go back to AZ to visit, this place is a must"}
{"label":1,"sentence":"I had the most incredible massage experience this morning with Marisa! I also thank the staff for being so accomidating and understanding, my truck broke down on way, causing me to be late, but they took time to make sure I still had a full massage (although, I mentioned, I would still pay full price for whatever time was left) they had extra time on schedule and took great care of me! Marisa was such a wonderful therapist, very healing and I would reccomend asking for her if you have not had the pleasure yet, although, Im sure they are all great. I will be back for Marisa soon. Thank you 34 weeks"}
{"label":1,"sentence":"the show is good while some ppl were smoking inside the dance area."}
{"label":1,"sentence":"I only get the Tonkatsu ramen here.  It's a rich, creamy broth served with awesome chasu (pork) and some pickled veggies.  I really am impressed with this broth as it just adds SO MUCH to the taste of their wonderful noodles. \\n\\nThink this is the top ramen place in Las Vegas.  Ichiza's is a bit bland - though it's probably much healthier.  Monta might be a little sparse on the veggies which is why I only give it 4 stars instead of 5.  Ramen, in my opinion, should be a little healthier than they make it.  Maybe that's just my Chinese preference rather than the way the Japanese do it.\\n\\nStill...you can't go wrong.  Get an extra egg too - cooked perfectly."}
{"label":1,"sentence":"I went here for brunch today with my mom. This place is super cute, it has a really nice looking patio and the inside is small, but clean and comfortable. I got the veggie scramble sandwich with orange juice and she got a blt. It was so inexpensive! My mom had a coupon for bogo entrees with the purchase of two drinks which brought our total to 8$. Seriously?!?! Without the coup it would be like 12$....pretty amazing. The food was good. It was not the most amazing food ever, but it was fresh and cooked by a person in a pan (not in a microwave) and beats the pants off of an Einstein bagel sandwich or anywhere else with comparable prices. The veggie scramble had a variety of tasty vegetables like eggplant and mushrooms in addition to cheese and tomato. My mom enjoyed her sandwich (and the couscous that came with it). I saw some other people get salads...they were huge! I would definitely come here again for breakfast and would like to try lunch here."}
{"label":1,"sentence":"I've been here a few times. We always try to stop here for a meal before we head home from our trip.\\n\\nI've yet to try their shakes which I hear are superb, but next time for sure. \\n\\nI got their sliders the first time and their classic burger the second time.\\nThe burgers were pefectly done, well to the way I asked for it anyway.\\n\\nIn summary, the food is good and the service is slow. But I like it."}
{"label":1,"sentence":"I love going to restaurants off the strip to experience great food and good value.   I love the decor and the concept of this restaurant.    I think they need to offer more pre-fixed menus options for people that are new to the concept.  Overall, great experience and we will be back when we return to Vegas in a couple months."}
{"label":1,"sentence":"When compared to Buffalo Wild Wings or Wingstop the only up those places have on this joint is the atmosphere. This place is perfect for to-go orders and they even have a drive thru. You get 12 wings for around $5.50. They offer a special too of about 75 wings for $27 if you need to fill a boatload of peeps.  they also have hamburgers, hotdogs, fries, fried zucchini and salads. They have about 5 ,levels of hot, a honey hot(which is finger licking good) and a honey bbq.  i thought it was odd that their wings only came with carrots no celery...never have I gotten wings without celery. Besides that wings were very good and the sauce makes them addicting."}
{"label":1,"sentence":"Ah CES.... Nerd Paradise... the EDC of technology... and one of the best ways to start the new year.\\n\\nI have been coming to CES for the past three years and its something I very much look forward too. Major tech companies from around the world converge on Las Vegas showing off the latest and greatest in technology. There is so much going on during CES week not just at the Las Vegas Convention Center but all over town. \\n\\nThe best part of the event? Its free if you register early enough. There are a couple staples of the show that you must stop by: Audi, Samsung, LG, Intel, and Sony. These manufacturers are they showing off all their new stuff and its pretty impressive. Traffic around the convention center is usually a nightmare so make sure you plan accordingly. If you are looking for free swag keep a look out the small 'mom n pop' manufacturers in South Hall, the major companies don't really give anything away.  \\n\\n\\nCouple of recommendations:\\n\\nWear comfortable shoes as you will be walking alot.\\n\\nPark at the Venetian\/Palazzo as they have a free shuttle service. \\n\\nBring snacks - there are alot of places to eat at the convention center but their prices are ridiculous."}
{"label":1,"sentence":"I looooooooove Trader Joe's!!!!  That's about all I can say.  The food, the wine, the frozen veggie selection, the ready-made soups and wraps for quick lunches....it's all good!  Pretty much the only thing I don't ever buy here is dog\/cat food because it's super expensive compared to Food Lion or hell, even Target or Wal-Mart.  But, I like to go here when I need to put a few things together for a quick meal, or if I need some of their yummy cheap wine.  I don't drink the Charles Schwab (sometimes known as \\\"\"2 buck chuck\\\"\") because it is pretty terrible, but I have found a few bottles of red that don't break the bank and taste pretty darn good.  A few of my faves include Purple Moon and some Syrah that has a smiley face on the bottle....not sure of the name.  \\n\\nThe crappy thing about this location and the only reason I'm giving it 4 stars instead of 5 is because of the parking lot.  It is in a garage and to put it mildly, it blows.  It's too small and the time that I usually go (around 4:30 or 5), the place is super packed.\\n\\nOther than that, I'm a big big fan!"}
{"label":1,"sentence":"Great gym if you're not looking for the mega mall type gyms like 24 hour fitness. Never really more than 10 people when I go. Have all the equipment you really need! I also feel very safe going here after hours its in a good area and all the people that go are really nice, no creepos. I don't know why someone wrote about about problems with the staff, the only guy that works here (that I know of) is the manager who is helpful, nice, and funnily sarcastic (in a good way)."}
{"label":1,"sentence":"Can't believe I haven't written a review for AJ Bombers yet. I've been to this place 3 times in the last year or so. I would go more often but I'm not downtown a lot. \\n\\nThis place is just burger-tastic-fun! Very casual - the walls are all written on by previous customers. They are known for their amazing burgers - at least one was featured on the Food Network and won best burger in Milwaukee. They also have these P-Nut ships that they fill with peanuts in the shell and slide across the room by these wires hanging from the ceiling to different tables. When the ship hits the end of the line - the peanuts come raining down into a bucket. Yummy peanuts and shells all over the floor. Great entertainment for kids or the young at heart.\\n\\nAll the food I've had is pretty darn good. I've tried several burgers, frickles (fried pickles), Tatchos (nachos made with tator tots!) and more. Not really your health eating  destination - but oh so good when you want to be burger-naughty. \\n\\nGood place too to watch the game. We went to watch a Brewer game and there were plenty of TVs and the very accommodating staff was helpful to seat us near a big TV and make sure the game was on. \\n\\nVery fun place!"}
{"label":1,"sentence":"I've been here several times and they never disappoint. The tapas and creative combinations are delicious. A must try when you visit Las Vegas."}
{"label":1,"sentence":"this place is HOT in all aspects. their chicken is damn good and the atmosphere in the place does get a little too hot at times. it's awesome though! i like the friendly service they provide. \\n\\nthe food is very RICH especially their iced tea, it's like drinking pure sugar, soooo good... sometimes - like once a year. but other than that the food is great!! i suggest trying it out and see for yourself. i love fried chicken and waffle so i can't really complain. their corn bread is good too! it makes me salivate just thinking about the greasiness. YUMMM!!!"}
{"label":1,"sentence":"I have had breakfast here several times now.  I usually stick with the scrambles or omelets and have yet to be disappointed.  The eggs are always cooked perfectly and the ingredients are fresh.  I especially enjoy there seasoned potatoes.  \\n\\nGood breakfast atmosphere with a nice location close to the freeway.  Service was fast and they actually refilled my water glass throughout the meal!  \\n\\nThe go-to place on the weekend for breakfast in Henderson."}
{"label":1,"sentence":"I love this place!  It would have gotten 5 stars out of me, but they don't serve real hash browns. They serve patties.....frozen. That really bums me out. But everything else is really good. Had the pleasure of being served by Bambi.  Im sure I wasn't very original when I asked if that was her real name. But if she was annoyed, it didn't show. She gave me awesome service and was a pleasurable personality, especIf they get real hash browns, I'll change it to a 5 star. Ask for Bambi."}
{"label":1,"sentence":"I went to Star Bar on Tuesday, during their \\\"\"soft\\\"\" opening, and then again Thursday, during their grand opening. \\n\\nAs a bar, the potential is definitely there. It's got a great list of beers on tap (various stouts, IPAs, etc...), a decent selection of cocktails (they mostly tend towards the sugary and sweet side), friendly, gregarious bartenders and a very modern atmosphere.\\n\\nIt also helps that it's in my building, so I can literally roll out of bed (after a late-afternoon nap obviously), step out in my PJs and get some brewskis. \\n\\nMy only issue with this place is that it needs to find its identity. Who is your clientele? Obviously folks at the Constellation, but which crowd? I dig the high end, fancy drinks. But if you were going for a more loungey theme, include more wrap around couches and seating in general.\\n\\nIt was absolutely crowded the two days I went, and most people had to cram into the middle. More chairs would have been awesome.\\n\\nAlso, I dig the dim lighting, but the two TVs really distract from the overall atmosphere. The atmosphere doesn't really lend itself as a sports bar, so having sports game on (while good in most scenarios) will only detract from the conversation people are looking to have.\\n\\nOther than those small issues, I can safely say that a new star has been born on the east side of Madison!"}
{"label":1,"sentence":"Paying tax...I like this place, clean, people are friendly as well..."}
{"label":1,"sentence":"4 star review for Friday nights @ Jackrabbit.\\n\\nI had never been to Jackrabbit before so I can't speak for how it used to be, but Friday nights are very nice. The crowd is a sophisticated mix of urban professionals and the music is hip hop\/r & b. The cover is an affordable $10 and they have 2 bars. The atmosphere reminded me of lounges in Chicago which being a Chicago native was right up my alley. If the thought of spending another Friday night @ Myst avoiding the hood crowd, please make your way to Jackrabbit as you won't be disappointed."}
{"label":1,"sentence":"Had the southwestern shrimp burro and crab relleno.  It was very good!  Margarita was okay."}
{"label":1,"sentence":"I have only had takeout from Tai Pei, but the chicken lo mein was delicious and the general tso's was the best I have ever had! It was sweet, but still had a kick to it. Nothing was over priced and we weren't waiting forever for delivery. Will definitely visit the restaurant in the future!"}
{"label":1,"sentence":"Open when you need something to be open.\\n\\nFriendly staff who are happy to be there.\\n\\nDelicious breakfast burrito and creative yummy hot dogs.\\n\\nBe adventurous, let the cook pick and you won't be disappointed."}
{"label":1,"sentence":"The citrus\/spiced grilled chicken is awesome!  Beats the other greasy fast food places hands down.  Fresh salsa and pico etc.  is really great.  Had to eat here twice on my trip.   Too bad there is no franchise in the Midwest!"}
{"label":1,"sentence":"Clean and friendly, and fresh fare that is always good.  I like the new fuji apple, gorgonzola, grilled chicken topped salad.  Also the Asian chicken and BBQ chopped salads, and lemon, chocolate chip, or snickerdoodle cookies..."}
{"label":1,"sentence":"My daughter loves to go to Gymboree. She attends both classes and open play time. She is an only child without much interaction with kids her age (15 months) so we found Gymboree a great place for her to interact with other little ones her age. The teachers also really seem to enjoy their jobs and being with the kids. My daughter usually wants to sit with her teacher instead of me these days. It is a little expensive, but we find it is worth it to have a well balanced child."}
{"label":1,"sentence":"great frozen yogurt!!"}
{"label":1,"sentence":"Awesome Greek food! Its now my new favorite place to eat Greek food. The food is amazing but so are the people who were there. They are so nice and friendly. Also the atmosphere was amazing. You cannot go wrong by eating here!"}
{"label":1,"sentence":"I love this place! I came here ALL the time. The staff is always really friendly and even when there really busy I have never had to wait long for my drink to be made."}
