{"label":0,"sentence":"Tokyo Stocks Higher in Early Trading (AP) AP - Tokyo's benchmark stock index was higher Thursday morning as investors bought stock futures in a technical bounce, but trade was largely directionless after Wall Street's mixed performance. The dollar was slightly higher against the Japanese yen."}
{"label":0,"sentence":"Iran Converts Uranium in Defiance of UN  By Francois Murphy VIENNA (Reuters) - Iran defied the  United Nations on Tuesday by announcing it has begun converting  a large amount of raw uranium to prepare it for enrichment, a  process that can be used to develop atomic bombs."}
{"label":0,"sentence":"Italian women kidnapped in raid on relief agency BAGHDADGunmen kidnapped two Italian women working for an aid agency and two Iraqis in broad daylight in central Baghdad yesterday."}
{"label":0,"sentence":"Afghanistan #39;s Karzai in Pakistan for terror talks Afghan President Hamid Karzai began a visit to neighbouring Pakistan on Monday to discuss cooperation in the battle against Islamic militants ahead of his October re-election bid."}
{"label":0,"sentence":"For Young Armenians, a Promised Land Without Promise An independent Armenia has proved too constricting and its promise too distant for the next generation's ambitions."}
{"label":0,"sentence":"House Leadership Blocks Vote on Intelligence Bill A core of highly conservative Republicans aligned with the Pentagon moved to block a vote on a bill that would have enacted the recommendations of the 9\/11 panel."}
{"label":0,"sentence":"Barroso 'backs down' on EU vote The incoming EU Commission president is to call for a delay in a crucial vote on his new team, reports say."}
{"label":0,"sentence":"Mbeki in Ivory Coast rebel town on peace mission President Thabo Mbeki took his peace mission to Ivory Coast #39;s rebel-held stronghold of Bouake today, where he was greeted by hundreds of people demanding Laurent Gbagbo, the president, quit."}
{"label":0,"sentence":"Testimony Opens in 9\/11 Retrial Case (AP) AP - A witness who knew the Hamburg-based Sept. 11 hijackers outlined the group's hatred of Israel and said its members believed suicide attacks were legitimate as testimony opened Tuesday in the retrial of a Moroccan accused of helping the pilots."}
{"label":0,"sentence":"Israeli violence continues in Gaza, 4 Palestinians killed Israeli occupation forces killed four Palestinian fighters in Gaza Strip early Monday, saying that two of them were trying to cross the fenced border from the territory in a rare case of its kind, military sources said."}
{"label":0,"sentence":"Addressing UN Assembly, Annan urges nations to restore respect for &lt;b&gt;...&lt;\/b&gt; Decrying what he described as  quot;shameless quot; disregard for the rule of law around the globe, United Nations Secretary-General Kofi Annan yesterday urged world leaders gathered at the General Assembly to do everything within their power to restore respect for "}
{"label":0,"sentence":"Cuban President Fidel Castro Honors Hugo Chavez Havana, Dec 14 (AIN) Cuban President Fidel Castro awarded visiting Venezuelan Head of State Hugo Chavez with the Carlos Manuel de Cespedes Order at a rally marking the 10th anniversary of Chavez #39; first visit to Cuba."}
{"label":0,"sentence":"Bush to Meet With Leaders of Mexico, Chile President Bush aims to dispel the perception of U.S. neglect of Latin America and burnish an American reputation damaged by the Iraq war, undertaking a second-term diplomatic offensive in the region akin to his recent courting of Europe."}
{"label":0,"sentence":"Routine operation but more evidence of heart trouble Tony Blair will undergo a catheter ablation operation which will correct his heart #39;s abnormal rhythm - a condition the Prime Minister has suffered from in the past."}
{"label":0,"sentence":"Strong Quake Shakes Northern Japan, Felt in Tokyo  TOKYO (Reuters) - An earthquake with a preliminary  magnitude of 5.6 shook northern Japan on Monday in the same  area where the country's deadliest quake in nine years killed  23 people and injured more than 2,000 two days ago, media  reported."}
{"label":0,"sentence":"Karzai Win Assured as Afghan Poll Count Winds Up  KABUL (Reuters) - Afghan President Hamid Karzai is sure of  victory in his country's historic presidential poll, but the  result will not be announced for a day or so until the last few  ballot boxes are counted, an official said Monday."}
{"label":1,"sentence":"Freshman Sparkles as Notre Dame Rebounds Freshman Darius Walker had two fourth-quarter touchdowns and the Fighting Irish renewed hope for a turnaround season by upsetting the eighth-ranked Wolverines."}
{"label":1,"sentence":"PSV on verge of breaking losing Euro streak PSV Eindhoven look likely to break a run of eight previous failures to reach the knockout phase of the Champions League after their 1-0 win over Norwegians Rosenborg on Tuesday."}
{"label":1,"sentence":"Sky #39;s the limit when it comes to Sox spending If you want to get a rise out of a small-market general manager, ask him about the Red Sox being limited by their budget. Already this weekend at the winter meetings, we #39;ve "}
{"label":1,"sentence":"Gannon Out 6 Weeks Oakland quarterback Rich Gannon has a broken vertebrae in his neck that will sideline him at least six weeks."}
{"label":1,"sentence":"Rogge steps up pressure over Jones drugs claims Marion Jones was under growing pressure last night after the International Olympic Committee president Jacques Rogge set up an investigation into allegations she used banned performance-enhancing drugs."}
{"label":1,"sentence":"Rangers held by Inverness Inverness, Scotland (Sports Network) - Rangers squandered a chance to return to the top of the table Sunday as it was held at Inverness, 1-1."}
{"label":1,"sentence":"Phils fire Bowa PHILADELPHIA - Larry Bowa took the job as Phillies manager facing rows of cameras and scores of reporters. He said goodbye to the job Saturday with a quiet, lonesome walk in the bowels of Citizens Bank Park to his car."}
{"label":1,"sentence":"This is how its done Navy beat Army by two years yesterday, tying the rivalry at an almost-poetic 49-49-7. For while the Midshipmen hired their reparative coach fully three Decembers ago, the "}
{"label":1,"sentence":"Offensive balance eludes Cats Even-mannered and analytical possibly to a fault, the word just fits Bill Snyder. It #39;s more than just Snyder #39;s goal for the Kansas State offense."}
{"label":1,"sentence":"England 2, Wales 0 AFTER having waited 20 years to renew rivalries with their nearest neighbour, Wales are now probably hoping they could have a similar wait for the next encounter."}
{"label":1,"sentence":"Auburn Defeats Virginia Tech in Sugar Bowl  NEW ORLEANS (Sports Network) - Jason Campbell passed for  195 yards and a touchdown, Auburn's defense solidified its  status as one of the nation's toughest, and the third-ranked  Tigers completed the first perfect season in school history  with a 16-13 victory over No. 9 Virginia Tech in the Sugar  Bowl."}
{"label":1,"sentence":"Rangers seek Champions League riches against CSKA Moscow Rangers can reduce their grim 68 million pound (\\$123 million) debt by beating CSKA Moscow in Wednesday #39;s final Champions League qualifier but manager Alex McLeish "}
{"label":1,"sentence":"No predicting a men #39;s winner Picking the men #39;s winner of the US Open, which will begin today in Flushing Meadows, NY, is no sure thing, based on what happened at the year #39;s two previous Grand Slam events."}
{"label":1,"sentence":"Ricky wants to play again He inquires about a return to the NFL but it #39;s doubtful he will play for Miami. DAVIE - After traveling the world, Ricky Williams has decided he would like to play football again."}
{"label":1,"sentence":"Twins #39; young guns impress The notion that young people should be seen, and not heard, has never caught on within the Twins organization. Not in Spring Training."}
{"label":1,"sentence":"Late surge lifts Sonics This is the 10th game, after all, and their start had nothing to do with their 101-94 victory over the Raptors in Toronto last night at Air Canada Centre."}
{"label":2,"sentence":"Regulator Says Fannie Mae Deliberately Flouted Rules Fannie Mae #39;s prime regulator said today that the giant mortgage company deliberately flouted accounting rules to project an image of smooth and relatively low-risk-earnings growth."}
{"label":2,"sentence":"Leading Indicators Decline in August A closely watched measure of future economic activity fell in August for a third consecutive month, reflecting an uncertain climate for both businesses and consumers."}
{"label":2,"sentence":"Caesars plans Wembley casino US casino giant Caesars plans to build a 335m gambling and leisure resort beside the new Wembley Stadium in London, its first foray into Europe."}
{"label":2,"sentence":"Russian Gas Monopoly to Bid for Prize Yukos Oil Assets In an attempt to create a state energy leviathan, the Russian natural gas monopoly Gazprom said today that it would bid for the prize oil assets of Yukos."}
{"label":2,"sentence":"Clear Channel Plays Rough in Motorcycling Battle Supercross is shaping up to be the latest battleground in the fight over media consolidation."}
{"label":2,"sentence":"Markets lower as falling price for oil and BMO earnings fail to &lt;b&gt;...&lt;\/b&gt; TORONTO (CP) - A strong profit report from the Bank of Montreal and a lower price for oil weren #39;t enough to spark buying interest as North American stock markets edged lower Tuesday."}
{"label":2,"sentence":"Banks pay price for money laundering THE fight against money laundering is costing banks and other financial institutions dear as they invest heavily in technology to combat crime, according to a survey by KPMG."}
{"label":2,"sentence":"BC lumber lobby says WTO ruling on Byrd Amendment helps softwood &lt;b&gt;...&lt;\/b&gt; VANCOUVER (CP) - A World Trade Organization ruling gives Canada needed clout to recover more than \\$3 billion in duties destined for US lumber producers, a Canadian lumber lobby says."}
{"label":2,"sentence":"Bank on course to freeze rates Experts expect the Bank of England to leave interest rates on hold at 4.75 on Thursday."}
{"label":2,"sentence":"Incentives Likely to Boost U.S. Car Sales (Reuters) Reuters - A month-end sales blitz of incentives\\by General Motors Corp.  and Ford Motor Co.  to\\clear out older vehicles will spur a slight rise in U.S. car\\and truck sales for September, analysts said."}
{"label":2,"sentence":"File-sharers win court case TWO FILE SHARING companies have been told by a court that they are not liable for people in their networks swapping illegal content. "}
{"label":2,"sentence":"Santander to sell up to 79 million RBS shares SPAINS Santander Central Hispano is to sell up to 79 million shares in Royal Bank of Scotland, and said it will end cross-directorships with RBS if its bid for Abbey National is successful."}
{"label":2,"sentence":"Oil prices rocket to new one-month highs after stocks plunge LONDON : World oil prices sprinted up to new one-month high points as traders showed alarm at a steep fall in US crude oil inventories in the wake of Hurricane Ivan."}
{"label":2,"sentence":"World oil prices hit record highs World oil prices scaled record peaks last night, rising on concern over disruptions to supply from strike-hit producers Nigeria and Norway."}
{"label":2,"sentence":"Travis Perkins to buy Wickes for 950m British building materials merchant Travis Perkins Plc said on Thursday it agreed to pay 950 million (\\$1.84 billion) for home-improvement chain Wickes, sending its shares down nearly 3 percent."}
{"label":2,"sentence":"BusinessWeek Chooses Outsider as Editor in Chief BusinessWeek, reaching outside its own ranks, announced yesterday that it had selected Stephen J. Adler, a senior editor of The Wall Street Journal, as its next editor in chief."}
{"label":3,"sentence":"Red Hat names new CFO Two months after announcing the resignation of its chief financial officer and six weeks after it changed the way it books support subscription revenue, Linux vendor Red Hat Inc. has named a new CFO."}
{"label":3,"sentence":"More Security Holes Found In Internet Explorer 6.0 Three more vulnerabilities in Microsoft #39;s Internet Explorer 6.0 browser were disclosed Wednesday by Danish security vendor Secunia, bringing the total of IE bugs found by the firm in the last two months to an even dozen."}
{"label":3,"sentence":"Is there a future for the 1Gig email services? We all remember April 1st when Google announced its new Gmail web-mail service with an overwhelming 1Gig storage space. Their mere announcement brought a new wave of 1Gig web-mail services such as Walla  , Spymac  and more. Since they don't charge for the service, their plan is to profit from advertisement revenue stream.  It's been 6 month now, and Gmail is still in beta stage and many competitors are joining the scene on an almost daily basis. "}
{"label":3,"sentence":"Two agencies may clash over rare bird Two US Interior Department agencies may clash over separate and apparently incompatible efforts to help the northern sage grouse. The Fish and Wildlife Service is trying to "}
{"label":3,"sentence":"Philly Broadband Clash Pits City Against Telcos (Reuters) Reuters - Philadelphia officials have laid the\\groundwork to provide wireless, high-speed Internet access\\anywhere in the city, but their plan could be scotched under a\\state bill that could be signed into law on Tuesday."}
{"label":3,"sentence":"Mozilla Firefox - setting the world on fire After a year in development, today is the day the Mozilla Foundation released their long awaited browser named Firefox officially launching version 1.0."}
{"label":3,"sentence":"Watchdogs: Broadband policy a bust Consumer advocate organizations say U.S is trailing in broadband and that inequality is increasing."}
{"label":3,"sentence":"PalmOne Updates Treo Phone with Display, Battery  NEW YORK (Reuters) - PalmOne Inc. &lt;A HREF=\"http:\/\/www.reuters.co.uk\/financeQuoteLookup.jhtml?ticker=PLMO.O qtype=sym infotype=info qcat=news\"&gt;PLMO.O&lt;\/A&gt; on Monday  unveiled a new version of its popular Treo that adds a  removable battery and short-range wireless technology to the  device, which combines a mobile phone and digital organizer."}
{"label":3,"sentence":"T-Mobile Checks in at Red Roof T-Mobile Hotspot #39;s network of public venues with Wi-Fi is extensive and its partners are big names you #39;ve heard of(Starbucks, FedEx Kinko #39;s, Borders Books)."}
{"label":3,"sentence":"News: Future Heat Waves: More Severe, More Frequent, and Longer Lasting Heat waves in Chicago, Paris, and elsewhere in North America and Europe will become more intense, more frequent, and longer lasting in the 21st century, according to a new modeling study by two scientists at the National Center for Atmospheric Research (NCAR). (NCAR press release)"}
{"label":3,"sentence":"Microsoft FAT patent falls flat Patent office rejects one of four patents on File Allocation Table format for Windows, though Microsoft can appeal.\\"}
{"label":3,"sentence":"Wisconsin ruling could set \\$300M precedent on modified apps A Wisconsin judge's refusal to order the state to refund sales tax paid by a Neena, Wis., company on a customized SAP AG rollout could relieve the state from paying out more than a quarter of a billion dollars in tax refunds to software users."}
{"label":3,"sentence":"Revenge Really Is Sweet, Study Shows Revenge feels sweet, and Swiss researchers said on Thursday they have the brain scans to prove it. In a study investigators said might "}
{"label":3,"sentence":"More mobile anti-virus appears Trend Micro will become the latest major anti-virus software company to provide protection against mobile phone viruses with the release today of Trend Micro Mobile Security 1.0."}
{"label":3,"sentence":"Nvidia to work on PlayStation 3 chip Graphics chip leader Nvidia announced Tuesday that it is working with Sony to develop the graphics processor for the next version of Sony #39;s PlayStation video game console."}
{"label":3,"sentence":"Consumer Alert: Car Restraint Systems Rated (Nov. 15) -- Would your car protect your head and neck in case of a crash? The Insurance Institute for Highway Safety tested restraint systems in dozens of cars."}
