{"label":0,"sentence":"Normally I'm impressed with Apple Store customer service. This location sucks. Every interaction I have with the staff here is rude. The girl \\\"\"helping\\\"\" me with an exchange was asking me how to do it. Good thing I was there to help. 2 stars only because they are efficient. That's all."}
{"label":0,"sentence":"I remember I went to this movie years ago when it was just a regular theater. Then I went back about a year ago and saw the changes, it was awesome! They took the iPic concept which I love! We watched The Vow and reclined and got over prices mediocre tasting food. But I still loved it! So I wanted to have my boyfriend experience it as well since he liked iPic.\\n\\nWe went and got tickets for Safe Haven (I'm a total chick, I know) and I didn't care how expensive the tickets were because I knew what to expect for that price...my expectations were shot to tell! We sat in a theater where the chairs didn't recline and were uncomfortable. And it pissed me off even more that they had waiters in there because that's the reason they were over priced. If I'm gonna be in a regular theater, then I have no problem with standing in line at the concession stand. Needless to say, it was disappointing. \\n\\nDo yourself a favor and go to iPic."}
{"label":0,"sentence":"One star because the bowls are delicious. Other than that this place is horrendous.  Slow as all hell, pretty much get your order wrong every single time. That's if they even remember to make it.  Usually you wait 15 minutes before finally saying something and they realize they forgot to make it in the first place.\\n\\nMost unorganized operation ever.  If they didn't essentially have a monopoly on the Tempe Acai bowl market I'd never go here.  Their employees deserve less than minimum wage.  Oh and it's overpriced."}
{"label":0,"sentence":"And yet again the same cashier, middle-aged guy with light brown hair plays stupid with me. \\\"\"I can't do split payments.\\\"\"  Dude, you've been at this store for 13 years. I know because I've complained before. You're rude. Unprofessional. Not worthy of my business."}
{"label":0,"sentence":"Please go when it is $2.00 days, that is about what it is worth.  Make sure you eat ahead of time.  Very limited food venders, and no variety.  I will say last year was much different, and  a lot of fun"}
{"label":0,"sentence":"I have been to the Strip location of the Pittsburgh Popcorn Company and I would give that location 4.5 stars. \\n\\nToday I ran into the Oakland location which I hadn't visited prior. When I entered the location was a mess. It looked like behind the counter had not been cleaned in a while. I am assuming that this was because of the business of the location, but the Strip location appears to be much cleaner. \\n\\nI purchased two bags, one of the chocolate caramel and the rice krispy. Both were good. My only concern about the product itself was my bag of rice krispy was had other types of popcorn in it. When I ordered rice krispy, I wasn't hoping to get cheddar or dill pickle. \\n\\nI would suggest that if only is coming to Pittsburgh Popcorn Company for the first time, go to the Strip location. I"}
{"label":0,"sentence":"I wish I knew about this website a few months ago. \\n\\nMy family and I had great experience at other cheesecake factory. This location was a total upset. We made reservation ahead of time for twelve people and the staff rest assured that they can accomodate that much.\\n\\nOur reservation was supposed to be at 6:00 pm, but we weren't seated until 7:00 p.m. At this point, the men in the family were all upset, but still had to go in, for the sake of the ladies. So we followed the staff to an area, but only to find out that they didn't have our table ready. We were told that we will be scattered or to be sitted in different tables...even though we had a party of twelve. By this time, I was really angry. I wasn't able to hold myself in, I freaked out. They were supposed to find a way to meet our needs. Like they say, customers are always right. But the unorganized staff didn't deliver at all. Everyone in my family were upset because of what was going on and we were suppose to have a great time since it was my daughter's birthday. Anyway, as mentioned the staff were just horrible. We didn't get our drinks in a five minute time frame, but instead longer. It took us even longer to order and to get our food. The most irritating part, they messed up on some of the orders and didn't even apologize. Since I am very carefree, I asked one of the staff for the manager. I told the manager that we weren't happy and that, he had the worst staff any person can imagine.Out of all the cheesecake factory (at the ceasar's forum) staff, the manager, I believe was, the only one who was decent to actually care about his job and the reputation of the restaurant. \\n\\nSkip this place when you are in Las Vegas. The worst restaurant ever. I would rate this place half a star."}
{"label":0,"sentence":"I was really excited to try this place, they brought flyers around our office building for the past month now.\\n\\nI called in an order of 2 chicken gyro lunch specials, regular gyro lunch special, & falafel pita with greek fries, & was told to pick up in 30 mins.  Reasonable time for an order that size.\\n\\nI got there about 15 minutes after I placed the order and the food was already packaged up ready to go.  The \\\"\"waitress\\\"\" had quite a difficult time ringing up my order, ended up giving me $2.00 off the order total, because she was confused about pricing?\\n\\nMy drive back to the office was a total 8 minutes.  Weird, because the french fries in each order were so soggy & nasty, they couldn't be eaten.  Not to mention the fact I paid extra for the greek fries & didn't get greek fries.  The falafels in the pita were hard & dry, to hard to eat.  The gyros were nothing to talk about either.\\n\\nI really wanted this place to be good, again I was so excited to try it.  I love trying local neighborhood family eateries, but  I really don't think DJ Hollywood's will see me again."}
{"label":0,"sentence":"Great service by Allison; TERRIBLE food!  Took over 40 min to get awful, cold food.  Spoke to mgr, who never came to table, and only offered dessert as compensation.  \\\"\"Banana muffin\\\"\" was vanilla cream cupcake?"}
{"label":0,"sentence":"Been eating out lots and lots and lots lately.   I have had such good luck with Yelp, but have had more than one less than positive experiences in the past few weeks with highly, highly recommended restaurants.  I hate to give a negative review, but if I had read anything close to what we experienced, I would not have spent a lot (a lot) of money at Eleven.\\n\\nI am originally from Pittsburgh and now live outside DC.  My husband and 2 sons (age 19 and 16) Went to Eleven solely based on Yelp reviews on a recent visit to Pittsburgh when we were able to take some time away from family events.  I love the Strip, so we  headed to Eleven which, Yelpers, sounded great  - people talked about cozy booths and wooden beams, etc... I was, therefore,  unprepared for the dark, stark, industrial nature of the place.  Yes, it is in keeping with the city and the vibe of the Strip, but I found the whole place to be loud, cold and impersonal.  Opposite of cozy.    \\n\\nThe worst thing really was the odor that hit us as we entered.  Kind of a whiff of wet garbage, maybe?  All 4 of us smelled it immediately, and it was not inviting.  The hostess looked at us like we were crazy.  We had a drink in the bar. (There are TV's.  Why?  ISn't this a classy place?)\\n\\nSmell was in the bar, and in the restaurant but fainter.\\n\\nHonestly, I don't even remember the specifics of the food.  A lot of it was tasty, for sure. All of it was overpriced for Pittsburgh.  I've been in so many similar restaurants in major cities, I guess Pittsburgh is just catching up.  Maybe I don't like seeing the generic pretentious foodiness in a city that is famous for fries on sandwiches?  That's my problem, for sure.\\n\\nIt was expensive, by any measure.  I was actually angry I spent so much on an experience that would have been considered highly average where ever it was.\\n\\n\\nIs this a chain?\\n\\nI would give it 2.5 stars."}
{"label":0,"sentence":"I went here with a couple of friends and their sangria is to die for.  I love their sangria so much, it is so delicious and kind of liked that it was dead to when I went.  The only thing I didn't like is we ordered appetizers here and they were hardly appetizers.  We ordered 3 different appetizers to share and 2 rounds of sangria pitchers for all of us combined.  We were going to share everything completely.  But when the appetizers came they were tiny, and I mean you get one bite each.  It was like a miniature sampler almost.  And when the bill came I just about passed out that 3 little appetizers and sangria could cost well over $100, and I do mean OVER $100.\\n\\nI understand it's scottsdale but if you saw the prices for that volume it's just too insane.  For that same $100 I could have gone to Buca Di Beppo in scottsdale and skipped the appetizers and got a pitcher of sangria and actual food for half if not one third the price.\\n\\nOtherwise the bathrooms were clean, the staff was speedy and friendly, and I loved sitting outside but those prices are so much I'd say only go there for drinks and to hang out. Get your food elsewhere."}
{"label":0,"sentence":"-Organized inside. Smaller than other Goodwill stores.\\n\\n-Filthy, dirty parking lot...small too. Rugged with pot holes. YIKES!\\n\\n-Good prices. Friendly employees.\\n\\n-It's hit or miss on what treasure you might find at this location.\\n\\n-Park on the north or south side of the building - the entrance faces west. Handicap parking is on the north.\\n\\n-I have been in this Goodwill many times and have NEVER found anything."}
{"label":0,"sentence":"Terrible. Me and my hubby went here back in Jan for our anniversary. We waited nearly 2 hours for our food. When it finally arrived, it turned out that they had run out of the Lamb my husband had ordered, and they brought him some pasta plate to compensate for it. And after all this, they didn't even offer a discount on our bill. Never eating here again."}
{"label":0,"sentence":"OMG WORST SERVICE EVER.\\ntook a cab out from the strip bc of the great reviews.. should have just ate the noodle bar in caesars.  \\nordered a tremendous amount from the menu...i expected more dim sum for dinner but they only had a few selections and the ones we chose were out... \\nhad chicken feet... i didnt eat but heard it was amazing.\\nfried rice was dry.\\nthe dimsum we did have was good though..\\nchinese broccoli..i personally dont like so i cant really review it..\\nIMO, dont waste your time unless youre already tehre"}
{"label":0,"sentence":"Cheeeeziest place to spend time, along with ELI's. Same people~ but different names hang out at these 2 places. Crappy drinks and the bar staff put other peoples drinks on your bill. YIKES!  One of the Bands that plays there is good~ but mainly too loud. This place made me want to go back home, lay on my sofa , take  my TV  remote control and watch Celebrity rehab! The people who frequent this place are ...ummm....ummmm WTF where in the world are they from? Gross! The food slides off the table either alive still or greasy and nasty...my chin got 'moisturized' eating that crap. I ordered a vodca cranberry and got a super red #4 carcinogentic something.. that looked like coolaid and tasted like rubbing alchohol and nail polish. I think the word 'eeeew!' is the best word to describe this low class bar...and sorry....I am jumping out on a limb here but..the people are pretty darn ugly and drunk that I saw there. I saw a woman's naked crotch in there, and a guy rubbing himself in there. HEY! Don't kill the messenger..I'm just sayin ."}
{"label":0,"sentence":"Horrible. From the price of juice and milk for kids to the moldy grapes that laid on my food and I mean white mold. Disgusting. Lost my appetite. Service is very very slow and there was only 5 tables. For a place that had steak in their name my daughter did not eat her steak and eggs as it was a horrible peace of cheap sirloin. We live a block a way and will never go back again."}
{"label":1,"sentence":"Love this place!  It is a blessing and very reasonably priced."}
{"label":1,"sentence":"This restaurant has consistently good food at very reasonable prices. I wouldn't bring a date here but I would definitely come here for lunch or dinner with friends. Also this restaurant is open late so a great place to sober up after drinks."}
{"label":1,"sentence":"Food is excellent and tasty! The Roaring Tiger and Lad Na are my favorite dishes but the curries and of course Pad Thai are delicious, too. Portions are generous and the service is spectacular. Would definitely recommend!"}
{"label":1,"sentence":"Wow, another fantastic experience with this company. Tonya (Admin) and Dustin (technician)...you guys killed it! Thanks for taking such good care of me and for the honest appraisal of services needed. I simply won't use anyone but Dukes. As long as they are business, no other company in this industry is relevant to this impressed customer! Great work guys...keep it up. \\nJR"}
{"label":1,"sentence":"Great service, and delicious food!\\nI had the croissant with ham & cheese, which, to my surprise, came served in a full dish with salad on the side, like a regular lunch course.\\n\\n\\n For dessert I tried their chocolatiest treat: Chocolate ganache cake. Delicious and SO chocolatey!! My boyfriend had the waffle with nutella and I have to admit I stole about half of it. delicious waffle!!!\\n\\n\\n At the end, I went upstairs for the bathroom, and saw that the best seats are actually on the top floor! With a bird's eye view on the Royal mile, you can people watch from just about any comfy seat (it's armchairs-only upstairs!!) thanks to well-placed mirrors. Lovely!!"}
{"label":1,"sentence":"I stumbled across this place by accident. I must admit I did not have high expectations, the food in casinos is usually not that good. I was hungry and in a hurry and this place had a small line that moved quickly. I was in no particular mood that day and ordered at random. My selection was The Full Montagu, a sandwich comprised of roast beef, roast turkey, swiss & sharp cheddar cheese, lettuce, tomato & mustard sauce.  The sandwich is served hot and toasty. It was excellent! The combination of meats, cheeses, and sauce was well balanced. The sandwiches here are different and a refreshing change from Quiznos, Togos, or Subway."}
{"label":1,"sentence":"Busy place on a saturday night but they were able to accomodate our party of 12 within about 45 minutes. While we waited we had some beers at the very large bar they have at the front. Several TVs and not dissapointed the the beer. Hop Knot and the Kiltlifter are two of my favorite brews from this place. \\n\\nFood: this is my second time back and think it will be my usual when im ever in Tempe. Ordered the Filet, it had great flavor and cooked perfectly, not dry at all. Had the steamed veggies, which were realy good. They dont cook them all the way so they still have a crunch to them which I enjoyed. For apps get the calamari, they are long and larger than ive typically seen. Be sure to dip them in the spicy red sauce, it makes the app!\\n\\nAtmosphere: this place is packed. But it doesnt necessarily make you want to turn away. The service is great and staff is friendly. Youre in an older red brick warehouse style brewhouse, its a little noisy but as to be exoected for a restaurant this large. Really great atmosphere in my opinion,  unless youre looking for a quiet date night. TVs are in all directions so its a good place to watch the game as well. \\n\\nOverall 4 out 5 stars...its a solid choice in all aspects, but may not blow your mind. Ill definitely be back though!"}
{"label":1,"sentence":"A reliable, trustworthy cleaner for your dry clean onlys that won't rip you off is hard to come by.  Green's owner, however, really gives you that sense that she cares about your clothes--she gave me tips, for instance, on how to keep crickets and moths at bay from my winter cashmere.  Best of all, she will give customers, new and old, a 20% discount with or without the coupon.  Try Green Cleaners out!"}
{"label":1,"sentence":"I like the ambiance of this place...it's pretty and trendy but not too loud. The food and service are really good. THE BEST DESSERT is the Bars of Sin. It is worth going to the restaurant, if just to eat that! PROMISE."}
{"label":1,"sentence":"We ordered sole, shrimp,  mac n cheese and fries. Ooo home made lemonade!  Everything was hot and fresh!  Really nice mom and pop shop... ran by a Dad and Son.  So sweet!  The food reminds me of the Louisiana style you buy we fry in California."}
{"label":1,"sentence":"I think my real rating would be more like a 3.5, but since I can't do that, I'll err toward the better side.\\n\\nOur server, lemme say, was GREAT - funny, nice, very available, very helpful in menu recommendations\/wine selection\/reminding us of upcoming specials, etc. I'm pretty sure his name was Travis, but I won't make any promises.  Anyway - he was very friendly & definitely a pro.\\n\\nThe menu was extensive - there would definitely be something for even the pickiest of eaters.  I'm not a tapas expert, my boyfriend wouldn't call himself an \\\"\"expert\\\"\" but he knows a lot more than me, and he seemed to think the menu was great, too.\\n\\nI'm not big on seafood (with the exception being, of course, fish fry - I AM from Wisconsin after all! :D), so we had the short ribs that our server recommended, the chicken croquettes, the goat cheese, the artichoke & fennel salad, and then we had the chorizo flatbread.  I couldn't resist dessert, I ordered the pear tart & the truffle cake.\\n\\nMOST of the food we got was excellent, the only complaints I have are 1) in regards to the desserts.  The ice cream on one tasted freezer burned to me, which was a total buzzkill, and the other one, the tart seemed kind of frozen, ((but the cake & the tart were soooo good that it ALMOST made up for it.)) and 2) the portions were super small for what they were charging.  We've eaten tapas in Boston & paid less for bigger portions, which is surprising, because Boston's usually a pretty expensive city.  BUT the food was great :D\\n\\nThey also have $15 bottles of wine on Wednesday nights, which we were happy to take advantage of :D.  We decided later that it's a pretty good gimmick - cuz for the two of us we spent over $70 on dinner, way more than we usually would have for a non-special occasion - so if you can get people in by lowering the wine price, so be it!  We left happy.\\n\\nThe decor in there is spectacular, although there's not a lot of space.  I was kind of disappointed that on a Wednesday night we had a table seated right next to us and we were elbow to elbow and practically sharing conversations with one another the whole time.  But it's not like there was anywhere else to put them, the place was relatively full for a Wednesday.  Space on State St. is at a premium, so I'm not surprised that the place is pretty small, and you've gotta serve as many people as possible in order to pay that rent, so I don't begrudge them that.  \\n\\nThe moral of the story is, I'd definitely go back for drinks, dessert, appetizers, but I don't know if I'd go back for dinner, just because of the cost\/portion size thing."}
{"label":1,"sentence":"I just had lunch with the girlfriends At TB and was pleasantly surprised.  We had a party of 16 chatty women and our server-Derek- treated us like royalty!  He gave descriptive menu recommendations that were spot on.  He managed to keep all of our orders straight, with a number of special requests, and his pacing was spot on. You always worry that service will be sub par with a big group-but Derek never missed a beat.  To top it off I ordered his suggestion, the Chicken Mango Salad-and it was the perfect meal for a hot summer day.  It had sweet, sour, crunchy, yumminess in every savory bite!  I will certainly look forward to my next visit!"}
{"label":1,"sentence":"best service any music lover could ever ask for! i bought my first guitar from this location a while back and i recently just stopped in to buy my first pedal for my guitar. i have to say that Zachary (i believe thats his name.. slightly ginger hair, short scruffy beard) helped me out so much! he spent over an hour and a half with me showing me\/ letting me play just about every pedal they had out. he not only took the time to teach me how the pedal worked and what certain settings do and what sounds they make (as I've never used a pedal before in my life) but he also really took an interest as to what sounds i am into as far as playing goes and was also showing me cool sounds with different combinations of pedals that he thought would work well with my sound. he didn't try and push me toward any certain pedal just to get me out of there, he helped me to experiment with each sound to let the right pedal find me. his expertise helped me narrow down the selection and ultimately pick the perfect pedal. i walked out of there feeling extremely confident and happy with the choice of pedal, i was super anxious to get home and start experimenting!!! i from now on will ALWAYS be buying any future pedals\/guitars from this guitar center, they know what they are doing. thanks so much zachary!!"}
{"label":1,"sentence":"Fantastic vet!"}
{"label":1,"sentence":"The Faubourg is in a constant flux of renovation but no matter how difficult it is to find the staircase or escaltor amid the construction, Bangkok, nestled on an unassuming third floor food court, always has a crowd. Now many people love marveling that \\\"\"the best Thai food in Montreal is located in a food court.\\\"\" They're wrong. Bangkok is not the best Thai in Montreal but it is by far the best Thai for the price in Montreal. Most dishes are between 6 and 7 dollars (compare to 15-18 at the better and fancier Thai places). So it's good food for the same prices you'd pay for a pile of greasy noodles at Thai Express (although I admit to eating there once in a while but that's just because they're practically everywhere)\\n\\nThe food is spicy too. Usually when I ask for spicy, it's not. I once saw a woman trying to return a green curry chicken because she said it was \\\"\"too spicy.\\\"\" After they tried to explain to her that curry is spicy, she left her hardly touched plate on the table and walked off in a huff.  I laughed and thought to myself (although wished I had the gall to ask her to her face), \\\"\"you ordered a curry. What did you expect? If you don't like spicy food, why are you eating Thai at all?\\\"\""}
{"label":1,"sentence":"It's rare that you find a place that is exactly what you've been looking for in a conversation spot, a pre-drink, a hang-out and \\\"\"let's go there\\\"\" without experiencing a parking problem and obnoxious patrons.\\nAs I have experienced it, the Pigs Meow appears to be one of the Phoenix\/Arcadia concepts that has scored dramatically and is drawing a lot of attention in only two months. You'll love this place. I love it so much I'm holding off my review so I can enjoy the synergistic and soulfully crafted environment for now..."}
