{"label":0,"sentence":"what ends up killing this movie is its self-consciousness, among other things. here's a short list: 1. irreverent behavior. when the beatles came over and injected their brand of \"quirky, irreverent\" behavior\/humor, it was greeted as fresh. that was over 4 decades ago. get over it.<br \/><br \/>2. false sophistication. spewing out base, quasi-socio-political-isms is hard ground to make work comically. ask woody allen.<br \/><br \/>3. the post-modern \"i'm hard on this phony world and yes, i recognize it in myself\" snake eating itself - used as illustration with another animal in the film itself! - is such a retread.<br \/><br \/>4. smarmy, smug drollness.<br \/><br \/>5. amateurish writing, acting, direction... ever seen student films? a victim of itself, about the only thing i can say positive is that it at least has a sense of itself, and sheesh, now i'm getting caught up in the self-reflexive thing that it posits as worthwhile, of value.<br \/><br \/>but towards... what? ultimately, it just rings as hollow as any other pretentious piece - hey, ever see woody allen's take on bergman, ie: \"Interiors\"??? well, this just does it more amateurishly."}
{"label":0,"sentence":"and not in a fun-to-watch way. it's just bad. it's shocking that people have posted positive things about it here. the story sucks, the acting is bad, it's not scary, the special effects aren't special--oh no! the blackboard has hands coming out of it! oh gee--the mirror turned into water! the hair, clothes and makeup in the '50s scenes aren't accurate, and they got a middle-aged man with a receding hairline to play the high-school version of himself. this is like later-on nightmare on elm street stuff. i enjoy sitting down to watch a cheesy horror movie as much as anyone else, but there are better bad ones out there to choose from."}
{"label":0,"sentence":"Amy Poehler and Rachel Dratch are among the funnier women to have been on \"Saturday Night Live\". It's unfortunate that they, along with Tina Fey and Maya Rudolph, were on SNL during the longest stretch of unfunny writing and sketch-making (circa 2002-2006) the show has ever had. Still, these two women most especially know what's funny, and they know how to write a funny movie.<br \/><br \/>You'll notice in the credits of this movie that Dratch and director Ryan Shiraki wrote the story for \"Spring Breakdown\", but who wrote the actual screenplay, consisting of dialogue and all the important fill-in-the-blank material that makes a story into a multidimensional movie? Yep, just Shiraki. Just one guy wrote the dialogue for this movie, and no women apparently wrote the script with him. The result is a pretty cliché spring break movie that doesn't so much spoof the faux holiday as much as exploit it equally as much as MTV does every year.<br \/><br \/>If Dratch, Poehler, and even co-star Parker Posey could have contributed their handwriting to the screenplay, it would have been far less cliché. The premise is original, being about three thirty-something women who were unpopular in high school (and apparently college, too) who never had the fun spring break trip they allegedly dreamed about. I say \"allegedly\" because you never quite know what fun is to these characters. They entered talent shows in the past where they sing stale pro-woman anthems like \"True Colors\", and spend their nights together holding make-your-own-pizza parties. Even though none of them are especially unattractive, the outside world appears to treat them like they are. There's a scene where a blind student of Poehler's (played by Poehler's real life husband Will Arnett) asks her out on a date, only to touch her face and immediately change his mind. If Poehler's character is supposed to be unattractive, they obviously hired the wrong actress.<br \/><br \/>The movie continues to show promise, even though we have our doubts about the main characters, when Posey's boss, Texas Senator 'Kay Bee' Hartmann (Jane Lynch, funny as always) hires Posey to watch over her unpopular college-age daughter (Amber Tamblyn, playing yet another woman who's attractive in real life, but not in the eyes of any characters in this movie) while she goes to a Laguna Beach-like vacation spot for Spring Break. Poehler and Dratch come along, they reluctantly get boozed up, party like they apparently should have when they were in college, and then comes the ultimate showdown with the sorority bitches lead by Sophie Monk.<br \/><br \/>Sophie Monk is an incredibly attractive woman who has a body both women and men would kill to have for different reasons. Unfortunately, her movie career is off to a rough start with the abominably unfunny \"Date Movie\" (2006) and the disappointing \"Click\" (2006). Here, she plays a Southern belle, although her voice sounds like she stole Delta Burke's voice box. She hams it up a little too much, trying too hard to play a conniving bitch that she comes off as much like a caricature of spoiled college kids as the rest of the extras.<br \/><br \/>\"Spring Breakdown\" was released straight to DVD despite the star power of Amy Poehler, but rightly so because the story is way too cliché. It may as well have been called \"National Lampoon's Spring Breakdown\", and the magazine probably wouldn't have sued for trademark infringement because of the free publicity. If director Shiraki had given at least one woman the creative input, especially Rachel Dratch, this movie would have been great and not nearly as run-of-the-mill as frat-house comedies we've seen before. I know Dratch will come up with another funny concept, and hopefully be allowed to fill in the rest of the screenplay herself. She's funny enough, and she deserves better than this half-baked comedy that would accept Stiffler's brother with open arms."}
{"label":0,"sentence":"The one thing that occurred to me after watching this drivel, was i would never get the time I used to watch this, back again. If you want to see Stacey keach and Michael dorn try and earn what must have been then, the down payments on a holiday home then stay tuned. Wooden acting, poor special effects, the only comedic highlight was whilst our alien hero was in female form and this is over as soon as she has done her obligatory b-movie nude sex scene within 30 mins into the movie. The opportunity to have made what could have been a decent movie disappears the moment Nicole Eggbert clocks the alien in a bar within 30 seconds, whilst the Police, Military and Joe public don't cotton on that the woman drinking coffee, dosn't use the cup handle and wears four jumpers at once. She must obviously be from another planet. Just where I wish I was when this movie was on."}
{"label":0,"sentence":"This is the most elementary sort of traditional ghost story, not even enlivened to any great extent by the use of Irish locations. If the great M.R. James had ever come up with a tale this thin -- doesn't James in fact have a story called \"A Thin Ghost\"? -- he wouldn't have bothered to have it published.<br \/><br \/>Orson Welles appears in the limp endpieces as a favour to a brace of old friends, this film's producers. His presence and the one movie industry in-joke would have earned this will-o'-the-wisp its Oscar nomination. This is yet more proof, if any more were needed, that the Academy Awards have never been any guarantee of merit."}
{"label":0,"sentence":"This movie is NOT the same as the 1954 version with Judy Garland and James Mason, and that is a shame because the 1954 version is, in my opinion, much better. I am not denying Barbra Streisand's talent at all. She is a good actress and brilliant singer. I am not acquainted with Kris Kristofferson's other work and therefore I can't pass judgment on it. However, this movie leaves much to be desired. It is paced slowly, it has gratuitous nudity and foul language, and can be very difficult to sit through.<br \/><br \/>However, I am not a big fan of rock music, so it's only natural that I would like the Judy Garland version better. See the 1976 film with Barbra and Kris, and judge for yourself."}
{"label":0,"sentence":"First of all, the actor they have to play Jesus has blue eyes... half the actors they have playing Jews have blue eyes. Aren't there enough brown-eyed actors out there? Jesus being depicted as having blue eyes is one of my pet peeves. He was a full-blooded Jew! Second of all, what is it with old English-language movies that are supposed to take place in non-English-speaking countries, and everybody has English accents? (Another example is David Lean's \"Dr. Zhivago\".) Aren't there enough either Jewish actors or actors who can do a Israeli accent? The movie often is not true to the Scriptures, and so seems to doubt the legitimacy of Jesus's claim to be the Messiah. In the bible, when Jesus is baptized by John, a voice comes from heaven saying \"This is my beloved son, in whom I am well pleased\" (Matthew 3:17, Mark 1:11, Luke 3:22). In the movie, John the Baptist says this! The screenwriter seems to be trying to portray the believers as crazy, as well. For example, in the bible, the angel Gabriel tells Mary she will become pregnant with the Son of God (Luke 1:26-38), but in the movie, we do not see or hear any angel - Mary appears to be talking to a moonbeam, and when Mary's mother hears her talking to someone and peeks in on her, she doesn't hear or see anyone either. Also, in the movie, when Jesus is speaking to the Pharisees in the Temple in Jerusalem, he says, \"You shall not see me here again, not until you learn to cry, 'Blessed is he who comes in the name of the Lord', for I and my father are one and the same.\" The correct line (Matthew 23:39 and Luke 13:35)is \"You will not see me again until you say, 'Blessed is he who comes in the name of the Lord.'\" Period. Jesus never claimed to be God. The movie cuts out a lot of important parts (the Sermon on the Mount is very expurgated), but then spends a lot of time on stuff that isn't even in the bible (a whole scene with Mary Magdalene talking with a john). It seems like the screenwriter, instead of wanting to do a movie version of the Scriptures, wanted to make a movie about what he thinks might have really happened behind (and between) the scenes. The movie has one gem though - during the scene where Jesus tells the parable of the Prodigal Son, at Matthew the tax collector's house, I had tears streaming down my face. It is the best movie I've seen about Jesus's ministry (but that isn't saying much, because the others are just terrible). \"Jesus Christ Superstar\" is my favourite movie about Jesus's last days (\"The Passion of the Christ\" is way too graphic), though I like how \"Jesus of Nazareth\", instead of just ending with Jesus's death, continues on and shows his resurrection."}
{"label":0,"sentence":"OK I caught this film halfway through, but.oh.dear.god.it.sounds.like.they're.all.reading.from.scripts.<br \/><br \/>Especially that guy who is now in Teachers and the Book Group, although at least he has proved that he can act if he wants to! (the part where someone has a heart attack stands out as a bastion of bad film making both in terms of acting, scripting and general plausibility) It quite clearly appears to be a cash-in on Human Traffic, but whilst that is not the best film ever, it is at least original and had actors whose delivery did not resemble that of earnest-yet-hopeless GCSE students trying to get a pass grade. Not so much as Human Traffic as a bit of a car crash!"}
{"label":0,"sentence":"I think that movie can`t be a Scott`s film. That is impossible. Do you remember Blade Runner? And Alien? Two greats movies versus a one. I hope didn´t see ever it. good bye!!"}
{"label":0,"sentence":"Ascension is actually a step up in terms of what the original movie was in story and in special effects. Jason Scott Lee Is good as a vampire hunter looking for the count himself (if you remember him, he was from the movie Dragon, The Bruce Lee Story.') Jason London is funny as Luke, the kid who helps the woman he loves from a far steal Dracula's body from the slab. Diane Neal Is good as the woman who steals Dracula's body in order to finds a cure for her dying boyfriend, And Stephen Billington is great as Dracula himself. Giving a better performance than Gerard Butler did the count in the original film. Roy Scheider rounds out the rest of the cast in this movie, and he does a decent job as the mentor of Jason Scott Lee's character. This is the second sequel in the trilogy, and they are off to a good start. It's up in the air whether the last film will close the series out on a good note."}
{"label":0,"sentence":"If you have plenty of time to waste ... it's OK. It moves at a good pace but to pull this movie off it would need to be a little longer with a little more background on the sitter. <br \/><br \/>The acting is OK. Mariana Klaveno as the sitter does the best job and is the most believable.<br \/><br \/>William R. Moses played a pretty good part as the husband.<br \/><br \/>Gail O'Grady, as the wife, had a weak part and the reasons for her going back to work were not developed.<br \/><br \/>The ending is sort of silly. Like most of these sitter movies ... there are parts that are interesting ... but overall it leaves you wondering why you spent the time."}
{"label":0,"sentence":"I'm sorry, but this may have been scary in 1978 when it came out, but in modern times it just doesn't hold up. The only interesting scene in the entire movie is the opening scene where Michael kills his sister, Judith, wearing his Halloween mask. The most startling moment in the whole film is when his parents rip the mask off to see their son killed their daughter. The film goes downhill from there and doesn't pick up until the last fifteen minutes, but by then it's too late, we the audience have lost all interest in the story. There is barely any character development, and people always rave about Laurie being such an exceptional heroine, when there really isn't much to her. I'm sorry to disagree with everyone terrified by this movie, but if you want a great horror movie go watch The Shining or Rosemary's Baby. Those are the two best horror films ever made. Halloween is certainly not in their ranks. I can't believe Roger Ebert gave it four stars, for there is no way this film could ever deserve such a high rating."}
{"label":0,"sentence":"The first half hour or so of this movie I liked. The obvious budding romance between Ingrid Bergman and Mel Ferrer was cute to watch and I wanted to see the inevitable happen between them. However, once the action switched to the home of Ingrid's fiancé, it all completely fell apart. Instead of romance and charm, we see some excruciatingly dopey parallel characters emerge who ruin the film. The fiancé's boorish son and the military attaché's vying for the maid's attention looked stupid--sort of like a subplot from an old Love Boat episode. How the charm and elegance of the first portion of the film can give way to dopiness is beyond me. This film is an obvious attempt by Renoir to recapture the success he had with THE RULES OF THE GAME, as the movie is very similar once the action switches to the country estate (just as in the other film). I was not a huge fan of THE RULES OF THE GAME, but ELENA AND HER MEN had me appreciating the artistry and nuances of the original film."}
{"label":0,"sentence":"This was one of the most boring movies I've ever seen\u0085 I don't really know why\u0085 Just your run-of-the-mill stories about guy who is about to get married, and starts to fancy someone else instead. Story has been told a thousand times. Nothing new or innovative about it at all.<br \/><br \/>I don't really know what was wrong with this film. Most of the time when these kinds of actors\/actresses get together to make a film that have already been made a million times before, it's really entertaining. There are usually little clever thing in them that aren't really in any other. For some reason, this one just doesn't hold your attention. You can pick out some funny parts, or clever ideas in it, but for some reason they're just not funny, nor clever in any way\u0085 I wish I new how to explain it, but I don't\u0085 Just don't waste your time on this one\u0085"}
{"label":0,"sentence":"I'm not sure why Spike Lee made this train wreck of a movie and conned poor Stevie Wonder into eternally pairing his beautiful music with this theatrical mess. I also resent the way he uses profanity as a part of the normal prose of professional Blacks. The abuse of his hold on ethnic movie goers is a shame. Scenes which seem to be contrived out the blue and have nothing to do with the theme or sub themes, play as if some college kid wrote this. I especially detest the ludicrous scene where the two leads are playfully sparring for no reason at all and the cops come and rough up Snipes. The overacting of the leads makes one feel as if Spike has no respect for his viewers or he has no clue what a movie is all about. The final scene appears to be thrown in to justify the use of a sledge hammer to tack a point in. This movie also supports the myth that all people of culture use the F-word in casual conversation. I am hoping he will realize that the rest of his movies are in the same pool as this one where he is not growing as a film maker. I think his union with Scorcesee in Clockers was a wise move. He should stick to making documentaries like the Four Little Colored Girls. Shock movies do not an Oscar make."}
{"label":0,"sentence":"This is an action Western. James Steart leads an all star cast in the scenic Northwest, which is filmed in great splendor. The scenery and costumes are great. There is action and adventure. Stewart plays a wealthy cattleman who runs afoul of a crooked government in the old Nothwest.<br \/><br \/>The main drawback is the stereotypical cynic that Hollywood has always made into a hero. Even when this movie was made, the cynic was the stereotypical hero, and the one Stewart portrays really has few saving graces. He is kind to his two partners, and that does give him an extra dimension of credibility and likability.<br \/><br \/>However, he is so piggish to everyone else, it is hard to really care for him, or to accept him. He is much like the one dimensional spaghetti Western characters (cut not that bad).<br \/><br \/>Still, the minor characters are quite enjoyable. Walter Brennan, Royal Dano, Harry Morgan, and others make this worth watching."}
{"label":1,"sentence":"One of the things that interested me most about this film is the way the characters and their associated histories are developed on the fly. I suppose the writers wanted us to gain interest in the characters by not force feeding their characters. The premise of using the art and craft of furniture design and construction was a unique theme and\/or analogy for what families\/siblings go through in life. The complexity of having a twin serve as a surrogate father and even husband added great tension towards making this film emotionally interesting. Also, although the story was not one that the masses might directly relate to (i.e. Jewish\/twins\/family business) the themes are fairly universal as every family has a black sheep in it. That made it very engaging."}
{"label":1,"sentence":"Yaitate!! Japan is a really fun show and I really like it! It was shown in our country just recently in Hero TV and ABS-CBN every 5:30. It is about Azuma Kazuma who is trying to fulfill his dream to make Japanese bread that will represent his country. He is working in the Southern Toyo branch of Pantasia and he is also helping his friend (Tsukino Azusagawa) along with other bakers (like Kawachi Kyousuke and Kanmuri Shigeru) to beat St. Pierre and take control of Pantasia. They fight other skillful bakers from many other countries and not only learn to make different kinds of bread but also learn to cook other food. It is a really funny and unique anime because they also mimic characters from other anime(like Naruto, Detective Conan and One Piece)and famous people from real life. It is one of the best works of Takashi Haschiguchi and is really a must-see for people of different ages."}
{"label":1,"sentence":"This movie has no story. It's only about a bunch of guys who tortures an innocent young girl to death.<br \/><br \/>!!!SPOILERS!!!<br \/><br \/>This is what they do: They beat her, put her in a net and let her hang inside like birdfood, spin her around on a chair until she pukes, expose her to loud noise, pour boiling oil on her, put worms in her sores, crush her hand with a sledge-hammer and finally pokes a needle through her eye.<br \/><br \/>This movie was so realistic that if I didn't know it was fake I would have thought it was a snuff-movie. Although I was disgusted by this movie i really liked it. It scared me. I guess it fills some kind of purpose. I give it a 10\/10."}
{"label":1,"sentence":"1933 seemed to be a great year for satires (\"Duck Soup\" for instance) and this one fits in well even though it is about the obsession with contract bridge. The tone is like a humorous piece from The New Yorker, appropriate, since the film begins with the \"Goings On About Town\" page of that magazine. The only thing odd is the casting. Made a few years later William Powell and Myrna Loy would have been perfect. However, after 1934, you wouldn't have had adultery handled in such a sophisticated fashion, the young and beautiful Loretta Young in some shear and slinky outfits, or a group of prostitutes listening to a bridge contest on radio. Even if you know nothing about bridge, you may still want to check out a rare example of Hollywood satire."}
{"label":1,"sentence":"A THIEF IN THE NIGHT is an excellent fictional account of the weeks leading up to the RAPTURE and the weeks following that pivotal event.<br \/><br \/>I thoroughly enjoyed both the production values and the content values of this independent Christian movie.<br \/><br \/>THE PRODUCTION VALUES. Hey, it's an independent movie, with a shoe-string budget, so, ya, it's going to look a bit cheesy (if your standard is A-list Hollywood fare). But, properly compared with other independent movies, this film is perfectly acceptable. More important than acting style, costumes, and music is the narrative itself. Is the story compelling? Do the dramatic moments work? Does the story trajectory build to a satisfying climax? The answer to all these questions is an unqualified \"yes.\" As a side-note, the truly important technical stuff--continuity, sound, lighting--are fine. The viewer is able to watch the show without being distracted by sloppy craftsmanship.<br \/><br \/>CONTENT VALUE. The message of the movie is superb. When you consider how many ideas the movie-maker developed within the brief span of 69 minutes, you begin to appreciate his artistry. He presents the message of salvation, the consequence of unbelief, the danger of backsliding, the truth of the rapture, and the threat of a world-dominating satanic government with flare, imagination, and--most importantly for an evangelical movie--with biblical accuracy.<br \/><br \/>The movie-maker is a good storyteller. For example, he develops the message of salvation in two important ways: (1) he shows us through action the reality of Jesus Christ's sacrifice for our sake. This is achieved in a subplot where the zoo-keeper is bit by a poisonous snake and nearly dies. The only cure is blood from someone who is immune to the snake-poison. The poison is like sin; the cure is like Christ's blood, shed on the cross. (2) The filmmaker also develops the message of salvation through dialog. He has various characters explain the truth about human sin and the need for salvation through faith in Christ. So, the movie-maker uses both action and dialog to tell his story.<br \/><br \/>As a side-note, the fact that a movie produced by evangelical Christians actually contains dialog and scenes that convey a clearly delineated message of salvation, couched in explicitly evangelical Christian language, imagery, and theology is also perfectly acceptable. To criticize this film for being explicitly Christian is absurd; it's akin to criticizing a Nike commercial for promoting sport-wear. What else would evangelical Christian movie makers make, if not a film that states their case? Also, the fact that the movie-maker employs the idea that the unbelieving will be left behind in a godless world is, again, perfectly acceptable. The movie-maker uses the dramatic potential of that idea admirably. How do I know? I heard about A THIEF IN THE NIGHT from a woman who saw the show way back in 1974; it still lived in her memory thirty years later. How many movies can you say that about? All around, a very enjoyable, thought-provoking show. I plan on showing it to my teen group at church."}
{"label":1,"sentence":"Everyone has a first love, and though it is hard to define that feeling when you're younger, it is there, aching inside you. That is what Malaysian filmmaker Yasmin Ahmad aims to prove in her fourth feature, a movie where that most complex of emotions is recounted in a deceptively simple, straightforward fashion.<br \/><br \/>Such an approach is especially convenient in this case, as the love story at the film's core involves two twelve-year olds, and would therefore make any attempts at \"deeper\" analysis seem contrived and pretentious. That they don't is also testament to the astounding performances given by the leading non-actors, Sharifah Aryana and Mohd Syafie Naswip. The former plays Orked (already seen as an adult character in Ahmad's previous picture, Gubra), a lively, almost rebellious girl who, perhaps influenced by her \"British\" upbringing (her mother studied in England), despises playing with dolls, preferring to play violent sports with the boys. Then one day she meets Mukhsin (Naswip), who has come to spend the holidays at his aunt's house, and all of a sudden she changes her habits: goodbye fistfights, hello bike-riding and tree-climbing. But what does this mean? Are they just friends, or is something more implied, something neither of them is yet ready to understand, let alone accept?<br \/><br \/>Given the young age of the protagonists, answering those questions borders on impossible, and so, like in several \"smaller\" films (Lost in Translation comes to mind), there is no real closure, a choice that leaves a bittersweet, but ultimately satisfying aftertaste: the naturalistic, unfiltered acting (especially Aryana's) gets to the heart almost immediately, and a strong supporting cast (Orked's family most of all) helps keeping the minimalistic narrative fun and seducing. The down-to-earth approach isn't always that effective (the hilarious subplot regarding an adulterous neighbor is dropped way too early), and it is hard to justify the bizarre Pulp Fiction reference at the start of the feature, but the emotional strength of the teenage romance is enough to make this an interesting piece of independent Asian cinema."}
{"label":1,"sentence":"I watched this film so many times through my child hood that even to this day i can pretty much re-sight all of the dialogue. And when I watch it now it just makes me happy and surprisingly still laugh. I think it's amazing how they managed to train animals especially the cat to the extent that they are able to play the main role of a feature film. However watching it now I can also unfortunately notice that it isn't the masterpiece i once thought it was. But i prefer to remember how i felt about it when i was younger watching it on VHS on my fist TV that would cloud the image in yellow. And and bearing in mind it is a children's film, that is why i would still definitely give it 10\/10."}
{"label":1,"sentence":"for whoever play games video games here did anybody notice that the GTA:Vice City Mansion inside the game and some other things including weapons from the movie that are connected to this movie and this movie inspired the makers of the game (Rockstar Games) to copy some things from this movie and by the way this is one of the best 80's movies out there i recommend this for anybody who still didn't see it 10\/10 no questions asked"}
{"label":1,"sentence":"The title of this film nearly put me off watching it. Not being a Manchester United fan, the mere mention of Beckham was a bit off putting, however I put my prejudices behind me and I'm glad I did.<br \/><br \/>I wasn't expecting much of a film, but I was pleasantly surprised. The film sped along with me never looking at my watch and I enjoyed every second of the film. If you liked East is East then you'll love this film. OK so the storyline is nothing new, and the classic storylines are contained within the film but it's all done very funnily, and with a breath of fresh air. The film moves very fast and keeps the audiance entertained. The occaisional funny moments are a good chuckle and not some poor attempt at humour, and best of all it's a good british comedy."}
{"label":1,"sentence":"I was hooked from beginning to end. Great horror comes from disturbing imagery and organic shocks that are created not to make you jump, but to make you go \"What the f*ck did I just see?\" All the other commentators gave short summaries of what the film is about, so I won't rehash what has already been said. I was telling other people about this movie days after I had seen it just because it still haunted me. I even had a bad dream after seeing it, and I am a true horror fan, not easily spooked by tripe like \"The Grudge\" or even \"Silent Hill\". What gave me the bad dreams was the unease I felt about what I would do if I were in that cell with those guys. What would my personal horror be? my subconscious took me there, and it was not pleasant. That my friends is what a good horror flick does to you! The best part of this movie is that it is subtle. It's not about Bogeymen that jump out at you,alien invasions, or tons of gore. It's the opposite. The horror you create in your own mind. The irony for the four characters is that the horror comes not from an external force that asserts it's power over them. Simply, the men ask for the one thing they desire, and they get it...but not in the way they imagined. So on the one hand, they get what they wish for from an occult book, but may ultimately wish they hadn't. Sometimes being locked in a jail cell is the best place to be!"}
{"label":1,"sentence":"This is an excellent, heartbreaking movie. It is by far the best I've seen that depicts the current reality in Latin America...kidnappings, corruption, ruthless and greedy police officials and heartless mayhem towards innocent victims. Denzel Washinton gives the most moving performance in his career, in my opinion. Dakota Fanning is an amazing young actress. The relationship between Washington and Fanning is wonderfully written and portrayed, I believed every minute. The cast is brilliant, Christopher Walken, Mickey Rourke are great as always. Walken lights up the screen for me like no other actor. I would have loved to see more of both of them. The authentic locations are remarkable. The camera work is interesting and different. There are many famous Latin actors in the cast, making it all the more interesting for people familiar with Latin American cinema. I highly recommend this movie."}
{"label":1,"sentence":"The way the story is developed, keeps the audience wondering what is the tenant's dark past. We get some clues during the series, but enough to keep us interested in the mini-series. The characters are all believable and I personally felt immersed and surrounded by the story."}
{"label":1,"sentence":"Noll's comfortable way of rolling out blunt comments, often with expletives, to describe things that he is more knowledgeable about than most is quite refreshing. There is one other character in the film that constantly tries to verbalize complicated issues, using more language than necessary. This guy should never have been given a Thesaurus. Cut to Noll and you know you're in for a treat!<br \/><br \/>The way the pioneers of big wave surfing are portrayed is very evocative of a \"lost era\". Nevermind the fact that no one knows how these guys made a living, much less took care of issues like medical care. The use of old film clips throughout was masterfully done."}
{"label":1,"sentence":"These things have been floating around in my head for damn near 10 years now. Some pieces of this work were really memorable. - Id love to see another more current example of cg showy offy stuff. Actually I'd love to be part of it.<br \/><br \/>If I'd would of had the chance to just say what i wanted and thats it, I wouldn't have to write all this extra in order to make \"10 lines if text\" as this website requires. I mean really? This almost discourages me, I mean luckily for the guys that made the movie I really liked the Minds Eye - and it took me 3 times to have enough lines, I hope you don't get me on the misspelling. - yup you did."}
{"label":1,"sentence":"Kudos to the writers of this film for creating a supremely engaging drama. The curious character development is indicative of a nuanced and well schooled writing team. The audience member cannot but help but to feel that (s)he must make wrenching emotional decisions pitting the cerebral against the libidinal. The viewer has an opportunity to develop the character herself, though her predictions are rarely validated.<br \/><br \/>Credit is also due to the filmmakers for breathing life into the setting. The wood-shop is transformed into a unique persona as the film unfolds, with its own traits, faults, a variety of highly charged relationships, and of course a fate inexorably tied to that of the other principals.<br \/><br \/>Make sure to catch this one at your local art-house."}
{"label":1,"sentence":"In the year 2006, \"In Cold Blood\"-a riveting thriller from 1967-has two new interesting contexts that it did not previous have. First, and most chillingly, is the fact that it's star, Robert Blake, was recently on trial for murdering his wife. Second, the recent Oscar winning biopic, \"Capote\" showed the muddled back story of this haunting true crime tale's author, Truman Capote. These two new twists make the film timely for a modern audience.<br \/><br \/>As a stand alone film from it's era, \"In Cold Blood\" is top notch in every way. Most notable is the stunning black and white cinematography from Conrad Hall (later of \"American Beauty\" and \"Road to Perdition\" fame). Many of the stills from this film of the Kansas farm house at night or the tree-lined back country roads could be sold as fine art photography. Combined with the cracker-jack direction from Brooks and superb editing in the early scenes (where we see the mundane daily life of the innocent family about to be senselessly slaughtered beautifully intertwined with the plotting of the two hapless killers), a rich brooding atmosphere is created that sets the stage for riveting suspense (even when everyone knows how this is all going to end due to the fact its all based on real life events). It's also great to see in this day and age how brilliantly staged a harrowing murder scene can be depicted where the graphic nature of the act is transmitted to the viewer subliminally with nary a drop of blood shown on screen.<br \/><br \/>The film is also anchored nicely by Robert Blake's eerie performance as the more sympathetic yet senselessly brutal side of the killing duo. The flashback scenes to his horrible childhood are extremely well done. Then there is the scene towards the end of the film where he is speaking to the reverend before being sent to the gallows and he makes his last \"confession\" so to speak. It's one of those classic movie moments that is a perfect marriage of gritty acting, superb writing, flawless direction, and haunting photography. I dare you to erase from your mind the stark image of the rain's reflection from the window flowing down Robert Blake's pallid face in lieu of actual tears.<br \/><br \/>The only thing hampering \"In Cold Blood\" is the slow moving middle act where the killers are on the lam and the forced nature of the social commentary at the end. The tacked-on political message about the death penalty is secondary to its compelling depiction of the mad killers and their prey."}
